{"authors": "Debanjan Ghosh; Elena Musi; Kartikeya Upasani; Smaranda Muresan", "pub_date": "", "title": "Interpreting Verbal Irony: Linguistic Strategies and the Connection to the Type of Semantic Incongruity", "abstract": "Human communication often involves the use of verbal irony or sarcasm, where the speakers usually mean the opposite of what they say. To better understand how verbal irony is expressed by the speaker and interpreted by the hearer we conduct a crowdsourcing task: given an utterance expressing verbal irony, users are asked to verbalize their interpretation of the speaker's ironic message. We propose a typology of linguistic strategies for verbal irony interpretation and link it to various theoretical linguistic frameworks. We design computational models to capture these strategies and present empirical studies aimed to answer three questions: (1) what is the distribution of linguistic strategies used by hearers to interpret ironic messages?; (2) do hearers adopt similar strategies for interpreting the speaker's ironic intent?; and (3) does the type of semantic incongruity in the ironic message (explicit vs. implicit) influence the choice of interpretation strategies by the hearers? ⇤ Part of the research was carried out while Debanjan was a Ph.D. candidate at Rutgers University.", "sections": [{"heading": "Introduction", "text": "It is well understood that recognizing whether a speaker is ironic or sarcastic is essential to understanding their actual sentiments and beliefs. For instance, the utterance \"pictures of holding animal carcasses are so flattering\" is an expression of verbal irony, where the speaker has a negative sentiment towards \"pictures of holding animal carcasses\", but uses the positive sentiment word \"flattering\". This inherent characteristic of verbal irony is called semantic incongruity -incongruity between the literal evaluation and the context (e.g., between the positive sentiment words and the negative situation in this example). Most NLP research on verbal irony or sarcasm has focused on the task of sarcasm detection treating it as a binary classification task using either the utterance in isolation or adding contextual information such as conversation context, author context, visual context, or cognitive features (Davidov et al., 2010;Maynard and Greenwood, 2014;Wallace et al., 2014;Joshi et al., 2015;Bamman and Smith, 2015;Muresan et al., 2016;Amir et al., 2016;Mishra et al., 2016;Ghosh and Veale, 2017;Felbo et al., 2017;Hazarika et al., 2018;Tay et al., 2018;Oprea and Magdy, 2019). Such approaches have focused their analysis on the speakers' beliefs and intentions for using irony (Attardo, 2000). However, sarcasm and verbal irony are types of interactional phenomena with specific perlocutionary effects on the hearer (Haverkate, 1990). Thus, we argue that, besides recognizing the speaker's sarcastic/ironic intent, it is equally important to understand how the hearer interprets the speaker's sarcastic/ironic message. For the above utterance, the strength of negative sentiment perceived by the hearer depends on whether they interpret the speaker's actual meaning as \"picture . . . are not flattering\" vs. \"pictures . . . are so gross\" (Table 1). The intensity of negative sentiment is higher in the latter interpretation than in the former. Kreuz (2000) noted that most studies in linguistics and psychology have conducted experiments analyzing reaction times (Gibbs, 1986;Katz et al., 2004) or situational context (Ivanko and Pexman, 2003), featuring a setup with in vitro data aimed at testing the validity of specific theories of irony. Instead, our study adopts a naturalistic approach to understand hearers' reception of irony looking at what linguistic strategies are recurrently used by hearers to interpret the non-literal meaning underlying ironic utterances.\nWe leverage the crowdsourcing task introduced by Ghosh et al. (2015) for their work on detecting whether a word has a literal or sarcastic in-terpretation, later adopted by Peled and Reichart (2017). The task is framed as follows: given a speaker's ironic message, five annotators (e.g., Turkers on Amazon Mechanical Turk (MTurk)) are asked to verbalize their interpretation of the speaker's ironic message (i.e., their understanding of the speaker's intended meaning) (see Table 1; S im denotes the speaker's ironic message, while H int denotes the hearer's interpretation of that ironic message). The crowdsourcing experiments are reported in Section 2.\nThe paper makes three contributions. First, we propose a data-driven typology of linguistic strategies that hearers use to interpret ironic messages and discuss its relevance in verifying theoretical frameworks of irony (Section 4). Second, we propose computational models to capture these strategies (Section 5). Third, we present two studies that aim to answer two questions: (1) does the type of semantic incongruity in the ironic message (explicit vs. implicit; see Section 3) influence the choice of interpretation strategies by the hearers? (Section 6.2); (2) do interpretation strategies of verbal irony vary by hearers? We make all datasets and code available. 1", "n_publication_ref": 21, "n_figure_ref": 0}, {"heading": "Datasets of Speakers' Ironic Messages and Hearers' Interpretations", "text": "To generate a parallel dataset of speakers' ironic messages and hearers' interpretations we conduct a crowdsourcing experiment. Given a speaker's ironic message (S im ), five Turkers (hearers) on MTurk are asked to verbalize their interpretation of the speaker's ironic message (i.e., their understanding of the speaker's intended meaning) (H int ). The design of the MTurk task was first introduced by Ghosh et al. (2015), who use the resulting dataset to identify words that can have both a literal and a sarcastic sense. Peled and Reichart (2017) employed similar design to generate a parallel dataset to use for generating interpretations of sarcastic messages using machine translation approaches. They use skilled annotators in comedy writing and literature paraphrasing and give them the option not to rephrase (we refer to Peled and Reichart (2017)'s dataset as SIGN ). We perform this new crowdsourcing task and do not rely entirely on the above two datasets for two reasons:\n(1) we focus on verbal irony, and (2) we always require an interpretation from the Turkers. Un-like the above two studies, the main goal of our research is to analyze the linguistics strategies employed by hearers in interpreting verbal irony.\nWe collected messages that express verbal irony from Twitter using the hashtags #irony, #sarcastic, and #sarcasm. We chose Twitter as a source since the presence of the hashtags allows us to select sentences where the speaker's intention was to be ironic. Furthermore, even though Twitter users cannot be considered representative of the entire population, they are unlikely to be skewed with respect to topics or gender. We manually checked and kept 1,000 tweets that express verbal irony. We do not draw any theoretical distinction between sarcasm and irony since we cannot assume that Twitter users also differentiate between #irony and #sarcasm, blurred even in scholarly literature. The Turkers were provided with detailed instructions and examples of the task including the standard definition of verbal irony taken from the Merriam-Webster dictionary (\"use of words to express something other than and especially the opposite of the literal meaning\"). We decided to suggest them a guiding definition for two reasons. First, hearers do not usually focus on literal vs. non literal meaning, as shown by studies measuring processing times for both types of statements (Inhoff et al., 1984). Therefore, when asked to rephrase the speakers' intended meaning, hearers would have probably come up with sentences expressing the speaker's imagined discursive goals, rather than disclosing their perceived literal meaning. Second, it is reasonable to assume that Turkers would have looked up the standard meaning of ironic utterance given by an online dictionary to ease up their task, possibly coming up with biased definitions.\nThe Turkers were instructed to consider the entire message in their verbalization to avoid asymmetry in length between the S im and H int . We obtained a dataset of 5,000 S im -H int pairs where five Turkers rephrase each S im . A total of 184 Turkers participated in the rephrasing task. Table 1 shows examples of speaker's ironic messages (S im ) and their corresponding hearers' interpretations (H i int ). Next, we ran a second MTurk task to verify whether the generated H int messages are plausible interpretations of the ironic messages. This time we employ three Turkers per task and only Turkers who were not involved in the content generation task were allowed to perform this  task. We observe that Turkers labeled 5% (i.e., 238 verbalizations) of H int s as invalid and low quality (e.g., wrong interpretation). For both tasks, we allowed only qualified Turkers (i.e., at least 95% approval rate and 5,000 approved HITs), paid 7 cents/task and gave sixty minutes to complete each task. The final dataset contains 4,762 pairs S im -H int .\nSim H 1 int H 2 int H 3 int 1.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Semantic Incongruity in Ironic", "text": "Messages: Explicit vs. Implicit Attardo (2000) and later Burgers (2010) distinguish between two theoretical aspects of irony: irony markers and irony factors. Irony markers are meta-communicative signals, such as interjections or emoticons that alert the reader that an utterance might be ironic. In contrast, irony factors cannot be removed without destroying the irony, such as the incongruity between the literal evaluation and its context (\"semantic incongruity\"). Incongruity expresses the contrast between the conveyed sentiment (usually, positive) and the targeted situation (usually, negative). This contrast can be explicitly or implicitly expressed in the ironic message. Following Karoui et al. (2017), we consider that semantic incongruity is explicit, when it is lexicalized in the utterance itself (e.g., both the positive sentiment word(s) and the negative situation are available to the reader explicitly). On Twitter, beside sentiment words, users often make use of hashtags (e.g., \"Studying 5 subjects . . . #worstsaturdaynight\") or an image (e.g., \"Encouraging how Police feel they're above the law. URL\"; the URL shows a police car not paying parking) to express their sentiment. We consider these cases as explicit, since the incongruity is present in the utterance even if via hashtags or other media. For implicit incongruity, we consider cases where one of the two incongruent terms (\"propositions\" in Karoui et al. (2017)) is not lexicalized and has to be reconstructed from the con-text (either outside word knowledge or a larger conversational context). For example \"You are such a nice friend!!!\", or \"Driving in Detroit is fun ;)\" are cases of ironic messages where the semantic incongruity is implicit. Based on these definitions of explicit and implicit incongruity, two expert annotators annotated the S im -H int dataset (1000 ironic messages) as containing explicit or implicit semantic incongruity. The inter-annotator agreement was =0.7, which denotes good agreement similar to Karoui et al. (2017). The annotation showed that 38.7% of the ironic messages are explicit, while 61.3% are implicit. In the following section we propose a typology of linguistic strategies used in hearers' interpretations of speakers' ironic messages and in section 6.2 we discuss the correlation of linguistic strategies with the type of semantic incongruity.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "Interpreting Verbal Irony: A Typology of Linguistic Strategies", "text": "Given the definition of verbal irony, we would expect that Turkers' interpretation of speaker's ironic message will contain some degree of opposite meaning with respect to what the speaker has said. However, it is unclear what linguistic strategies the Turkers will use to express that. To build our typology, from the total set of S im -H int pairs obtained through crowdsourcing (i.e., 4,762 pairs; see Section 2) we selected a dev set of 500 S im -H int pairs. Our approach does not assume any specific theory or irony, but it is data-driven: a linguist expert in semantics and pragmatics analyzed the dev set to formulate the lexical and pragmatic phenomena attested in the data. The assembled typology is, thus, the result of a bottom-up procedure. A S im -H int pair can be annotated with more than one strategy. The core linguistic strategies are explained below and synthesized in Table 2.  ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Linguistic Strategies", "text": "Lexical and phrasal antonyms: This category contains lexical antonyms (e.g., \"love\" $ \"hate\", \"great\" $ \"terrible\") as well as indirect antonyms (Fellbaum, 1998), where the opposite meaning can only be interpreted in context (e.g., \"passionate speaker\" ! \"boring speaker\"; Table 1). Although the typical antonym of \"passionate\" is \"unpassionate\", \"boring\" works in this context as a lexical opposite since a speaker who is passionate entails that he is not boring. Besides lexical antonyms, Turkers sometimes use antonym phrases (e.g., \"I can't wait\" ! \"not looking forward\", \"I like (to visit ER)\" ! \"I am upset (to visit ER) \").\nNegation: Here, Turkers negate the main predicate. This strategy is used in the presence of copulative constructions where the predicative expression is an adjective/noun expressing sentiment (e.g., \"is great\" ! \"is not great\") and of verbs expressing sentiment (e.g., \"love\" ! \"do not love\") or propositional attitudes (e.g., \"I wonder\" ! \"I don't wonder\").\nWeakening the intensity of sentiment: The use of negation and antonyms is sometimes accompanied by two strategies that reflect a weakening of sentiment intensity. First, when S im contains words expressing a high degree of positive sentiment, the hearer's interpretation replaces them with more neutral ones (e.g., \"I love it\" ! \"I don't like it\"). Second, when S im contains an intensifier, it is eliminated in the Turkers' interpretation.\nIntensifiers specify the degree of value/quality expressed by the words they modify (Méndez-Naya, 2008) (e.g., \"cake for breakfast. so healthy\" ! \"cake for breakfast. not healthy\").\nInterrogative to Declarative Transformation (+ Antonym/Negation): This strategy, used mostly in conjunction with the negation or antonym strategies, consists in replacing the interrogative form with a declarative form, when S im is a rhetorical question (for brevity, RQ) (e.g., \"don't you love fighting?\" ! \"I hate fighting\").", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Counterfactual Desiderative Constructions:", "text": "When the ironic utterance expresses a positive/negative sentiment towards a past event (e.g., \"glad you relayed this news\") or an expressive speech act (e.g., \"thanks X that picture needed more copy\") the hearer's interpretation of intended meaning is expressed through the counterfactual desiderative constructions I wish (that) p (\"I wish you hadn't relayed . . . \", \"I wish X didn't copy . . . \"). Differently from antonymic phrases, this strategy stresses on the failure of the speaker's expectation more than on their commitment to the opposite meaning.\nPragmatic Inference: In addition to the above strategies, there are cases where the interpretation calls for an inferential process to be recognized. For instance, \"made 174 this month . . . I'm gonna buy a yacht!\" ! \"made 174 this month . . . I am so poor\". The distribution of the strategies on the dev set is represented in Table 2.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Links to Theoretical Frameworks", "text": "In linguistic literature many different approaches to irony have been provided. Here we focus on the three accounts (w.r.t. examples from S im -H int corpus) that bear a different views on pragmatic factors. According to Grice (1975), ironic messages are uttered to convey a meaning opposite to that literally expressed, flouting the conversational maxim of quality \"do not say what you believe to be false\". In verbal irony, the violation of the maxim is frequently signaled by \"the opposite\" of what is said literally (e.g., intended meaning of \"carcasses are flattering\" is they are gross; Table 1). The linguistic strategies of antonyms (e.g. \"worst day of my life\") and simple negation (\"yeap we totally dont drink alcohol every single day\"[...]) cover the majority of the S im -H int corpus and seem to fit the Gricean (Grice, 1975) account of irony, since the hearer seems to have primarily recognized the presence of semantic incongruity. However, as touched upon by Giora (1995), antonyms and direct negation are not always semantically equivalent strategies, since the second sometimes allows a graded interpretation: if \"x is not encouraging\", it is not nec-essarily bad, but simply \"x < encouraging\". Such an implicature is available exclusively with items allowing mediated contraries, such as sentiment words (Horn, 1989). Direct negation with sentiment words implies that just one value in a set is negated, while the others are potentially affirmed.\nThe spectrum of interpretations allowed by negation as a rephrasing strategy indicates that hearers recognize that the relevance of the ironic utterance in itself plays a role next to what the utterances refers to (if the rephrased utterance is intended as \"x is not encouraging at all\", the perceived irrelevance of the corresponding ironic utterance is more prominent than in \"x is not very encouraging\"). The fact that the interpretation of irony has a propositional scope is even clearer when the ironic sentence in interrogative form (\"and they all lived happily ever after ?\") is rephrased as a declarative (e.g. \"I doubt they all lived happily ever after\"): the hearers recognizes that the question has a rhetoric value since otherwise contextually irrelevant. The intentional falsehood of Gricean analysis is also not deemed by Sperber and Wilson (1986); Wilson and Sperber (2012) as a necessary and sufficient condition for irony. According to their theory of echoic mentioning, irony presupposes the mention to the inappropriateness of the entire sentence: in asserting \"awesome weather in Scotland today\" the speaker does not simply want to express that the weather was horrible but he signals that assuming that the weather would be nice was irrelevant and, thus, ridiculous. Kreuz and Glucksberg (1989) expand the Relevance Theory approach talking about echoic reminding to account for cases such as \"could you be just a little louder, please? My baby isn't trying to sleep\" where the extreme politeness reminds the hearer that the question is indeed a request and that the mother bears a certain stance and has certain expectations towards the addressee. Similarly, the use of the pragmatic inference strategy cannot be fully explained in Gricean terms: the rephrase \"made 174 this month . . . I am so poor\" for \"made 174 this month . . . I am gonna buy a yatch\" more than pointing to the presence of lexical incongruity, show that the hearers knows for background knowledge that the assertion of \"buying a yatch\" is completely irrelevant in the context of a low salary situation. Rephrasing strategies using counterfactual desiderative constructions (e.g. \"I really wish my friends and fam-ily would check up on my after yesterday's near death experience\") show, instead, that the interpretation of irony involves an echoic reminding to the speaker's (social) expectations which failed to be fulfilled. Overall, using the results of our crowdsourcing experiment with main existing theories of irony, it turns out that the theories have a complementary explanatory power. In Section 6.2 we investigate weather this situation might relate to the presence of explicit/implicit irony.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Empirical Analysis of Interpretation Strategies", "text": "Here our goal is to perform a comparative empirical analysis to understand how hearers interpret verbal irony. To accomplish this, we propose computational models to automatically detect these linguistic strategies in two datasets: (1) S im -H int dataset and (2) the SIGN dataset. As stated in Section 2, albeit for a different purpose, the task designed in Peled and Reichart ( 2017) is identical to ours: they used a set of 3,000 sarcastic tweets and collected five interpretation verbalization, including an option to just copy the original message if it was not deemed ironic. They used workers skilled in comedy writing and literature paraphrasing. SIGN contains 14,970 pairs. To evaluate our models, we asked two annotators to annotate two test sets of 500 pairs each from the S im -H int and the SIGN dataset (i.e., denoted by SIGN test ), respectively. Note, the test set for the S im -H int has no overlap with the dev set of 500 S im -H int pairs used to identify the strategies (Section 4). Agreement between the annotators for both sets is high with  > 0.9. In SIGN test , 79 instances were just copies of the original message, which we eliminated, thus the SIGN test contains only 421 instances.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Computational Methods", "text": "Lexical Antonyms. To detect whether an S im -H int pair uses the lexical antonyms strategy, we first need to build a resource of lexical antonyms. We use the MPQA sentiment Lexicon (Wilson et al., 2005) , 2004). We consider a lexical antonym strategy if: 1) antonym words are aligned; 2) they are the roots of the respective dependency trees or if the nodes modified by the lexical antonyms are the same in their respective trees (e.g., 'can you show any more of steelers\" ! \"show less of steelers\", the candidate lexical antonyms are more and less and they are the objects of the same predicate in S im -H int : show). Out of 211 S im -H int pairs that are marked as having lexical antonym strategy (dev set), 12 instances are identified by only the dependency parses, 67 instances by the word-alignments, and 100 instances by both (P/R/F1 scores are 92.1%, 77.7% and 84.3%), respectively on dev dataset. However, sometimes both dependency and wordalignment methods fail. In \"circling down the bowl. Yay\" ! \"circling down the bowl. awful\", although the lexical antonyms yay and awful exist, neither the alignment nor the dependency trees can detect it (25 such instances in the dev set). To account for this, after having run the dependency and alignment methods, we also just search whether a S im -H int pair contains a lexical antonym pair. This improves the final recall and on the dev set we achieve 89.0% precision, 95.7% recall, and 92.2% F1 on dev dataset (Lex ant Strategy; Table 3 show results both on dev and the test sets). Note, just searching whether a lexical antonym pair is present in a S im -H int pair results in low precision (58.6%) but high recall (80%).\nSimple negation. This strategy (denoted as Simple neg in Table 3 and Table 4) involves identifying the presence of negation and its scope.\nHere, however, the scope of negation is con-strained since generally Turkers negated only a single word (i.e., \"love\" ! \"not love\"). Thus our problem is easier than the general problem of finding the scope of negation (Li and Lu, 2018;Qian et al., 2016;Fancellu et al., 2016). We use 30 negation markers from Reitan et al. (2015) to find negation scope in tweets. We first detect whether a negation marker appears in either H int or S im , but not in both (negation can appear in S im for ironic blame) If the marker is used, we extract its parent node from the dependency tree, and if this node is also present in the other utterance, then Negation strategy is selected. For instance, in \"looks just like me\" ! \"does not look like me\", the negation not is modifying the main predicate looks in H int , which is also the main predicate in S im (words are lemmatized). In the next section, we discuss if the parent nodes are not the same but similar and with different sentiment strength.\nWeakening the intensity of sentiment. The first strategy -replacing words expressing a high degree of positive/negative sentiment with more neutral ones ('I love being sick\" ! \"I don't like being sick)-, is applied only in conjunction with the negation strategy. We measure the difference in strength using the Dictionary of Affect (Whissell et al., 1986). Out of 31 S im -H int pairs in the dev set, we automatically identify 28 interpretations that use this approach. For the second strategy -removing the intensifier (I am really happy\" ! \"I am disappointed') -, we first determine whether the intensifier exists in S im and is eliminated from H int . We use only adjective and adverb intensifiers from Taboada et al. (2011), primarily to discard conjunctions such as \"so\" (\"no water so I can't wash . . . \"). This strategy is used together with both lexical antonyms and Simple negation strategies. For a candidate S im -H int pair, if the lexical antonym strategy is selected and a S and a H are the lexical antonyms, we determine whether any intensifier modifies a S and no intensifier modifies a H . If the Negation strategy is se-lected, we identify the negated term in the H int and then search its aligned node from the S im using the word-word alignment. Next, we search in the S im if any intensifier is intensifying the aligned term. The strategies are denoted as AN weaksent in Table 3 and Table 4.\nInterrogative to Declarative Transformation (+ Antonym/Neg). To capture this strategy we need to determine first if the verbal irony was expressed as a rhetorical question. To build a classifier to detect RQ, we collect two categories of tweets (4K each) (1) tweets labeled with #sarcasm or #irony that also contain \"?\", and (2) information seeking tweets containing \"?\". We train a binary classifier using SVM RBF Kernel with default parameters. The features are Twitter-trained word embeddings (Ghosh et al., 2015), modal verbs, pronouns, interrogative words, negations, and position of \"?\" in a tweet. We evaluate the training model on the dev data and the P/R/F1 are 53.2%, 65.4%, and 58.6%, respectively (in future work we plan to develop more accurate models for RQ detection). Once we detect the ironic message was expressed as a RQ, we identify the specific interpretation strategy accompanying the transformation from interrogative to declarative form: antonym or negation. These combined strategies are denoted as AN I!D in Table 3 and Table 4.\nDesiderative Constructions: Currently, we use a simple regular expression \"I [w]⇤ wish\" to capture counterfactual cases (AN desiderative in Tables 3 and Table 4). Note, when the Simple negation and lexical antonyms strategies are combined with other strategy (e.g., removing of intensifier), we consider this combined strategy for the interpretation of verbal irony and not the simple negation or lexical antonym strategy (i.e., we do not double count).", "n_publication_ref": 9, "n_figure_ref": 0}, {"heading": "Phrasal antonyms and pragmatic inference:", "text": "Identifying phrasal antonyms and pragmatic inference is a complex task, and thus we propose a method of phrase matching based on phrase extraction via unsupervised alignment technique in SMT. We use IBM Model 4 with HMM (Giza++; (Och and Ney, 2000)), phrase extraction via Moses (Koehn et al., 2007) and the IRST tool to build the required language models. As postprocessing, we first remove phrase pairs obtained from the S im -H int bitext that are also present in the set of extracted phrases from the H int -H int  bitext. This increases the likelihood of retaining semantically opposite phrases, since phrases extracted from the H int -H int bitext are more likely to be paraphrastic. Second, based on the translation probability scores , for phrase e if we have a set of aligned phrases f set we reject phrases that have scores less than 1 size(fset) . Finally, 11,200 phrases are extracted from the S im -H int bitext. The low recall for this strategy is expected since there are too many ways that users can employ pragmatic inference or rephrase the utterance without directly using any antonym or negation. In future, we will explore neural MT (Cho et al., 2014) and use external data to generate more phrases. Since we have not manually evaluated these phrase pairs, we only use this strategy after we have tried all the remaining strategies (AntPhrase+PragInf in Table 3 and Table 4).", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Results and Distribution of Linguistic Strategies", "text": "The performance of the models is similar on both test and SIGN test sets, showing consistently good performance (Table 3; 90% F1 for all strategies, except the AntPhrase+PragInf and AN I!D ). Given these results, we can now apply these models to study the distribution of these strategies in the entire datasets (Table 4). The strategy distribution between our dataset S im -H int and SIGN dataset is similar and matches the distribution on the manual annotations on the dev dataset in Table 2. The sum of the strategies can exceed the total number of the pairs since a tweet can contain several ironic sentences that are interpreted by Turkers. For instance, in \"Dave too nice . . . a nice fella\" ! \"Dave not nice . . . a mean fella\" we observe the application of two strategies, lexical antonyms (e.g., nice ! mean) and negation (e.g., nice ! not nice).", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Hearer-dependent Interpretation Strategies", "text": "We investigate how hearers adopt strategies for interpreting the speaker's ironic intent. To implement this study, we selected three Turkers (e.g., H 1 , H 2 , and H 3 ; In Table 1, H i int are generated by the correspondent Turker H i ), from our crowdsourced data, who were able to rephrase at least five hundred identical S im messages. Note, we cannot carry this experiment on the SIGN dataset (Peled and Reichart, 2017) because the annotators' information is absent there.\nAlthough the three Turkers choose lexical antonym and simple negation as two top choices, there is some variation among them. H 1 and H 2 choose antonyms more frequently than negation while in contrary Turker H 3 choose negation more than antonyms, sometime combined with the weakening of sentiment strategy. As we mentioned in Section 4.2, antonyms and direct negation are not semantically equivalent strategies since the latter, allows a graded interpretation: if \"x is not inspiring\", it is not necessarily bad, but simply \"x < inspiring\" (Giora, 1995). In Table 1, the S im -H int pair \"passionate\" ! \"boring\" and \"flattering\" ! \"gross\" (interpretation of H 1 ) have more contrast than the pair \"passionate\" ! \"not passionate\" and \"so flattering\" ! \"not flattering\" (interpretation of H 3 ). This suggests that H 1 perceive the intensity of negative sentiment towards the target of irony (\"Ed Davey\" and \"picture of dead animals\", respectively) higher than Turker H 3 . All three Turkers have chosen the remaining strategies with similar frequencies.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Message-dependent Interpretation Strategies", "text": "Interpretation Strategies and the Type of Semantic Incongruity: We investigate whether the type of semantic incongruity in the ironic message (explicit vs. implicit; see Section 3) influences the choice of interpretation strategies by the hearers. To do this, we looked at S im -level distribution of interpretation strategies used by the hearers for the same ironic message S im .   as interpretation strategy more when the semantic incongruity is explicit than implicit (48.5% vs. 34.8%): the presence of explicit sentiment triggered the use of the antonym strategy. In contrary they use simple negation more when the semantic incongruity is implicit than explicit.\nWe also analyze the interpretation strategies w.r.t. to the presence (+) or absence ( ) of irony markers. We implement various morpho-syntactic as well as typographic markers (similar to ) to identify the presence of markers. We observe that Lex ant strategy is used more in cases where the markers are absent. In S im -H int , markers are present twice as much in the case of implicit (21%) than explicit incongruity (10%). This finding validates (Burgers et al., 2012) who argued speakers will likely use markers to signal their ironic intent in implicit incongruity.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Message interpreted the same by all hearers:", "text": "In Figure 1, the vertical columns (purple: S im -H int and grey: SIGN ) depict the distribution (in %) of tweets strategy-wise. In S im -H int dataset, for 17% of messages (124 S im s) all five Turkers use the same strategy to interpret the S im s (labeled as 5 on the X-axis), whereas for 26% (188 S im s), 4 Turkers used same strategy (labeled as 4,1 on Xaxis) and so on.\nWe observe when the S im s are marked by strong subjective words e.g., \"great\", \"best\", etc., they have been replaced in 90% of cases as lexical antonyms (e.g., \"great\" ! \"terrible\"). In addition, the majority of adjectives are used in attributive position (i.e., \"lovely neighbor is vacuuming at night\"), thus blocking paraphrases involving predicate negation. However, not all strong subjective words guarantee the use of direct opposites in the H int s (e.g., \"flattering\" ! \"not flattering\"; See Table 1). The choice of strategies may also depend upon the target of ironic situation (Ivanko and Pexman, 2003). We implement the bootstrapping algorithm from Riloff et al. (2013) to identify ironic situations in S im s that are rephrased by Lexical antonym strategy. We find utterances containing stereotypical negative situations regarding health issues (e.g., \"having migraines\", \"getting killed by chemicals\") and other undesirable negative states such as \"oversleeping\", \"luggage lost\", \"stress in life\" are almost always interpreted via lexical antonym strategy.\nUtterances where all five Turkers used simple negation, if negative particles are positioned in the ironic message with a sentential scope (e.g., \"not a biggie\", \"not awkward\") then they are simply omitted in the interpretations. This trend can be explained according to the inter-subjective account of negation types (Verhagen, 2005). Sentential negation leads the addressee to open up an alternative mental space where an opposite predication is at stake.", "n_publication_ref": 3, "n_figure_ref": 1}, {"heading": "Related Work", "text": "Most NLP research on verbal irony or sarcasm has focused on the task of sarcasm detection treating it as a binary classification task using either the utterance in isolation or adding contextual information such as conversation context, author context, visual context, or cognitive features (González-Ibáñez et al., 2011;Liebrecht et al., 2013;Wallace et al., 2014;Zhang et al., 2016;Ghosh and Veale, 2016;Schifanella et al., 2016;Xiong et al., 2019;Castro et al., 2019). Unlike this line of work, our research focuses on how the hearer interprets an ironic message. The findings from our study could have multiple impacts on the sarcasm detection task. First, interpretation strategies open up a scope of \"graded interpretation\" of irony instead of only a binary decision (i.e., predicting the strength of irony). Second, nature of semantic incongruence and stereotype irony situations can be useful features in irony detection.\nRecently, Peled and Reichart (2017) proposed a computational model based on SMT to generate interpretations of sarcastic messages. We aim to deepen our understanding of such interpretations by introducing a typology of linguistic strategies. We study the distribution of these strategies via both hearer-dependent and messagedependent interpretations. Psycholinguistics studies that have dealt with the hearers' perception, have mainly focused on how ironic messages are processed: through the analysis of reaction times (Gibbs, 1986;Katz et al., 2004), the role of situational context (Ivanko and Pexman, 2003) and in tackling speaker-hearer social relations by annotating ironic texts from different genres (Burgers, 2010). However, no attention has been paid to correlations between how ironic message is expressed and how it is interpreted by the hearer, including what linguistic strategies the hearers employ.", "n_publication_ref": 13, "n_figure_ref": 0}, {"heading": "Conclusions", "text": "We leveraged a crowdsourcing task to obtain a dataset of ironic utterances paired with the hearer's verbalization of their interpretation. We proposed a typology of linguistic strategies for verbal irony interpretation and designed computational models to capture these strategies with good performance. Our study shows (1) Turkers mostly adopt lexical antonym and negation strategies to interpret speaker's irony, (2) interpretations are correlated to stereotype ironic situations, and (3) irony expression (explicit vs. implicit incongruity and absence or presence of markers) influences the choice of interpretation strategies and match with different explanatory theories (the Gricean approach links up better with explicit incongruity, while Relevance Theory with the implicit one). The latter can have an impact on irony detection by bringing out more discriminative semantic and pragmatic features.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Acknowledgements", "text": "We thank Rituparna Mukherjee, Daniel Chaparro, Pedro Pérez Sánchez, and Renato Augusto Vieira Nishimori who helped us in annotating as well as in running experiments. This paper partially based on the work supported by the DARPA-DEFT program. The views expressed are those of the authors and do not reflect the official policy or position of the Department of Defense or the U.S. Government.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Modelling context with user embeddings for sarcasm detection in social media", "journal": "", "year": "2016", "authors": "Silvio Amir; C Byron; Hao Wallace; Paula Carvalho Mário J Lyu;  Silva"}, {"title": "Irony markers and functions: Towards a goal-oriented theory of irony and its processing", "journal": "Rask", "year": "2000", "authors": "Salvatore Attardo"}, {"title": "Contextualized sarcasm detection on twitter", "journal": "", "year": "2015", "authors": "David Bamman; A Noah;  Smith"}, {"title": "Verbal irony differences in usage across written genres", "journal": "Journal of Language and Social Psychology", "year": "2012", "authors": "Christian Burgers; Margot Van Mulken; Peter Schellens"}, {"title": "Verbal irony: Use and effects in written discourse", "journal": "", "year": "2010", "authors": "Frederik Christian;  Burgers"}, {"title": "Towards multimodal sarcasm detection (an obviously perfect paper)", "journal": "", "year": "2019", "authors": "Santiago Castro; Devamanyu Hazarika; Verónica Pérez-Rosas; Roger Zimmermann"}, {"title": "Verbocean: Mining the web for fine-grained semantic verb relations", "journal": "", "year": "2004", "authors": "Timothy Chklovski; Patrick Pantel"}, {"title": "Learning phrase representations using rnn encoder-decoder for statistical machine translation", "journal": "", "year": "2014", "authors": "Kyunghyun Cho; Bart Van Merriënboer; Caglar Gulcehre; Dzmitry Bahdanau; Fethi Bougares; Holger Schwenk; Yoshua Bengio"}, {"title": "Semi-supervised recognition of sarcastic sentences in twitter and amazon", "journal": "", "year": "2010", "authors": "Dmitry Davidov; Oren Tsur; Ari Rappoport"}, {"title": "Finding contradictions in text", "journal": "", "year": "2008", "authors": "Marie-Catherine De Marneffe; Anna N Rafferty; Christopher D Manning"}, {"title": "Neural networks for negation scope detection", "journal": "", "year": "2016", "authors": "Federico Fancellu; Adam Lopez; Bonnie Webber"}, {"title": "Using millions of emoji occurrences to learn any-domain representations for detecting sentiment, emotion and sarcasm", "journal": "", "year": "2017", "authors": "Bjarke Felbo; Alan Mislove; Anders Søgaard; Iyad Rahwan; Sune Lehmann"}, {"title": "", "journal": "Wiley Online Library", "year": "1998", "authors": "Christiane Fellbaum"}, {"title": "Fracking sarcasm using neural network", "journal": "", "year": "2016", "authors": "Aniruddha Ghosh; Tony Veale"}, {"title": "Magnets for sarcasm: Making sarcasm detection timely, contextual and very personal", "journal": "", "year": "2017", "authors": "Aniruddha Ghosh; Tony Veale"}, {"title": "Sarcasm analysis using conversation context", "journal": "Computational Linguistics", "year": "2018", "authors": "Debanjan Ghosh; Alexander R Fabbri; Smaranda Muresan"}, {"title": "Sarcastic or not: Word embeddings to predict the literal or sarcastic meaning of words", "journal": "", "year": "2015", "authors": "Debanjan Ghosh; Weiwei Guo; Smaranda Muresan"}, {"title": "with 1 follower i must be awesome: P.\" exploring the role of irony markers in irony recognition", "journal": "", "year": "2018", "authors": "Debanjan Ghosh; Smaranda Muresan"}, {"title": "The role of conversation context for sarcasm detection in online interactions", "journal": "", "year": "2017", "authors": "Debanjan Ghosh; Alexander Richard Fabbri; Smaranda Muresan"}, {"title": "On the psycholinguistics of sarcasm", "journal": "Journal of Experimental Psychology: General", "year": "1986", "authors": "W Raymond;  Gibbs"}, {"title": "On irony and negation", "journal": "Discourse processes", "year": "1995", "authors": "Rachel Giora"}, {"title": "Identifying sarcasm in twitter: A closer look", "journal": "", "year": "2011", "authors": "Roberto González-Ibáñez; Smaranda Muresan; Nina Wacholder"}, {"title": "logic and conversation", "journal": "", "year": "1975", "authors": " H Paul Grice"}, {"title": "A speech act analysis of irony", "journal": "Journal of Pragmatics", "year": "1990", "authors": "Henk Haverkate"}, {"title": "Cascade: Contextual sarcasm detection in online discussion forums", "journal": "", "year": "2018", "authors": "Devamanyu Hazarika; Soujanya Poria; Sruthi Gorantla; Erik Cambria; Roger Zimmermann; Rada Mihalcea"}, {"title": "A natural history of negation", "journal": "The University of Chicago Press", "year": "1989", "authors": "Laurence Horn"}, {"title": "Mining and summarizing customer reviews", "journal": "ACM", "year": "2004", "authors": "Minqing Hu; Bing Liu"}, {"title": "Contextual effects on metaphor comprehension in reading", "journal": "Memory & Cognition", "year": "1984", "authors": "Albrecht Werner Inhoff; Susan D Lima; Patrick J Carroll"}, {"title": "Context incongruity and irony processing", "journal": "Discourse Processes", "year": "2003", "authors": "L Stacey;  Ivanko;  Penny M Pexman"}, {"title": "Harnessing context incongruity for sarcasm detection", "journal": "", "year": "2015", "authors": "Aditya Joshi; Vinita Sharma; Pushpak Bhattacharyya"}, {"title": "Exploring the impact of pragmatic phenomena on irony detection in tweets: A multilingual corpus study", "journal": "ACL", "year": "2017", "authors": "Jihen Karoui; Farah Benamara; Véronique Moriceau; Viviana Patti; Cristina Bosco; Nathalie Aussenac-Gilles"}, {"title": "Saying what you don't mean: Social influences on sarcastic language processing", "journal": "Current Directions in Psychological Science", "year": "2004", "authors": "N Albert; Dawn G Katz; Victoria A Blasko;  Kazmerski"}, {"title": "Moses: Open source toolkit for statistical machine translation", "journal": "", "year": "2007", "authors": "Philipp Koehn; Hieu Hoang; Alexandra Birch; Chris Callison-Burch; Marcello Federico; Nicola Bertoldi; Brooke Cowan; Wade Shen; Christine Moran; Richard Zens"}, {"title": "The production and processing of verbal irony", "journal": "Metaphor and Symbol", "year": "2000", "authors": "J Roger;  Kreuz"}, {"title": "How to be sarcastic: The echoic reminder theory of verbal irony", "journal": "Journal of experimental psychology: General", "year": "1989", "authors": "J Roger; Sam Kreuz;  Glucksberg"}, {"title": "Learning with structured representations for negation scope extraction", "journal": "Short Papers", "year": "2018", "authors": "Hao Li; Wei Lu"}, {"title": "The perfect solution for detecting sarcasm in tweets# not", "journal": "", "year": "2013", "authors": " Cc Liebrecht; Apj Fa Kunneman;  Van Den;  Bosch"}, {"title": "Who cares about sarcastic tweets? investigating the impact of sarcasm on sentiment analysis", "journal": "", "year": "2014", "authors": "Diana Maynard; A Mark;  Greenwood"}, {"title": "", "journal": "Special issue on english intensifiers. English Language and Linguistics", "year": "2008", "authors": "Belén Méndez-Naya"}, {"title": "Harnessing cognitive features for sarcasm detection", "journal": "Association for Computational Linguistics", "year": "2016", "authors": "Abhijit Mishra; Diptesh Kanojia; Seema Nagar; Kuntal Dey; Pushpak Bhattacharyya"}, {"title": "", "journal": "Computing lexical contrast. Computational Linguistics", "year": "2013", "authors": "M Saif; Bonnie J Mohammad; Graeme Dorr; Peter D Hirst;  Turney"}, {"title": "Identification of nonliteral language in social media: A case study on sarcasm", "journal": "Journal of the Association for Information Science and Technology", "year": "2016", "authors": "Smaranda Muresan; Roberto Gonzalez-Ibanez; Debanjan Ghosh; Nina Wacholder"}, {"title": "Giza++: Training of statistical translation models", "journal": "", "year": "2000", "authors": "Josef Franz; Hermann Och;  Ney"}, {"title": "The alignment template approach to statistical machine translation", "journal": "Computational linguistics", "year": "2004", "authors": "Josef Franz; Hermann Och;  Ney"}, {"title": "Exploring author context for detecting intended vs perceived sarcasm", "journal": "", "year": "2019", "authors": "Silviu Oprea; Walid Magdy"}, {"title": "Sarcasm sign: Interpreting sarcasm with sentiment based monolingual machine translation", "journal": "", "year": "2017", "authors": "Lotem Peled; Roi Reichart"}, {"title": "Speculation and negation scope detection via convolutional neural networks", "journal": "", "year": "2016", "authors": "Peifeng Zhong Qian; Qiaoming Li; Guodong Zhu; Zhunchen Zhou; Wei Luo;  Luo"}, {"title": "Negation scope detection for twitter sentiment analysis", "journal": "", "year": "2015", "authors": "Johan Reitan; Jørgen Faret; Björn Gambäck; Lars Bungum"}, {"title": "Sarcasm as contrast between a positive sentiment and negative situation", "journal": "Association for Computational Linguistics", "year": "2013", "authors": "Ellen Riloff; Ashequl Qadir; Prafulla Surve; Lalindra De Silva; Nathan Gilbert; Ruihong Huang"}, {"title": "Detecting sarcasm in multimodal social platforms", "journal": "ACM", "year": "2016", "authors": "Rossano Schifanella; Paloma De Juan; Joel Tetreault; Liangliang Cao"}, {"title": "Relevance: Communication and cognition", "journal": "Harvard University Press", "year": "1986", "authors": "Dan Sperber; Deirdre Wilson"}, {"title": "Lexicon-based methods for sentiment analysis", "journal": "Computational linguistics", "year": "2011", "authors": "Maite Taboada; Julian Brooke; Milan Tofiloski; Kimberly Voll; Manfred Stede"}, {"title": "Reasoning with sarcasm by reading inbetween", "journal": "", "year": "2018", "authors": "Yi Tay; Anh Tuan Luu; Siu Cheung Hui; Jian Su"}, {"title": "Constructions of intersubjectivity: Discourse, syntax, and cognition", "journal": "Oxford University Press on Demand", "year": "2005", "authors": "Arie Verhagen"}, {"title": "Humans require context to infer ironic intent (so computers probably do, too)", "journal": "", "year": "2014", "authors": "C Byron; Do Wallace; Laura Kook Choe; Eugene Kertz;  Charniak"}, {"title": "A dictionary of affect in language: Iv. reliability, validity, and applications", "journal": "Perceptual and Motor Skills", "year": "1986", "authors": "Cynthia Whissell; Michael Fournier; Rene Pelland; Deborah Weir; Katherine Makarec"}, {"title": "Explaining irony. Meaning and relevance pages", "journal": "", "year": "2012", "authors": "Deirdre Wilson; Dan Sperber"}, {"title": "Recognizing contextual polarity in phraselevel sentiment analysis", "journal": "", "year": "2005", "authors": "Theresa Wilson; Janyce Wiebe; Paul Hoffmann"}, {"title": "Sarcasm detection with self-matching networks and low-rank bilinear pooling", "journal": "ACM", "year": "2019", "authors": "Tao Xiong; Peiran Zhang; Hongbo Zhu; Yihui Yang"}, {"title": "Tweet sarcasm detection using deep neural network", "journal": "", "year": "2016", "authors": "Meishan Zhang; Yue Zhang; Guohong Fu"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Strategies selected per message (in %)", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "", "figure_data": ": Examples of speaker's ironic messages (Sim) and interpretations given by 3 Turkers (H i int )."}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Typology of linguistic strategies and their distribution (in %) over the dev set", "figure_data": ""}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Evaluation of Computational Methods on dev, test and SIGN test set (in %)", "figure_data": "uses the lexical antonyms strategy. We use aheuristic approach based on word-alignment anddependency parsing (similar to contradiction de-tection (De Marneffe et al., 2008)). Word-to-wordalignments between S im -H int are extracted usinga statistical machine translation (SMT) alignmentmethod -IBM Model 4 with HMM alignmentfrom Giza++ (Och and Ney"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "", "figure_data": ": Distribution of interpretation strategies ontwo datasets (in %)"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "", "figure_data": "rep-"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_9", "figure_caption": "Rephrasing Strategies against Incongruency and Irony Markers on S im -H int dataset (in %)", "figure_data": ""}], "doi": "10.18653/v1/D17-1169"}