{"authors": "Anna Nils; Stefania Degaetano-Ortlieb; Beatrice Alex; Paul Buitelaar; Anna Feldman; Dimitrios Kokkinakis; Stasinos Konstantopoulos; John Lee; Janis Pagel; Petr Plecháč; Pablo Ruiz Fabo; Pia Sommerauer; Laure Thompson; Heike Zinsmeister; Sara Tonelli; Bruno Kessler; Italy Vi", "pub_date": "", "title": "", "abstract": "Another virtual workshop. . . Oh well: maybe next year we will go back to the (new) normal. Looking at submission numbers, this year's edition of the workshop was a huge success. We have received really unusually many submissions (thanks, everyone!). Out of those, we have accepted 22 papers for a 38 % acceptance rate. A round of applause for our wonderful program committee! The workshop programme consists of brief eight-minute Q&A sessions for ten oral presentations (which you will have watched by then!), and a twelve-poster session during which you will be able to chat with any author you like. Thematically, the papers cover the entire range of \"Cultural Heritage, Social Sciences, Humanities and Literature\". The programme shows that this area of applied language technology is mature and active. Last but not least, Sara Tonelli will give a live invited talk. We are grateful, and we look forward to it.", "sections": [{"heading": "Invited Talk", "text": "Dissecting offensive language detection: does it work, and what can we do with it? Social media messages are often written to attack specific groups of users based on their religion, ethnicity or social status, and they can be particularly threatening to vulnerable users such as teenagers. It is therefore very important to develop reliable, unbiased and robust detection systems to support stakeholders in fighting online hatred. Although state-of-the-art systems yield very good classification results, the problem is far from being solved. In my talk, I will discuss which issues still affect the development of abusive language detection systems, for example the problem of dealing with annotators' disagreement in the creation of training data, and the issues related to contextual information in threads. On the other hand, I will show how the output of offensive language detection systems can be integrated with network-based information to study the behavioral patterns of different types of users, also in relation to misinformation.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "About the speaker", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Sara Tonelli Digital Humanties Fondazione Bruno Kessler Trento, Italy", "text": "Sara Tonelli holds a PhD in Language Sciences from Università Ca' Foscari, Venice. Since 2013 she has been the head of the Digital Humanities research group at Fondazione Bruno Kessler in Trento, Italy. Among many projects in digital humanities, she is currently involved in the H2020 ODEUROPA project (focusing on olfactory information extraction), and in the H2020 PERCEPTIONS project (online perception and migration narratives related to EU). Since January 2021 she is also the scientific coordinator of the KID ACTIONS European project (addressing cyberbullying among children and adolescents). Sara's main research interests are related to temporal and event-based processing of texts, especially in the historical domain, and social media processing, including the detection of abusive language. ", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [], "figures": [{"figure_label": "of", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "The Early Modern Dutch Mediascape. Detecting Media Mentions in Chronicles Using Word Embeddings and CRF Alie Lassche and Roser Morante . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1", "figure_data": ""}], "doi": ""}