{"authors": "Tara Safavi; Danai Koutra", "pub_date": "", "title": "CODEX: A Comprehensive Knowledge Graph Completion Benchmark", "abstract": "We present CODEX, a set of knowledge graph COmpletion Datasets EXtracted from Wikidata and Wikipedia that improve upon existing knowledge graph completion benchmarks in scope and level of difficulty. In terms of scope, CODEX comprises three knowledge graphs varying in size and structure, multilingual descriptions of entities and relations, and tens of thousands of hard negative triples that are plausible but verified to be false. To characterize CODEX, we contribute thorough empirical analyses and benchmarking experiments. First, we analyze each CODEX dataset in terms of logical relation patterns. Next, we report baseline link prediction and triple classification results on CODEX for five extensively tuned embedding models. Finally, we differentiate CODEX from the popular FB15K-237 knowledge graph completion dataset by showing that CODEX covers more diverse and interpretable content, and is a more difficult link prediction benchmark. Data, code, and pretrained models are available at https://bit.ly/2EPbrJs.", "sections": [{"heading": "Introduction", "text": "Knowledge graphs are multi-relational graphs that express facts about the world by connecting entities (people, places, things, concepts) via different types of relationships. The field of automatic knowledge graph completion (KGC), which is motivated by the fact that knowledge graphs are usually incomplete, is an active research direction spanning several subfields of artificial intelligence (Nickel et al., 2015;Ji et al., 2020).\nAs progress in artificial intelligence depends heavily on data, a relevant and high-quality benchmark is imperative to evaluating and advancing the state of the art in KGC. However, the field has largely remained static in this regard over the past decade. Outdated subsets of Freebase (Bollacker et al., 2008) are most commonly used for evaluation in KGC, even though Freebase had known quality issues (Tanon et al., 2016) and was eventually deprecated in favor of the more recent Wikidata knowledge base (Vrandečić and Krötzsch, 2014).\nIndeed, KGC benchmarks extracted from Freebase like FB15K and FB15K-237 (Bordes et al., 2013; are questionable in quality. For example, FB15K was shown to have train/test leakage . Later in this paper ( § 6.2), we will show that a relatively large proportion of relations in FB15K-237 can be covered by a trivial frequency rule.\nTo address the need for a solid benchmark in KGC, we present CODEX, a set of knowledge graph COmpletion Datasets EXtracted from Wikidata and its sister project Wikipedia. Inasmuch as Wikidata is considered the successor of Freebase, CODEX improves upon existing Freebase-based KGC benchmarks in terms of scope and level of difficulty (Table 1). Our contributions include:\nFoundations We survey evaluation datasets in encyclopedic knowledge graph completion to motivate a new benchmark ( § 2 and Appendix A).\nData We introduce CODEX, a benchmark consisting of three knowledge graphs varying in size and structure, entity types, multilingual labels and descriptions, and-unique to CODEX-manually verified hard negative triples ( § 3). To better understand CODEX, we analyze the logical relation patterns in each of its datasets ( § 4).\nBenchmarking We conduct large-scale model selection and benchmarking experiments, reporting baseline link prediction and triple classification results on CODEX for five widely used embedding models from different architectural classes ( § 5).\nComparative analysis Finally, to demonstrate the unique value of CODEX, we differentiate Multi-domain, with a strong focus on awards, entertainment, and sports ( § 6.1 and Appendix E) Multi-domain, with focuses on writing, entertainment, music, politics, journalism, academics, and science ( § 6.1 and Appendix E) Scope (auxiliary data) Various decentralized versions of FB15K with, e.g., entity types (Xie et al., 2016), sampled negatives (Socher et al., 2013), and more (Table 8)\nCentralized repository of three datasets with entity types, multilingual text, and manually annotated hard negatives ( § 3)\nLevel of difficulty FB15K has severe train/test leakage from inverse relations ; while removal of inverse relations makes FB15K-237 harder than FB15K, FB15K-237 still has a high proportion of easy-to-predict relational patterns ( § 6.2)\nInverse relations removed from all datasets to avoid train/test leakage ( § 3.2); manually annotated hard negatives for the task of triple classification ( § 3.4); few trivial patterns for the task of link prediction ( § 6.2)\nCODEX from FB15K-237 in terms of both content and difficulty ( § 6). We show that CODEX covers more diverse and interpretable content, and is a more challenging link prediction benchmark.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Existing datasets", "text": "We begin by surveying existing KGC benchmarks. Table 8 in Appendix A provides an overview of evaluation datasets and tasks on a per-paper basis across the artificial intelligence, machine learning, and natural language processing communities.\nNote that we focus on data rather than models, so we only overview relevant evaluation benchmarks here. For more on existing KGC models, both neural and symbolic, we refer the reader to (Meilicke et al., 2018) and (Ji et al., 2020).", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Freebase extracts", "text": "These datasets, extracted from the Freebase knowledge graph (Bollacker et al., 2008), are the most popular for KGC (see Table 8 in Appendix A). Bordes et al. (2013). It contains 14,951 entities, 1,345 relations, and 592,213 triples covering several domains, with a strong focus on awards, entertainment, and sports.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "FB15K was introduced by", "text": "FB15K-237 was introduced by  to remedy data leakage in FB15K, which contains many test triples that invert triples in the training set. FB15K-237 contains 14,541 entities, 237 relations, and 310,116 triples. We compare FB15K-237 to CODEX in § 6 to assess each dataset's content and relative difficulty.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Other encyclopedic datasets", "text": "NELL-995 (Xiong et al., 2017) was taken from the Never Ending Language Learner (NELL) sys-tem (Mitchell et al., 2018), which continuously reads the web to obtain and update its knowledge. NELL-995, a subset of the 995th iteration of NELL, contains 75,492 entities, 200 relations, and 154,213 triples. While NELL-995 is general and covers many domains, its mean average precision was less than 50% around its 1000th iteration (Mitchell et al., 2018). A cursory inspection reveals that many of the triples in NELL-995 are nonsensical or overly generic, suggesting that NELL-995 is not a meaningful dataset for KGC evaluation. 1 YAGO3-10 (Dettmers et al., 2018) is a subset of YAGO3 (Mahdisoltani et al., 2014), which covers portions of Wikipedia, Wikidata, and Word-Net. YAGO3-10 has 123,182 entities, 37 relations, and 1,089,040 triples mostly limited to facts about people and locations. While YAGO3-10 is a highprecision dataset, it was recently shown to be too easy for link prediction because it contains a large proportion of duplicate relations (Akrami et al., 2020;Pezeshkpour et al., 2020).", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Domain-specific datasets", "text": "In addition to large encyclopedic knowledge graphs, it is common to evaluate KGC methods on at least one smaller, domain-specific dataset, typically drawn from the WordNet semantic network (Miller, 1998;Bordes et al., 2013). Other choices include the Unified Medical Language System (UMLS) database (McCray, 2003), the Alyawarra kinship dataset (Kemp et al., 2006), the Countries dataset (Bouchard et al., 2015), and variants of a synthetic \"family tree\" (Hinton, 1986). As our focus in this paper is encyclopedic knowledge, we do not cover these datasets further.  ( § 3.4). We compute multilingual coverage over all labels, descriptions, and entity Wikipedia extracts successfully retrieved for the respective dataset in Arabic (ar), German (de), English (en), Spanish (es), Russian (ru), and Chinese (zh). ", "n_publication_ref": 7, "n_figure_ref": 0}, {"heading": "Data collection", "text": "In this section we describe the pipeline used to construct CODEX. For reference, we define a knowledge graph G as a multi-relational graph consisting of a set of entities E, relations R, and factual statements in the form of (head, relation, tail) triples (h, r, t) ∈ E × R × E.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Seeding the collection", "text": "We collected an initial set of triples using a type of snowball sampling (Goodman, 1961). We first manually defined a broad seed set of entity and relation types common to 13 domains: Business, geography, literature, media and entertainment, medicine, music, news, politics, religion, science, sports, travel, and visual art. Examples of seed entity types include airline, journalist, and religious text; corresponding seed relation types in each respective domain include airline alliance, notable works, and language of work or name. Table 9 in Appendix B gives all seed entity and relation types.\nUsing these seeds, we retrieved an initial set of 380,038 entities, 75 relations, and 1,156,222 triples by querying Wikidata for statements of the form (head entity of seed type, seed relation type, ?).", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Filtering the collection", "text": "To create smaller data snapshots, we filtered the initial 1.15 million triples to k-cores, which are maximal subgraphs G of a given graph G such that every node in G has a degree of at least k (Batagelj and Zaveršnik, 2011). 2 We constructed three CODEX datasets (Table 2):\n• CODEX-S (k = 15), which has 36k triples.\nBecause of its smaller size, we recommend that CODEX-S be used for model testing and debugging, as well as evaluation of methods that are less computationally efficient (e.g., symbolic search-based approaches).\n• CODEX-M (k = 10), which has 206k triples. CODEX-M is all-purpose, being comparable in size to FB15K-237 ( § 2.1), one of the most popular benchmarks for KGC evaluation.\n• CODEX-L (k = 5), which has 612k triples. CODEX-L is comparable in size to FB15K ( § 2.1), and can be used for both general evaluation and \"few-shot\" evaluation.\nWe also release the raw dump that we collected via snowball sampling, but focus on CODEX-S through L for the remainder of this paper.\nTo minimize train/test leakage, we removed inverse relations from each dataset . We computed (head, tail) and (tail, head) overlap between all pairs of relations, and removed each relation whose entity pair set overlapped with that of another relation more than 50% of the time. Finally, we split each dataset into 90/5/5 train/validation/test triples such that the validation and test sets contained only entities and relations seen in the respective training sets.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Auxiliary information", "text": "An advantage of Wikidata is that it links entities and relations to various sources of rich auxiliary information. To enable tasks that involve joint learning over knowledge graph structure and such additional information, we collected:\n• Entity types for each entity as given by Wikidata's instance of and subclass of relations;\n• Wikidata labels and descriptions for entities, relations, and entity types; and\n• Wikipedia page extracts (introduction sections) for entities and entity types.\nFor the latter two, we collected text where available in Arabic, German, English, Spanish, Russian, and Chinese. We chose these languages because they are all relatively well-represented on Wikidata (Kaffee et al., 2017). Table 2 provides the coverage by language for each CODEX dataset. ", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Hard negatives for evaluation", "text": "Knowledge graphs are unique in that they only contain positive statements, meaning that triples not observed in a given knowledge graph are not necessarily false, but merely unseen; this is called the Open World Assumption (Galárraga et al., 2013). However, most machine learning tasks on knowledge graphs require negatives in some capacity. While different negative sampling strategies exist (Cai and Wang, 2018), the most common approach is to randomly perturb observed triples to generate negatives, following Bordes et al. (2013).\nWhile random negative sampling is beneficial and even necessary in the case where a large number of negatives is needed (i.e., training), it is not necessarily useful for evaluation. For example, in the task of triple classification, the goal is to discriminate between positive (true) and negative (false) triples. As we show in § 5.5, triple classification over randomly generated negatives is trivially easy for state-of-the-art models because random negatives are generally not meaningful or plausible. Therefore, we generate and manually evaluate hard negatives for KGC evaluation.\nGeneration To generate hard negatives, we used each pre-trained embedding model from § 5.2 to predict tail entities of triples in CODEX. For each model, we took as candidate negatives the triples (h, r,t) for which (i) the type of the predicted tail entityt matched the type of the true tail entity t; (ii)t was ranked in the top-10 predictions by that model; and (iii) (h, r,t) was not observed in G.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Annotation", "text": "We manually labeled all candidate negative triples generated for CODEX-S and CODEX-M as true or false using the guidelines provided in Appendix C. 3 We randomly selected among the triples labeled as false to create validation and test negatives for CODEX-S and CODEX-M, examples of which are given in Ta- 3 We are currently investigating methods for obtaining highquality crowdsourced annotations of negatives for CODEX-L. ble 3. To assess the quality of our annotations, we gathered judgments from two independent native English speakers on a random selection of 100 candidate negatives. The annotators were provided the instructions from Appendix C. On average, our labels agreed with those of the annotators 89.5% of the time. Among the disagreements, 81% of the time we assigned the label true whereas the annotator assigned the label false, meaning that we were comparatively conservative in labeling negatives.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Analysis of relation patterns", "text": "To give an idea of the types of reasoning necessary for models to perform well on CODEX, we analyze the presence of learnable binary relation patterns within CODEX. The three main types of such patterns in knowledge graphs are symmetry, inversion, and compositionality (Trouillon et al., 2019;. We address symmetry and compositionality here, and omit inversion because we specifically removed inverse relations to avoid train/test leakage ( § 3.2).", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Symmetry", "text": "Symmetric relations are relations r for which (h, r, t) ∈ G implies (t, r, h) ∈ G. For each relation, we compute the number of its (head, tail) pairs that overlap with its (tail, head) pairs, divided by the total number of pairs, and take those with 50% overlap or higher as symmetric. CODEX datasets have five such relations: diplomatic relation, shares border with, sibling, spouse, and unmarried partner. Table 4 gives the proportion of triples containing symmetric relations per dataset. Symmetric patterns are more prevalent in CODEX-S, whereas the larger datasets are mostly antisymmetric, i.e., (h, r, t) ∈ G implies (t, r, h) ∈ G.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Composition", "text": "Compositionality captures path rules of the form (h, r 1 , x 1 ), . . . , (x n , r n , t) → (h, r, t). To learn these rules, models must be capable of \"multi-hop\" reasoning on knowledge graphs (Guu et al., 2015). To identify compositional paths, we use the AMIE3 system (Lajus et al., 2020), which outputs rules with confidence scores that capture how many times those rules are seen versus violated, to identify paths of lengths two and three; we omit longer paths as they are relatively costly to compute. We identify 26, 44, and 93 rules in CODEX-S, CODEX-M, and CODEX-L, respectively, with average confidence (out of 1) of 0.630, 0.556, and 0.459. Table 4 gives the percentage of triples per dataset participating in a discovered rule.\nEvidently, composition is especially prevalent in CODEX-L. An example rule in CODEX-L is \"if X was founded by Y, and Y's country of citizenship is Z, then the country [i.e., of origin] of X is Z\" (confidence 0.709). We release these rules as part of CODEX for further development of KGC methodologies that incorporate or learn rules.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Benchmarking", "text": "Next, we benchmark performance on CODEX for the tasks of link prediction and triple classification. To ensure that models are fairly and accurately compared, we follow Ruffinelli et al. (2020), who conducted what is (to the best of our knowledge) the largest-scale hyperparameter tuning study of knowledge graph embeddings to date.\nNote that CODEX can be used to evaluate any type of KGC method. However, we focus on embeddings in this section due to their widespread usage in modern NLP (Ji et al., 2020).", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Tasks", "text": "Link prediction The link prediction task is conducted as follows: Given a test triple (h, r, t), we construct queries (?, r, t) and (h, r, ?). For each query, a model scores candidate head (tail) entitieŝ h (t) according to its belief thatĥ (t) completes the triple (i.e., answers the query). The goal is of link prediction is to rank true triples (ĥ, r, t) or (h, r,t) higher than false and unseen triples.\nLink prediction performance is evaluated with mean reciprocal rank (MRR) and hits@k. MRR is the average reciprocal of each ground-truth entity's rank over all (?, r, t) and (h, r, ?) test triples. Hits@k measures the proportion of test triples for which the ground-truth entity is ranked in the top-k predicted entities. In computing these metrics, we exclude the predicted entities for which (ĥ, r, t) ∈ G or (h, r,t) ∈ G so that known positive triples do not artificially lower ranking scores. This is called \"filtering\" (Bordes et al., 2013).\nTriple classification Given a triple (h, r, t), the goal of triple classification is to predict a corresponding label y ∈ {−1, 1}. Since knowledge graph embedding models output real-valued scores for triples, we convert these scores into labels by selecting a decision threshold per relation on the validation set such that validation accuracy is maximized for the model in question. A similar approach was used by Socher et al. (2013). We compare results on three sets of evaluation negatives: (1) We generate one negative per positive by replacing the positive triple's tail entity by a tail entity t sampled uniformly at random;\n(2) We generate negatives by sampling tail entities according to their relative frequency in the tail slot of all triples; and (3) We use the CODEX hard negatives. We measure accuracy and F1 score.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Models", "text": "We compare the following embedding methods: RESCAL (Nickel et al., 2011), TransE (Bordes et al., 2013), ComplEx (Trouillon et al., 2016), ConvE (Dettmers et al., 2018), andTuckER (Balazevic et al., 2019b). These models represent several classes of architecture, from linear (RESCAL, TuckER, ComplEx) to translational (TransE) to nonlinear/learned (ConvE). Appendix D provides more specifics on each model.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "Model selection", "text": "As recent studies have observed that training strategies are equally, if not more, important than architecture for link prediction (Kadlec et al., 2017;Lacroix et al., 2018;Ruffinelli et al., 2020), we search across a large range of hyperparameters to ensure a truly fair comparison. To this end we use the PyTorch-based LibKGE framework for training and selecting knowledge graph embeddings. 4 In the remainder of this section we outline the most important parameters of our model selection process.  Training negatives Given a set of positive training triples {(h, r, t)}, we compare three types of negative sampling strategy implemented by LibKGE: (a) NegSamp, or randomly corrupting head entities h or tail entities t to create negatives; (b) 1vsAll, or treating all possible head/tail corruptions of (h, r, t) as negatives, including the corruptions that are actually positives; and (c) KvsAll, or treating batches of head/tail corruptions not seen in the knowledge graph as negatives.\nLoss functions We consider the following loss functions: (i) MR or margin ranking, which aims to maximize a margin between positive and negative triples; (ii) BCE or binary cross-entropy, which is computed by applying the logistic sigmoid to triple scores; and (iii) CE or cross-entropy between the softmax over the entire distribution of triple scores and the label distribution over all triples, normalized to sum to one.\nSearch strategies We select models using the Ax platform, which supports hyperparameter search using both quasi-random sequences of generated configurations and Bayesian optimization (BO) with Gaussian processes. 5 At a high level, for each dataset and model, we generate both quasirandom and BO trials per negative sampling and loss function combination, ensuring that we search over a wide range of hyperparameters for different types of training strategy. Appendix F provides specific details on the search strategy for each dataset, which was determined according to resource constraints and observed performance patterns. ", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Link prediction results", "text": "Table 5 gives link prediction results. We find that ComplEx is the best at modeling symmetry and antisymmetry, and indeed it was designed specifically to improve upon bilinear models that do not capture symmetry, like DistMult (Trouillon et al., 2016). As such, it performs the best on CODEX-S, which has the highest proportion of symmetric relations. For example, on the most frequent symmetric relation (diplomatic relation), ComplEx achieves 0.859 MRR, compared to 0.793 for ConvE, 0.490 for RESCAL, and 0.281 for TransE. By contrast, TuckER is strongest at modeling compositional relations, so it performs best on CODEX-L, which has a high degree of compositionality. For example, on the most frequent compositional relation in CODEX-L (languages spoken, written, or signed), TuckER achieves 0.465 MRR, compared to 0.464 for RESCAL, 0.463 for ConvE, 0.456 for ComplEx, and 0.385 for TransE. By contrast, since CODEX-M is mostly asymmetric and non-compositional, ComplEx performs best because of its ability to model asymmetry.\nEffect of hyperparameters As shown by Figure 1, hyperparameters have a strong impact on link prediction performance: Validation MRR for all models varies by over 30 percentage points depending on the training strategy and input configuration. This finding is consistent with previous observations in the literature (Kadlec et al., 2017;Ruffinelli et al., 2020). Appendix F provides the best configurations for each model. Overall, we find that the choice of loss function in particular significantly impacts model performance. Each model consistently achieved its respective peak performance with cross-entropy (CE) loss, a finding which is corroborated by several other KGC comparison papers (Kadlec et al., 2017;Ruffinelli et al., 2020;Jain et al., 2020). As far as negative sampling techniques, we do not find that a single strategy is dominant, suggesting that the choice of loss function is more important.", "n_publication_ref": 6, "n_figure_ref": 1}, {"heading": "Triple classification results", "text": "Table 6 gives triple classification results. Evidently, triple classification on randomly generated negatives is a nearly-solved task. On negatives generated uniformly at random, performance scores are nearly identical at almost 100% accuracy. Even with a negative sampling strategy \"smarter\" than uniform random, all models perform well.\nHard negatives Classification performance degenerates considerably on our hard negatives, around 8 to 11 percentage points from relative frequency-based sampling and 13 to 19 percentage points from uniformly random sampling. Relative performance also varies: In contrast to our link prediction task in which ComplEx and TuckER were by far the strongest models, RESCAL is slightly stronger on the CODEX-S hard negatives, whereas ConvE performs best on the CODEX-M hard negatives. These results indicate that triple classification is indeed a distinct task that requires different architectures and, in many cases, different training strategies (Appendix F).\nWe believe that few recent works use triple classification as an evaluation task because of the lack of true hard negatives in existing benchmarks. Early works reported high triple classification accuracy on sampled negatives (Socher et al., 2013;Wang et al., 2014), perhaps leading the community to believe that the task was nearly solved. However, our results demonstrate that the task is far from solved when the negatives are plausible but truly false.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Comparative case study", "text": "Finally, we conduct a comparative analysis between CODEX-M and FB15K-237 ( § 2.1) to demonstrate the unique value of CODEX. We choose FB15K-237 because it is the most popular encyclopedic KGC benchmark after FB15K, which was already shown to be an easy dataset by . We choose CODEX-M because it is the closest in size to FB15K-237.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Content", "text": "We first compare the content in CODEX-M, which is extracted from Wikidata, with that of FB15K-237, which is extracted from Freebase. For brevity, Figure 2 compares the top-15 relations by mention count in the two datasets. Appendix E provides more content comparisons.\nDiversity The most common relation in CODEX-M is occupation, which is because most people on Wikidata have multiple occupations listed. By contrast, the frequent relations in FB15K-237 are mostly related to awards and film. In fact, over 25% of all triples in FB15K-237 belong to the /award relation domain, suggesting that CODEX covers a more diverse selection of content.\nInterpretability The Freebase-style relations are also arguably less interpretable than those in Wikidata. Whereas Wikidata relations have concise natural language labels, the Freebase relation labels are hierarchical, often at five or six levels of hierarchy (Figure 2). Moreover, all relations in Wikidata are binary, whereas some Freebase relations are n-nary (Tanon et al., 2016), meaning that they connect more than two entities. The relations containing a dot (\".\") are such n-nary relations, and are difficult to reason about without understanding the structure of Freebase, which has been deprecated. We further discuss the impact of such n-nary relations for link prediction in the following section.", "n_publication_ref": 1, "n_figure_ref": 2}, {"heading": "Difficulty", "text": "Next, we compare the datasets in a link prediction task to show that CODEX-M is more difficult.\nBaseline We devise a \"non-learning\" link prediction baseline. Let (h, r, ?) be a test query. Our baseline scores candidate tail entities by their relative frequency in the tail slot of all training triples mentioning r, filtering out tail entities t for which (h, r, t) is already observed in the training set. If all tail entities t are filtered out, we score entities by frequency before filtering. The logic of our approach works in reverse for (?, r, t) queries. In evaluating our baseline, we follow LibKGE's protocol for breaking ties in ranking (i.e., for entities that appear with equal frequency) by taking the mean rank of all entities with the same score.\nSetup We compare our baseline to the best pretrained embedding model per dataset: RESCAL for FB15K-237, which was released by Ruffinelli et al. (2020), and ComplEx for CODEX-M. We evaluate performance with MRR and Hits@10. Beyond overall performance, we also compute per-relation improvement of the respective embedding over our baseline in terms of percentage points MRR. This measures the amount of learning beyond frequency statistics necessary for each relation.\nResults and discussion Table 7 compares the overall performance of our baseline versus the best embedding per dataset, and Figure 3 shows the improvement of the respective embedding over our baseline per relation type on each dataset. The improvement of the embedding is much smaller on FB15K-237 than CODEX-M, and in fact our baseline performs on par with or even outperforms the  embedding on FB15K-237 for some relation types.\nTo further explore these cases, Figure 4 gives the empirical cumulative distribution function of improvement, which shows the percentage of test triples for which the level of improvement is less than or equal to a given value on each dataset. Surprisingly, the improvement for both MRR and Hits@10 is less than five percentage points for nearly 40% of FB15K-237's test set, and is zero or negative 15% of the time. By contrast, our baseline is significantly weaker than the strongest embedding method on CODEX-M.\nThe disparity in improvement is due to two relation patterns prevalent in FB15K-237: • Skewed relations FB15K-237 contains many relations that are skewed toward a single head or tail entity. For example, our baseline achieves perfect performance over all (h, r, ?) We conclude that while FB15K-237 is a valuable dataset, CODEX is more appropriately difficult for link prediction. Additionally, we note that in FB15K-237, all validation and test triples containing entity pairs directly linked in the training set were deleted , meaning that symmetry cannot be tested for in FB15K-237. Given that CODEX datasets contain both symmetry and compositionality, CODEX is more suitable for assessing how well models can learn relation patterns that go beyond frequency.\nqueries", "n_publication_ref": 1, "n_figure_ref": 2}, {"heading": "Conclusion and outlook", "text": "We present CODEX, a set of knowledge graph COmpletion Datasets EXtracted from Wikidata and Wikipedia, and show that CODEX is suitable for multiple KGC tasks. We release data, code, and pretrained models for use by the community at https://bit.ly/2EPbrJs. Some promising future directions on CODEX include:\n• Better model understanding CODEX can be used to analyze the impact of hyperparameters, training strategies, and model architectures in KGC tasks.\n• Revival of triple classification We encourage the use of triple classification on CODEX in addition to link prediction because it directly tests discriminative power.\n• Fusing text and structure Including text in both the link prediction and triple classification tasks should substantially improve performance . Furthermore, text can be used for few-shot link prediction, an emerging research direction (Xiong et al., 2017;Shi and Weninger, 2017).\nOverall, we hope that CODEX will provide a boost to research in KGC, which will in turn impact many other fields of artificial intelligence.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "A Literature review", "text": "Table 8 provides an overview of knowledge graph embedding papers with respect to datasets and evaluation tasks. In our review, we only consider papers published between 2014 and 2020 in the main proceedings of conferences where KGC embedding papers are most likely to appear: Artificial intelligence (AAAI, IJCAI), machine learning (ICML, ICLR, NeurIPS), and natural language processing (ACL, EMNLP, NAACL).\nThe main evaluation benchmarks are FB15K (Bordes et al., 2013), WN18 (Bordes et al., 2013), FB15K-237 (Toutanova and Chen, 2015), WN18RR (Dettmers et al., 2018), FB13 (Socher et al., 2013), WN11 (Socher et al., 2013), NELL-995 (Xiong et al., 2017), YAGO3-10 (Dettmers et al., 2018, Countries (Bouchard et al., 2015). UMLS (McCray, 2003), Kinship (Kemp et al., 2006), Families (Hinton, 1986, and other versions of NELL (Mitchell et al., 2018).", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "B Seeds for data collection", "text": "Table 9 provides all seed entity and relation types used to collect CODEX. Each type is given first by its natural language label and then by its Wikidata unique ID: Entity IDs begin with Q, whereas relation (property) IDs begin with P. For the entity types that apply to people (e.g., actor, musician, journalist), we retrieved seed entities by querying Wikidata using the occupation relation. For the entity types that apply to things (e.g., airline, disease, tourist attraction), we retrieved seed entities by querying Wikidata using the instance of and subclass of relations.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "C Negative annotation guidelines", "text": "We provide the annotation guidelines we used to label candidate negative triples ( § 3.4).\nTask You must label each triple as either true or false. To help you find the answer, we have provided you with Wikipedia and Wikidata links for the entities and relations in each triple. You may also search on Google for the answer, although most claims should be resolvable using Wikipedia and Wikidata alone. If you are not able to find any reliable, specific, clear information supporting the claim, choose false. You may explain your reasoning if need be or provide sources to back up your answer in the optional explanation column.\nExamples False triples may have problems with grammar, factual content, or both. Examples of grammatically incorrect triples are those whose entity or relation types do not make sense, for example:\n• (United States of America, continent, science fiction writer)\n• (Mohandas Karamchand Gandhi, medical condition, British Raj)\n• (Canada, foundational text, Vietnamese cuisine)\nExamples of grammatically correct but factually false triples include:\n• (United States of America, continent, Europe)\n• (Mohandas Karamchand Gandhi, country of citizenship, Argentina)\n• (Canada, foundational text, Harry Potter and the Goblet of Fire)\n• (Alexander Pushkin, influenced by, Leo Tolstoy) -Pushkin died only a few years after Tolstoy was born, so this sentence is unlikely.\nNotice that in the latter examples, the entity types match up, but the statements are still false.\nTips For triples about people's occupation and genre, try to be as specific as possible. For example, if the triple says (<person>, occupation, guitarist) but that person is mainly known for their singing, choose false, even if that person plays the guitar. Likewise, if a triple says (<person>, genre, classical) but they are mostly known for jazz music, choose false even if, for example, that person had classical training in their childhood.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "D Embedding models", "text": "We briefly overview the five models compared in our link prediction and triple classification tasks.\nRESCAL (Nickel et al., 2011) was one of the first knowledge graph embedding models. Although it is not often used as a baseline, Ruffinelli et al. (2020) showed that it is competitive when appropriately tuned. RESCAL treats relational learning as tensor decomposition, scoring entity embeddings h, r ∈ R de and relation embeddings R ∈ R de×de with the bilinear form h Rt.   P35), headquarters location (P159), health specialty (P1995), indigenous to (P2341), industry (P452), influenced by (P737), instance of (P31), instrument (P1303), language of work or name (P407), languages spoken, written, or signed (P1412), legal form (P1454), legislative body (P194), located in the administrative terroritorial entity (P131), location of formation (P740), medical condition (P1050), medical examinations (P923), member of (P463), member of political party (P102), member of sports team (P54), mountain range (P4552), movement (P135), named after (P138), narrative location (P840), notable works (P800), occupant (P466), occupation (P106), official language (P37), parent organization (P749), part of (P361), place of birth (P19), place of burial (P119), place of death (P20), practiced by (P3095), product or material produced (P1056), publisher (P123), record label (P264), regulated by (P3719), religion (P140), residence (P551), shares border with (P47), sibling (P3373), sport (P641), spouse (P26), studies (P2578), subclass of (P279), symptoms (P780), time period (P2348), tributary (P974), unmarried partner (P451), use (P366), uses (P2283)\nTransE (Bordes et al., 2013) treats relations as translations between entities, i.e., h + r ≈ t for h, r, t ∈ R de , and scores embeddings with negative Euclidean distance − h + r − t . TransE is likely the most popular baseline for KGC tasks and the most influential of all KGC embedding papers.\nComplEx (Trouillon et al., 2016) uses a bilinear function to score triples with a diagonal relation embedding matrix and complex-valued embeddings. Its scoring function is re h diag(r)t , where t is the complex conjugate of t and re denotes the real part of a complex number.\nConvE (Dettmers et al., 2018) is one of the first and most popular nonlinear models for KGC. It concatenates head and relation embeddings h and r into a two-dimensional \"image\", applies a pointwise linearity over convolutional and fullyconnected layers, and multiplies the result with the tail embedding t to obtain a score. Formally, its scoring function is given as f (vec(f ([h; r] * ω))W)t, where f is a nonlinearity (originally, ReLU), [h; r] denotes a concatenation and twodimensional reshaping of the head and relation embeddings, ω denotes the filters of the convolutional layer, and vec denotes the flattening of a two-dimensional matrix.\nTuckER (Balazevic et al., 2019b) is a linear model based on the Tucker tensor decomposition, which factorizes a tensor into three lower-rank matrices and a core tensor. The TuckER scoring function for a single triple (h, r, t) is given as W × 1 h × 2 r × 3 t, where W is the mode-three core tensor that is shared among all entity and relation embeddings, and × n denotes the tensor product along the nth mode of the tensor. TuckER can be seen as a generalized form of other linear KGC embedding models like RESCAL and ComplEx.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "E Content comparison", "text": "We provide additional comparison of the contents in CODEX-M and FB15K-237. Figure 5, which plots the top-30 entities by frequency in the two benchmarks, demonstrates that both dataset are biased toward developed Western countries and cultures. However, CODEX-M is more diverse in domain. It covers academia, entertainment, journalism, politics, science, and writing, whereas FB15K-237 covers mostly entertaiment and sports. FB15K-237 is also much more biased toward the United States in particular, as five of its top-30 entities are specific to the US: United States of America, United States dollar, New York City,  Figure 6 compares the top-15 entity types in CODEX-M and FB15K-237. Again, CODEX-M is diverse, covering people, places, organizations, movies, and abstract concepts, whereas FB15K-237 has many overlapping entity types mostly about entertainment.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "F Hyperparameter search", "text": "Table 10 gives our hyperparameter search space. Tables 11, 12, and 13 report the best hyperparameter configurations for link prediction on CODEX-S, CODEX-M, and CODEX-L, respectively. Tables 14 and 15 report the best hyperparameter configurations for triple classification on the hard negatives in CODEX-S and CODEX-M, respectively.\nTerminology For embedding initialization, Xv refers to Xavier initialization (Glorot and Bengio, 2010). The reciprocal relations model refers to learning separate relation embeddings for queries in the direction of (h, r, ?) versus (?, r, t) (Kazemi and Poole, 2018). The frequency weighting regularization technique refers to regularizing embeddings by the relative frequency of the corresponding entity or relation in the training data.\nSearch strategies Recall that we select models using Ax, which supports hyperparameter search using both quasi-random sequences of generated configurations and Bayesian optimization (BO). The search strategy for each CODEX dataset is as follows:\n• CODEX-S: Per negative sampling type/loss combination, we generate 30 quasi-random trials followed by 10 BO trials. We select the best-performing model by validation MRR over all such combinations. In each trial, the model is trained for a maximum of 400 epochs with an early stopping patience of 5. We also terminate a trial after 50 epochs if the model does not reach ≥ 0.05 MRR.\n• CODEX-M: Per negative sampling type/loss combination, we generate 20 quasi-random trials. The maximum number of epochs and early stopping criteria are the same as for CODEX-S.\n• CODEX-L: Per negative sampling type/loss combination, we generate 10 quasi-random trials of 20 training epochs instead of 400. We reduce the number of epochs to limit resource usage. In most cases, MRR plateaus after 20-30 epochs, an observation which is consistent with (Ruffinelli et al., 2020). Then, we take the best-performing model by validation MRR over all such combinations, and retrain that model for a maximum of 400 epochs.\nNote that we search using MRR as our metric, but the triple classification task measures 0/1 accuracy, not ranking performance. For triple classification, we choose the model with the highest validation accuracy among the pre-trained models across all negative sampling type/loss function combinations. We release all pretrained LibKGE models and accompanying configuration files in the centralized CODEX repository.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Acknowledgments", "text": "The authors thank Michał Rybak and Xinyi (Carol) Zheng for their contributions. This material is supported by the National Science Foundation under Grant No. IIS 1845491, Army Young Investigator Award No. W911NF1810397, and an NSF Graduate Research Fellowship.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "", "text": "Table 10: Our hyperparameter search space. We follow the naming conventions and ranges given by Ruffinelli et al. (2020), and explain the meanings of selected hyperparameter settings in Appendix F. As most KGC embedding models have a wide range of configuration options, we encourage future work to follow this tabular scheme for transparent reporting of implementation details. \n1.0     -See Tab. 12 --See Tab. 12 Interval (Unif)\n-See Tab. 12 −0.8133 -See Tab. 12 Gain (XvNorm)\n1.0 See Tab. 12 --See Tab. 12 Gain (XvUnif)\n-See Tab. 12 -1.0 See Tab. 12", "n_publication_ref": 1, "n_figure_ref": 0}], "references": [{"title": "Realistic re-evaluation of knowledge graph completion methods: An experimental study", "journal": "", "year": "2020", "authors": "Farahnaz Akrami; Mohammed Samiul Saeef; Qingheng Zhang; Wei Hu; Chengkai Li"}, {"title": "Multi-relational poincaré graph embeddings", "journal": "", "year": "2019", "authors": "Ivana Balazevic; Carl Allen; Timothy Hospedales"}, {"title": "Tucker: Tensor factorization for knowledge graph completion", "journal": "", "year": "2019", "authors": "Ivana Balazevic; Carl Allen; Timothy Hospedales"}, {"title": "A2n: Attending to neighbors for knowledge graph inference", "journal": "", "year": "2019", "authors": "Trapit Bansal; Da-Cheng Juan; Sujith Ravi; Andrew Mccallum"}, {"title": "Fast algorithms for determining (generalized) core groups in social networks", "journal": "ADAC", "year": "2011", "authors": "Vladimir Batagelj; Matjaž Zaveršnik"}, {"title": "Freebase: a collaboratively created graph database for structuring human knowledge", "journal": "", "year": "2008", "authors": "Kurt Bollacker; Colin Evans; Praveen Paritosh; Tim Sturge; Jamie Taylor"}, {"title": "Translating embeddings for modeling multirelational data", "journal": "", "year": "2013", "authors": "Antoine Bordes; Nicolas Usunier; Alberto Garcia-Duran; Jason Weston; Oksana Yakhnenko"}, {"title": "On approximate reasoning capabilities of low-rank vector spaces", "journal": "", "year": "2015", "authors": "Guillaume Bouchard; Sameer Singh; Theo Trouillon"}, {"title": "Kbgan: Adversarial learning for knowledge graph embeddings", "journal": "", "year": "2018", "authors": "Liwei Cai; William Yang Wang"}, {"title": "Go for a walk and arrive at the answer: Reasoning over paths in knowledge bases using reinforcement learning", "journal": "", "year": "2018", "authors": "Rajarshi Das; Shehzaad Dhuliawala; Manzil Zaheer; Luke Vilnis; Ishan Durugkar; Akshay Krishnamurthy; Alex Smola; Andrew Mccallum"}, {"title": "Convolutional 2d knowledge graph embeddings", "journal": "", "year": "2018", "authors": "Tim Dettmers; Pasquale Minervini; Pontus Stenetorp; Sebastian Riedel"}, {"title": "Toruse: Knowledge graph embedding on a lie group", "journal": "", "year": "2018", "authors": "Takuma Ebisu; Ryutaro Ichise"}, {"title": "Amie: association rule mining under incomplete evidence in ontological knowledge bases", "journal": "", "year": "2013", "authors": "Luis Antonio Galárraga; Christina Teflioudi; Katja Hose; Fabian Suchanek"}, {"title": "Composing relationships with translations", "journal": "", "year": "2015", "authors": "Alberto Garcia-Duran; Antoine Bordes; Nicolas Usunier"}, {"title": "Understanding the difficulty of training deep feedforward neural networks", "journal": "", "year": "2010", "authors": "Xavier Glorot; Yoshua Bengio"}, {"title": "Snowball sampling", "journal": "Ann. Math. Stat", "year": "1961", "authors": " Leo A Goodman"}, {"title": "Learning to exploit long-term relational dependencies in knowledge graphs", "journal": "", "year": "2019", "authors": "Lingbing Guo; Zequn Sun; Wei Hu"}, {"title": "Semantically smooth knowledge graph embedding", "journal": "", "year": "2015", "authors": "Shu Guo; Quan Wang; Bin Wang; Lihong Wang; Li Guo"}, {"title": "Knowledge graph embedding with iterative guidance from soft rules", "journal": "", "year": "2018", "authors": "Shu Guo; Quan Wang; Lihong Wang; Bin Wang; Li Guo"}, {"title": "Traversing knowledge graphs in vector space", "journal": "", "year": "2015", "authors": "Kelvin Guu; John Miller; Percy Liang"}, {"title": "Learning distributed representations of concepts", "journal": "", "year": "1986", "authors": "E Geoffrey;  Hinton"}, {"title": "Knowledge base completion", "journal": "", "year": "2020", "authors": "Prachi Jain; Sushant Rathi; Mausam ; Soumen Chakrabarti"}, {"title": "Knowledge graph embedding via dynamic mapping matrix", "journal": "", "year": "2015", "authors": "Guoliang Ji; Shizhu He; Liheng Xu; Kang Liu; Jun Zhao"}, {"title": "2020. A survey on knowledge graphs: Representation, acquisition and applications", "journal": "", "year": "", "authors": "Shaoxiong Ji; Shirui Pan; Erik Cambria; Pekka Marttinen; Philip S Yu"}, {"title": "Locally adaptive translation for knowledge graph embedding", "journal": "", "year": "2016", "authors": "Yantao Jia; Yuanzhuo Wang; Hailun Lin; Xiaolong Jin; Xueqi Cheng"}, {"title": "Adaptive convolution for multi-relational learning", "journal": "", "year": "2019", "authors": "Xiaotian Jiang; Quan Wang; Bin Wang"}, {"title": "Knowledge base completion: Baselines strike back", "journal": "", "year": "2017", "authors": "Rudolf Kadlec; Ondrej Bajgar"}, {"title": "A glimpse into babel: an analysis of multilinguality in wikidata", "journal": "", "year": "2017", "authors": "Lucie-Aimée Kaffee; Alessandro Piscopo; Pavlos Vougiouklis; Elena Simperl; Leslie Carr; Lydia Pintscher"}, {"title": "Simple embedding for link prediction in knowledge graphs", "journal": "", "year": "2018", "authors": "David Seyed Mehran Kazemi;  Poole"}, {"title": "Learning systems of concepts with an infinite relational model", "journal": "", "year": "2006", "authors": "Charles Kemp; Joshua B Tenenbaum; L Thomas; Takeshi Griffiths; Naonori Yamada;  Ueda"}, {"title": "Canonical tensor decomposition for knowledge base completion", "journal": "", "year": "2018", "authors": "Timothee Lacroix; Nicolas Usunier; Guillaume Obozinski"}, {"title": "Fast and exact rule mining with amie 3", "journal": "", "year": "2020", "authors": "Jonathan Lajus; Luis Galárraga; Fabian M Suchanek"}, {"title": "Multi-hop knowledge graph reasoning with reward shaping", "journal": "", "year": "2018", "authors": "Richard Xi Victoria Lin; Caiming Socher;  Xiong"}, {"title": "Modeling relation paths for representation learning of knowledge bases", "journal": "", "year": "2015", "authors": "Yankai Lin; Zhiyuan Liu; Huanbo Luan; Maosong Sun; Siwei Rao; Song Liu"}, {"title": "Knowledge representation learning with entities, attributes and relations", "journal": "", "year": "2016", "authors": "Yankai Lin; Zhiyuan Liu; Maosong Sun"}, {"title": "Learning entity and relation embeddings for knowledge graph completion", "journal": "", "year": "2015", "authors": "Yankai Lin; Zhiyuan Liu; Maosong Sun; Yang Liu; Xuan Zhu"}, {"title": "Analogical inference for multi-relational embeddings", "journal": "", "year": "2017", "authors": "Hanxiao Liu; Yuexin Wu; Yiming Yang"}, {"title": "Yago3: A knowledge base from multilingual wikipedias", "journal": "", "year": "2014", "authors": "Farzaneh Mahdisoltani; Joanna Biega; Fabian Suchanek"}, {"title": "An upper-level ontology for the biomedical domain", "journal": "Comp. Funct. Genomics", "year": "2003", "authors": "Alexa T Mccray"}, {"title": "Fine-grained evaluation of ruleand embedding-based systems for knowledge graph completion", "journal": "", "year": "2018", "authors": "Christian Meilicke; Manuel Fink; Yanjie Wang; Daniel Ruffinelli; Rainer Gemulla; Heiner Stuckenschmidt"}, {"title": "WordNet: An electronic lexical database", "journal": "MIT press", "year": "1998", "authors": "A George;  Miller"}, {"title": "", "journal": "Never-ending learning. CACM", "year": "2018", "authors": "Tom Mitchell; William Cohen; Estevam Hruschka; Partha Talukdar; Bishan Yang; Justin Betteridge; Andrew Carlson; Bhanava Dalvi; Matt Gardner; Bryan Kisiel"}, {"title": "Learning attention-based embeddings for relation prediction in knowledge graphs", "journal": "", "year": "2019", "authors": "Deepak Nathani; Jatin Chauhan; Charu Sharma; Manohar Kaul"}, {"title": "Stranse: a novel embedding model of entities and relationships in knowledge bases", "journal": "", "year": "2016", "authors": "Kairit Dat Quoc Nguyen; Lizhen Sirts; Mark Qu;  Johnson"}, {"title": "A novel embedding model for knowledge base completion based on convolutional neural network", "journal": "", "year": "2018", "authors": "Dat Tu Dinh Nguyen; Dinh Quoc Nguyen;  Phung"}, {"title": "A review of relational machine learning for knowledge graphs", "journal": "", "year": "2015", "authors": "Maximilian Nickel; Kevin Murphy; Volker Tresp; Evgeniy Gabrilovich"}, {"title": "Holographic embeddings of knowledge graphs", "journal": "", "year": "2016", "authors": "Maximilian Nickel; Lorenzo Rosasco; Tomaso Poggio"}, {"title": "A three-way model for collective learning on multi-relational data", "journal": "", "year": "2011", "authors": "Maximilian Nickel; Hans-Peter Volker Tresp;  Kriegel"}, {"title": "Revisiting evaluation of knowledge base completion models", "journal": "", "year": "2020", "authors": "Pouya Pezeshkpour; Yifan Tian; Sameer Singh"}, {"title": "You can teach an old dog new tricks! on training knowledge graph embeddings", "journal": "", "year": "2020", "authors": "Daniel Ruffinelli; Samuel Broscheit; Rainer Gemulla"}, {"title": "Proje: Embedding projection for knowledge graph completion", "journal": "", "year": "2017", "authors": "Baoxu Shi; Tim Weninger"}, {"title": "Reasoning with neural tensor networks for knowledge base completion", "journal": "", "year": "2013", "authors": "Richard Socher; Danqi Chen; D Christopher; Andrew Manning;  Ng"}, {"title": "Rotate: Knowledge graph embedding by relational rotation in complex space", "journal": "", "year": "2019", "authors": "Zhiqing Sun; Zhi-Hong Deng; Jian-Yun Nie; Jian Tang"}, {"title": "From freebase to wikidata: The great migration", "journal": "", "year": "2016", "authors": "Denny Thomas Pellissier Tanon; Sebastian Vrandečić; Thomas Schaffert; Lydia Steiner;  Pintscher"}, {"title": "Observed versus latent features for knowledge base and text inference", "journal": "", "year": "2015", "authors": "Kristina Toutanova; Danqi Chen"}, {"title": "Representing text for joint embedding of text and knowledge bases", "journal": "", "year": "2015", "authors": "Kristina Toutanova; Danqi Chen; Patrick Pantel; Hoifung Poon; Pallavi Choudhury; Michael Gamon"}, {"title": "On inductive abilities of latent factor models for relational learning", "journal": "JAIR", "year": "2019", "authors": "Théo Trouillon; Éric Gaussier; Guillaume Christopher R Dance;  Bouchard"}, {"title": "Complex embeddings for simple link prediction", "journal": "", "year": "2016", "authors": "Théo Trouillon; Johannes Welbl; Sebastian Riedel; Éric Gaussier; Guillaume Bouchard"}, {"title": "Vikram Nitin, Nilesh Agrawal, and Partha Talukdar. 2020a. Interacte: Improving convolution-based knowledge graph embeddings by increasing feature interactions", "journal": "", "year": "", "authors": "Shikhar Vashishth; Soumya Sanyal"}, {"title": "Vikram Nitin, and Partha Talukdar. 2020b. Composition-based multirelational graph convolutional networks", "journal": "", "year": "", "authors": "Shikhar Vashishth; Soumya Sanyal"}, {"title": "Wikidata: a free collaborative knowledgebase", "journal": "CACM", "year": "2014", "authors": "Denny Vrandečić; Markus Krötzsch"}, {"title": "A capsule network-based embedding model for knowledge graph completion and search personalization", "journal": "", "year": "2019", "authors": "Thanh Vu; Dat Tu Dinh Nguyen; Dinh Quoc Nguyen;  Phung"}, {"title": "Knowledge graph embedding: A survey of approaches and applications", "journal": "TKDE", "year": "2017", "authors": "Quan Wang; Zhendong Mao; Bin Wang; Li Guo"}, {"title": "Knowledge base completion using embeddings and rules", "journal": "", "year": "2015", "authors": "Quan Wang; Bin Wang; Li Guo"}, {"title": "Learning first-order logic embeddings via matrix factorization", "journal": "", "year": "2016", "authors": "Yang William; William W Wang;  Cohen"}, {"title": "Knowledge graph embedding by translating on hyperplanes", "journal": "", "year": "2014", "authors": "Zhen Wang; Jianwen Zhang; Jianlin Feng; Zheng Chen"}, {"title": "From one point to a manifold: knowledge graph embedding for precise link prediction", "journal": "", "year": "2016", "authors": "Han Xiao; Minlie Huang; Xiaoyan Zhu"}, {"title": "Transg: A generative model for knowledge graph embedding", "journal": "", "year": "2016", "authors": "Han Xiao; Minlie Huang; Xiaoyan Zhu"}, {"title": "Representation learning of knowledge graphs with hierarchical types", "journal": "", "year": "2016", "authors": "Ruobing Xie; Zhiyuan Liu; Maosong Sun"}, {"title": "Deeppath: A reinforcement learning method for knowledge graph reasoning", "journal": "", "year": "2017", "authors": "Wenhan Xiong; Thien Hoang; William Yang Wang"}, {"title": "Relation embedding with dihedral group in knowledge graph", "journal": "", "year": "2019", "authors": "Canran Xu; Ruijiang Li"}, {"title": "Embedding entities and relations for learning and inference in knowledge bases", "journal": "", "year": "2015", "authors": "Bishan Yang; Wen-Tau Yih; Xiaodong He; Jianfeng Gao; Li Deng"}, {"title": "Quaternion knowledge graph embeddings", "journal": "", "year": "2019", "authors": "Shuai Zhang; Yi Tay; Lina Yao; Qi Liu"}, {"title": "Relational graph neural network with hierarchical attention for knowledge graph completion", "journal": "", "year": "2020", "authors": "Zhao Zhang; Fuzhen Zhuang; Hengshu Zhu; Zhiping Shi; Hui Xiong; Qing He"}], "figures": [{"figure_label": "", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1: Distribution of validation MRR, CODEX-M.", "figure_data": ""}, {"figure_label": "2", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 2: Top-15 most frequent relations in CODEX-M and FB15K-237.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 3 :3Figure 3: Improvement in MRR of the embedding over our frequency baseline per relation type. Negative means that our baseline outperforms the embedding. The medians are 8.27 and 20.04 percentage points on FB15K-237 and CODEX-M, respectively.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 4 :4Figure 4: Empirical CDF of improvement of the best embedding over our frequency baseline.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 5 :5Figure 5: Top-30 most frequent entities in CODEX-M and FB15K-237.", "figure_data": ""}, {"figure_label": "6", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 6 :6Figure 6: Top-15 most frequent entity types in CODEX-M and FB15K-237.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Qualitative comparison of CODEX datasets to existing Freebase-based KGC datasets ( § 2.1).", "figure_data": "Freebase variants (FB15K, FB15K-237)CODEX datasetsScope (domains)"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "CODEX datasets. (+): Positive (true) triples. (-): Verified negative (false) triples", "figure_data": ""}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Selected examples of hard negatives in CODEX with explanations. official language, American English) English, not American English, is an official language of Lesotho. (Senegal, part of, Middle East)Senegal is part of West Africa. (Simone de Beauvoir, field of work, astronomy) Simone de Beauvoir's field of work was primarily philosophy.", "figure_data": "NegativeExplanation(Frédéric Chopin, occupation, conductor)Chopin was a pianist and a composer, not a conductor.(Lesotho, (Vatican City, member of, UNESCO)Vatican City is a UNESCO World Heritage Site but not a member state."}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "Relation patterns in CODEX. For symmetry, we give the proportion of triples containing a symmetric relation. For composition, we give the proportion of triples participating in a rule of length two or three.", "figure_data": "CODEX-S CODEX-M CODEX-LSymmetry17.46%4.01%3.29%Composition10.09%16.55%31.84%"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Comparison of link prediction performance on CODEX.", "figure_data": "CODEX-SCODEX-MCODEX-LMRR Hits@1 Hits@10MRR Hits@1 Hits@10MRR Hits@1 Hits@10RESCAL 0.4040.2930.6230.3170.2440.4560.3040.2420.419TransE0.3540.2190.6340.3030.2230.4540.1870.1160.317ComplEx 0.4650.3720.6460.3370.2620.4760.2940.2370.400ConvE0.4440.3430.6350.3180.2390.4640.3030.2400.420TuckER0.4440.3390.6380.3280.2590.4580.3090.2440.430"}, {"figure_label": "10", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "", "figure_data": "in Appendix F gives further details and allhyperparameter ranges and values. All experimentswere run on a single NVIDIA Tesla V100 GPUwith 16 GB of RAM."}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "Comparison of triple classification performance on CODEX by negative generation strategy.", "figure_data": "CODEX-SCODEX-MUniformRelative freq.Hard neg.UniformRelative freq.Hard neg.Acc.F1Acc.F1Acc.F1Acc.F1Acc.F1Acc.F1RESCAL 0.972 0.9720.916 0.9200.843 0.8520.977 0.9760.921 0.9220.818 0.815TransE0.974 0.9740.919 0.9230.829 0.8370.986 0.9860.932 0.9330.797 0.803ComplEx 0.975 0.9750.927 0.9300.836 0.8460.984 0.9840.930 0.9330.824 0.818ConvE0.972 0.9720.921 0.9240.841 0.8460.979 0.9790.934 0.9350.826 0.829TuckER0.973 0.9730.917 0.9200.840 0.8460.977 0.9770.920 0.9220.823 0.816"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Overall performance (MRR) of our frequency baseline versus the best embedding nodel per benchmark. \"Improvement\" refers to the improvement of the embedding over the baseline.", "figure_data": "Baseline Embedding ImprovementFB15K-2370.2360.356+0.120CODEX-M0.1350.337+0.202"}, {"figure_label": "8", "figure_type": "table", "figure_id": "tab_10", "figure_caption": "An overview of knowledge graph embedding papers published between 2014 and 2020 with respect to datasets and evaluation tasks. Original citations for datasets are given in Appendix A. Link pred. refers to link prediction, and triple class. refers to triple classification, both of which are covered in § 5.", "figure_data": "DatasetsEvaluation tasksReferenceFB15KFB15K-237FB13WN18WN18RRWN11OtherLink pred.Triple class.Other(Wang et al., 2014)FB5Mrelation extraction (FB5M)(Lin et al., 2015b)FB40Krelation extraction (FB40K)(Wang et al., 2015)NELL (Location, Sports)(Nickel et al., 2016)Countries(Lin et al., 2016)FB24KAAAI, IJCAI(Wang and Cohen, 2016) (Xiao et al., 2016a) (Jia et al., 2016) (Xie et al., 2016)FB15K+(Shi and Weninger, 2017)SemMedDB, DBPediafact checking (not on FB15K)(Dettmers et al., 2018)YAGO3-10, Countries(Ebisu and Ichise, 2018)(Guo et al., 2018)YAGO37(Zhang et al., 2020)(Vashishth et al., 2020a)YAGO3-10(Yang et al., 2015)FB15K-401rule extraction (FB15K-401)(Trouillon et al., 2016)ICML, ICLR, NeurIPS(Liu et al., 2017) (Kazemi and Poole, 2018) (Das et al., 2018) (Lacroix et al., 2018) (Guo et al., 2019) (Sun et al., 2019)NELL-995, UMLS, Kinship, Countries, WikiMovies YAGO3-10 DBPedia-YAGO3, DBPedia-WikidataQA (WikiMovies) entity alignment (DBPedia graphs)(Zhang et al., 2019)(Balazevic et al., 2019a)(Vashishth et al., 2020b)MUTAG, AM, PTCgraph classification (MUTAG, AM, PTC)(Ji et al., 2015)(Guo et al., 2015)NELL (Location, Sports, Freq)(Guu et al., 2015)(Garcia-Duran et al., 2015)FamiliesACL, EMNLP, NAACL(Lin et al., 2015a) (Xiao et al., 2016b) (Nguyen et al., 2016) (Xiong et al., 2017) (Lin et al., 2018) (Nguyen et al., 2018) (Bansal et al., 2019)FB40K NELL-995 NELL-995, UMLS, Kinshiprelation extraction (FB40K) rule mining(Xu and Li, 2019)YAGO3-10, Family(Balazevic et al., 2019b)(Vu et al., 2019)SEARCH17personalized search (SEARCH17)(Nathani et al., 2019)NELL-995, UMLS, Kinship(Jiang et al., 2019)"}, {"figure_label": "9", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "The entity and relation types (Wikidata IDs in parentheses) used to seed CODEX.", "figure_data": "Seed typesactor (Q33999), airline (Q46970), airport (Q1248784), athlete (Q2066131), book (Q571), businessperson(Q43845), city (Q515), company (Q783794), country (Q6256), disease (Q12136), engineer (Q81096), filmEntities(Q11424), government agency (Q327333), journalist (Q1930187), lake (Q23397), monarch (Q116), mountain (Q8502), musical group (Q215380), musician (Q639669), newspaper (Q11032), ocean (Q9430), politician (Q82955), record label (Q18127), religion (Q9174), religious leader (Q15995642), religious text (Q179461),scientist (Q901), sports league (Q623109), sports team (Q12973014), stadium (Q483110), television program(Q15416), tourist attraction (Q570116), visual artist (Q3391743), visual artwork (Q4502142), writer (Q36180)airline alliance (P114), airline hub (P113), architect (P84), architectural style (P149), author (P50), capital(P36), cast member (P161), cause of death (P509), chairperson (P488), chief executive officer (P169), child(P40), continent (P30), country (P17), country of citizenship (P27), country of origin (P495), creator (P170),diplomatic relation (P530), director (P57), drug used for treatment (P2176), educated at (P69), employer (P108),ethnic group (P172), field of work (P101), foundational text (P457), founded by (P112), genre (P136), headof government (P6), head of state (Relations"}], "doi": ""}