{"authors": "Norio Takahashi; Tomohide Shibata; Daisuke Kawahara; Sadao Kurohashi", "pub_date": "", "title": "Machine Comprehension Improves Domain-Specific Japanese Predicate-Argument Structure Analysis", "abstract": "To improve the accuracy of predicateargument structure (PAS) analysis, large-scale training data and knowledge for PAS analysis are indispensable. We focus on a specific domain, specifically Japanese blogs on driving, and construct two wide-coverage datasets as a form of QA using crowdsourcing: a PAS-QA dataset and a reading comprehension QA (RC-QA) dataset. We train a machine comprehension (MC) model based on these datasets to perform PAS analysis. Our experiments show that a stepwise training method is the most effective, which pre-trains an MC model based on the RC-QA dataset to acquire domain knowledge and then fine-tunes based on the PAS-QA dataset.", "sections": [{"heading": "Introduction", "text": "To understand the meaning of a sentence or a text, it is essential to analyze relations between a predicate and its arguments. Such analysis is called semantic role labeling (SRL) or predicate-argument structure (PAS) analysis. For English, the accuracy of SRL has reached approximately 80%-90% (Ouchi et al., 2018;Strubell et al., 2018;Tan et al., 2018). However, there are many omissions of arguments in Japanese, and the accuracy of Japanese PAS analysis on omitted arguments is still around 50%-60% (Shibata et al., 2016;Shibata and Kurohashi, 2018;Kurita et al., 2018;Ouchi et al., 2017). A reason for such low accuracy is the shortage of gold datasets and knowledge about PAS analysis, which require a prohibitive cost of creation (Iida et al., 2007;Kawahara et al., 2002).\nFrom the viewpoint of text understanding, machine comprehension (MC) has been actively studied in recent years. In MC studies, QA datasets consisting of triplets of a document, a question and * The current affiliation is Yahoo Japan Corporation.\nits answer are constructed, and an MC model is trained using these datasets (e.g., Rajpurkar et al. (2016) and Trischler et al. (2017)). MC has made remarkable progress in the last couple of years, and MC models have even exceeded human accuracy in some datasets (Devlin et al., 2019). However, MC accuracy is not necessarily high for documents that contain anaphoric phenomena and those that need external knowledge or inference (Mihaylov et al., 2018;.\nIn this paper, we propose a Japanese PAS analysis method based on the MC framework for a specific domain. In particular, we focus on a challenging task of finding an antecedent of a zero pronoun within PAS analysis. We construct a widecoverage QA dataset for PAS analysis (PAS-QA) in the domain and feed it to an MC model to perform PAS analysis. We also construct a QA dataset for reading comprehension (RC-QA) in the same domain and jointly use the two datasets in the MC model to improve PAS analysis.\nWe consider the domain of blogs on driving because of the following two reasons. Firstly, we can construct high-quality QA datasets in a short time using crowdsourcing. Crowdworkers can interpret driving blog articles based on the traffic commonsense shared by the society. Secondly, if computers can understand driving situations correctly by extracting driving behavior from blogs, it is possible to predict danger and warn drivers to achieve safer transportation.\nOur contributions are summarized as follows.\n•  FitzGerald et al. (2018) and  constructed QA-SRL Bank 2.0 and QAMRs using crowdsourcing, respectively. They asked crowdworkers to generate question-answer pairs that represent a PAS. These datasets are similar to our PAS-QA dataset, but different in that we focus on omitted arguments and automatically generate questions (see Section 3.1). Many RC-QA datasets have been constructed in recent years. For example, Rajpurkar et al. (2016) constructed SQuAD 1.1, which contains 100K crowdsourced questions and answer spans in a Wikipedia article. Rajpurkar et al. (2018) updated SQuAD 1.1 to 2.0 by adding unanswerable questions. Some RC-QA datasets have been built in a specific domain (Welbl et al., 2017;Suster and Daelemans, 2018;Pampari et al., 2018).", "n_publication_ref": 19, "n_figure_ref": 0}, {"heading": "Machine Comprehension Models", "text": "Many MC models based on neural networks have been proposed to solve RC-QA datasets. For example, Devlin et al. (2019) proposed an MC model using a language representation model, BERT, which achieved a high-ranked accuracy on the SQuAD 1.1 leaderboard as of September 30, 2019.\nAs a previous study of transfer learning of MC models to other tasks, Pan et al. (2018) pre-trained an MC model using an RC-QA dataset and transfered the pre-trained knowledge to sequence-tosequence models. They used SQuAD 1.1 as the RC-QA dataset and experimented on translation and summarization. While they used different models for pre-training and fine-tuning, we use the same MC model by constructing PAS-QA and RC-QA datasets in the same QA form.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "QA Dataset Construction", "text": "We construct PAS-QA and RC-QA datasets in the driving domain. Both the QA datasets consist of triplets of a document, a question and its answer as in existing RC-QA datasets. We employ crowdsourcing to create large-scale datasets in a short time. Figure 1 and Figure 2 show examples of our PAS-QA and RC-QA datasets.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "PAS-QA Dataset", "text": "We construct a PAS-QA dataset in which a question asks an omitted argument for a predicate. We  focus on the ga case (nominative), the wo case (accusative), and the ni case (dative), which are targeted in the Japanese PAS analysis literature (Shibata et al., 2016;Shibata and Kurohashi, 2018;Kurita et al., 2018;Ouchi et al., 2017).\nAs a source corpus, we use blog articles included in the Driving Experience Corpus (Iwai et al., 2019). We first detect a predicate that has an omitted argument of either of the target three cases by applying the existing PAS analyzer KNP 1 to the corpus. KNP tends to overgenerate such predicates, but most erroneous ones are filtered out by the following crowdsourcing step. We extract the sentence that contains the predicate and preceding three sentences as a document. Then, we automatically generate a question using the following template for nominative.\n•  \"author,\" \"other,\" and \"not sure.\" The details of this procedure are described in the appendix. We generated questions from 2,146 blog articles. We asked five crowdworkers per question using Yahoo! crowdsourcing 2 . We adopted triplets with three or more votes if they are not \"not sure.\" For accusative and dative PAS-QA questions, we adopted triplets if they are \"other.\" In this case, there is not any antecedent of a zero pronoun in a document, and the answer is \"NULL.\" For nominative PAS-QA questions, we did not adopt triplets if they are \"other\" because a nominative always exists as a noun in a document or \"author.\" In addition, because \"author\" is not explicitly expressed in the document, we add a sentence \" \" (The author wrote the following document.) to the beginning of the document to deal with \"author\" in MC models. We record the answers as spans in a document or NULL.\nWe randomly extracted 100 questions for each case from the PAS-QA dataset and judged whether we can answer them. As a result, 97% nominative, 87% accusative and 68% dative questions were answerable. For accusative and dative, we checked all the questions and chose answerable ones. Finally, we created 12,468 nominative, 3,151 accusative and 1,069 dative triplets including 476 accusative and 126 dative questions whose answers are NULL. It took approximately 32 hours and approximately 210,000 JPY to create this dataset.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "RC-QA Dataset", "text": "We construct a driving-domain RC-QA dataset in the same way as SQuAD 1.1. We extract a document from the Driving Experience Corpus and ask three crowdworkers to write questions and their answers about the document. After that, we ask another five crowdworkers to answer a question to validate its answerability and adopt questions with three or more same answers.   We randomly extracted 200 questions from the RC-QA dataset and judged the question types. The result is shown in Table 2. A question was classified according to whether it is a question asking for any argument of nominative, accusative or dative, and if applicable, whether it is an omission or not. As shown in Table 2, the RC-QA dataset contains nearly 40% of questions asking arguments of nominative, accusative and dative, and a few questions asking for omitted arguments, which are similar to the PAS-QA dataset. There are various other questions asking for arguments other than nominative, accusative and dative, and questions using why and how.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "PAS Analysis Based on a Machine Comprehension Model", "text": "We  ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Experiments", "text": "We conduct PAS analysis experiments of our MCsingle/merged/stepwise methods using the PAS-QA and RC-QA datasets. We also compare our methods with the neural network-based PAS analysis model (Shibata and Kurohashi, 2018) (hereafter, NN-PAS), which achieved the state-of-theart accuracy on Japanese PAS analysis.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Experimental Settings", "text": "We adopt BERT (Devlin et al., 2019) as an MC model. We split the triplets in the PAS-QA dataset as shown in Table 4. All sentences in these datasets are preprocessed using the Japanese morphological analyzer, JUMAN++ 3 . We trained a Japanese pre-trained BERT model using Japanese Wikipedia, which consists of approximately 18 million sentences. The input sentences were segmented into words by JUMAN++, and words were broken into subwords by applying BPE (Sennrich et al., 2016). The parameters of BERT are the same as English BERT BASE . The number of epochs for the pre-training was 30.\nThe state-of-the-art baseline PAS analyzer, NN-PAS, was trained using the existing PAS dataset, KWDLC 4 (Kyoto University Web Document Leads Corpus), as described in Shibata and Kurohashi (2018). We also trained an NN-PAS model using the PAS-QA dataset in addition to KWDLC (hereafter, NN-PAS ′ ). For this training, the PAS-QA dataset was converted to the same format as KWDLC, where questions are deleted, and only answers are used.\nThe PAS-QA test data is used to compare the baseline methods with the proposed methods. As  an evaluation measure, EM (Exact Match) is used for all the MC models. EM is defined as (the number of questions in which the system answer matches the gold answer in the dataset) / (the number of questions in the entire dataset). For each experimental condition, training and testing were conducted five times, and the average scores were calculated.  3 and 4, only the outputs of MC-stepwise were correct. We found some cases that MC-stepwise successfully captured knowledge in the driving domain. In the example shown in Figure 4, the correspondence between \" \" (climb up the slope) and \" \" (going up the slope) can be recognized. MC-merged's answer \" \" (the hill road), which has a coreference relation with \"", "n_publication_ref": 3, "n_figure_ref": 2}, {"heading": "Results and Discussion", "text": "\" (the slope), looked correct although \" \" (the slope) was the only answer from crowdsourcing. Supplying multiple answers considering coreference relations is our future work. From these results, we think that it is important to use an RC-QA dataset to acquire domain knowledge, and suggest that it is better to construct both PAS-QA and RC-QA datasets to develop a PAS analyzer for a new  domain.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Conclusion", "text": "We constructed driving-domain PAS-QA and RC-QA datasets using crowdsourcing 5 . We also proposed an MC-based PAS analysis method. In particular, the stepwise training method based on BERT was the most effective, which outperformed the previous state-of-the-art NN-PAS model. In the future, we will pre-train an MC model based on datasets other than the RC-QA dataset to acquire domain knowledge.\nA Details of PAS-QA Dataset Construction\nWe construct the PAS-QA dataset asking for omitted nominative arguments using the following procedure:\n1. We extract four consecutive sentences that satisfy the following conditions from the Driving Experience Corpus constructed by Iwai et al. (2019).\n• The Driving Experience extracting CRF tool (Iwai et al., 2018) judges that three or more sentences out of four sentences are driving experience. • Each sentence contains at least one PAS.\n• The PAS analyzer, KNP, judges that there is a PAS whose nominative argument is omitted in the fourth sentence. • Sentences include at least one \"Driving Characteristic Word\" (Iwai et al., 2019). 2. We automatically make crowdsourcing tasks using an extracted document and a PAS whose nominative argument is omitted (See Figure 5 and Figure 6). Each task consists of a document, a question and answer choices. Answer choices consist of nouns extracted from the document and special symbols, \"author,\" \"other,\" and \"not sure.\" For nominative PAS-QA questions, the special symbol \"author\" can often be an answer, but it is not explicitly expressed in the document. So we add it to the choices. We add \"other\" so that it can be selected when there is an appropriate answer besides the choices. We add \"not sure\" so that workers can select it if they cannot find an answer. We add more explanations to crowdsourcing answer screen (See Figure 5 and Figure 6). 3. Using crowdsourcing, we ask five crowdworkers per question to select one or more appropriate answers from the choices. We asked five crowdworkers per question using Yahoo! crowdsourcing. We adopted triplets with three or more votes if they are not \"not sure.\" If they are \"other,\" we handled them as described in the main paper. We finally record the answers as spans in a document or NULL.  ", "n_publication_ref": 3, "n_figure_ref": 4}], "references": [{"title": "BERT: pre-training of deep bidirectional transformers for language understanding", "journal": "", "year": "2019", "authors": "Jacob Devlin; Ming-Wei Chang; Kenton Lee; Kristina Toutanova"}, {"title": "Large-scale QA-SRL parsing", "journal": "", "year": "2018", "authors": "Nicholas Fitzgerald; Julian Michael; Luheng He; Luke Zettlemoyer"}, {"title": "Syntax for semantic role labeling, to be, or not to be", "journal": "", "year": "2018", "authors": "Shexia He; Zuchao Li; Hai Zhao; Hongxiao Bai"}, {"title": "Development of driving-related dictionary that includes psychological expressions", "journal": "", "year": "2019", "authors": "Ritsuko Iwai; Takatsune Kumada; Norio Takahashi; Daisuke Kawahara; Sadao Kurohashi"}, {"title": "Construction of a Japanese relevancetagged corpus", "journal": "", "year": "2002", "authors": "Daisuke Kawahara; Sadao Kurohashi; Kôiti Hasida"}, {"title": "Neural adversarial training for semisupervised Japanese predicate-argument structure analysis", "journal": "", "year": "2018", "authors": "Shuhei Kurita; Daisuke Kawahara; Sadao Kurohashi"}, {"title": "Crowdsourcing question-answer meaning representations", "journal": "", "year": "2018", "authors": "Julian Michael; Gabriel Stanovsky; Luheng He; Ido Dagan; Luke Zettlemoyer"}, {"title": "Can a suit of armor conduct electricity? A new dataset for open book question answering", "journal": "", "year": "2018", "authors": "Todor Mihaylov; Peter Clark; Tushar Khot; Ashish Sabharwal"}, {"title": "Neural modeling of multi-predicate interactions for Japanese predicate argument structure analysis", "journal": "", "year": "2017", "authors": "Hiroki Ouchi; Hiroyuki Shindo; Yuji Matsumoto"}, {"title": "A span selection model for semantic role labeling", "journal": "", "year": "2018", "authors": "Hiroki Ouchi; Hiroyuki Shindo; Yuji Matsumoto"}, {"title": "emrQA: A large corpus for question answering on electronic medical records", "journal": "", "year": "2018", "authors": "Anusri Pampari; Preethi Raghavan; Jennifer J Liang; Jian Peng"}, {"title": "Mac-Net: Transferring knowledge from machine comprehension to Sequence-to-Sequence models", "journal": "", "year": "2018", "authors": "Yazheng Boyuan Pan; Hao Yang; Zhou Li; Yueting Zhao; Deng Zhuang; Xiaofei Cai;  He"}, {"title": "Know what you don't know: Unanswerable questions for SQuAD", "journal": "", "year": "2018", "authors": "Pranav Rajpurkar; Robin Jia; Percy Liang"}, {"title": "SQuAD: 100, 000+ questions for machine comprehension of text", "journal": "", "year": "2016", "authors": "Pranav Rajpurkar; Jian Zhang; Konstantin Lopyrev; Percy Liang"}, {"title": "Neural machine translation of rare words with subword units", "journal": "", "year": "2016", "authors": "Rico Sennrich; Barry Haddow; Alexandra Birch"}, {"title": "Neural network-based model for Japanese predicate argument structure analysis", "journal": "", "year": "2016", "authors": "Tomohide Shibata; Daisuke Kawahara; Sadao Kurohashi"}, {"title": "Entitycentric joint modeling of Japanese coreference resolution and predicate argument structure analysis", "journal": "", "year": "2018", "authors": "Tomohide Shibata; Sadao Kurohashi"}, {"title": "Linguistically-informed self-attention for semantic role labeling", "journal": "", "year": "2018", "authors": "Emma Strubell; Patrick Verga; Daniel Andor; David Weiss; Andrew Mccallum"}, {"title": "CliCR: a dataset of clinical case reports for machine reading comprehension", "journal": "", "year": "2018", "authors": "Simon Suster; Walter Daelemans"}, {"title": "Deep semantic role labeling with self-attention", "journal": "", "year": "2018", "authors": "Zhixing Tan; Mingxuan Wang; Jun Xie; Yidong Chen; Xiaodong Shi"}, {"title": "NewsQA: A machine comprehension dataset", "journal": "", "year": "2017", "authors": "Adam Trischler; Tong Wang; Xingdi Yuan; Justin Harris; Alessandro Sordoni; Philip Bachman; Kaheer Suleman"}, {"title": "Crowdsourcing multiple choice science questions", "journal": "", "year": "2017", "authors": "Johannes Welbl; Nelson F Liu; Matt Gardner"}, {"title": "HotpotQA: A dataset for diverse, explainable multi-hop question answering", "journal": "", "year": "2018", "authors": "Zhilin Yang; Peng Qi; Saizheng Zhang; Yoshua Bengio; William W Cohen; Ruslan Salakhutdinov; Christopher D Manning"}], "figures": [{"figure_label": "2", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :2Figure 2: An example of RC-QA dataset.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 3 :3Figure 3: An example that is correctly answered by MC-stepwise.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 5 :5Figure 5: PAS-QA dataset answer screen.", "figure_data": ""}, {"figure_label": "6", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 6 :6Figure 6: PAS-QA dataset answer screen (English translation version).", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "All the question templates of PAS-QA datasets are shown in Table1. We ask crowdworkers to choose one from answer choices, which consist of nouns extracted from the document and special symbols,", "figure_data": "CaseQuestionNominative(What is the subject of [predicate]?)Accusative(What is the accusative of [predicate]? )Dative(What is the dative of [predicate]? )(What is the subjectof [predicate]?)"}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Question templates of PAS-QA datasets.", "figure_data": ""}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Classification of questions in the RC-QA dataset.", "figure_data": "Training methodDatasetMC-singlePAS-QAJointMC-mergedPAS-QA + RC-QAtrainingMC-stepwiseRC-QA → PAS-QA"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "Three training methods for PAS analysis.", "figure_data": "As a result, we obtained 20,007 RC-QA tripletsfrom 5,146 blog articles. It took approximately60 hours and approximately 180,000 JPY to createthis dataset."}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "QA dataset as MC-single. We also propose two joint training methods that use both the PAS-QA and RC-QA datasets: MCmerged and MC-stepwise, as described in Table 3. The purpose of these joint training methods is to verify whether domain knowledge can be learned from the RC-QA dataset and whether it is", "figure_data": "analyze PAS based on the MC model on our constructed PAS-QA dataset. Each question in the PAS-QA dataset asks an omitted argument and has an answer that is expressed as a span in the given document or NULL. Because the PAS-QA dataset has the same structure as existing MC datasets in-cluding NULL, such as SQuAD 2.0, we can em-ploy an existing state-of-the-art MC model that an-swers a span in the document or NULL. We refer to the method of MC training based only on the PAS-Train Development Test Nominative 11,359 544 565 Accusative 2,756 199 196 Dative 967 50 52"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Split of the PAS-QA dataset.", "figure_data": "effective in improving the accuracy of PAS anal-ysis. In MC-merged, the PAS-QA and RC-QAdatasets are just merged and used for training. InMC-stepwise, the RC-QA dataset is used for pre-training, and this pre-trained model is fine-tunedusing the PAS-QA dataset."}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_10", "figure_caption": "PAS-QA test results of MC models and NN-PAS models. \"PAS\" and \"RC\" denote the use of the PAS-QA and RC-QA datasets, respectively. \"NOM\", \"ACC\" and \"DAT\" denote the EM scores of nominative, accusative and dative, respectively.", "figure_data": ""}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "", "figure_data": "lists evalution results of the NN-PAS mod-els and the MC-single/merged/stepwise models.First, NN-PAS ′ significantly outperformed NN-PAS, and thus the construction of the domain-specific PAS-QA dataset was effective in do-main adaptation of the NN-PAS model. Further-more, our proposed MC-* models outperfomedNN-PAS ′ . For the joint training models, MC-stepwise was better than MC-single for the ac-cusative and dative cases. MC-merged was infe-rior to MC-stepwise.We compared the results of MC-single and MC-stepwise. In examples shown in Figures"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_12", "figure_caption": "KHQ ZH UHWXUQ WKLV FDU ZH KDYH WR ILOO XS ZLWK JDVROLQH :H UDQ D ORW VR ZH UDQ RXW RI LW| ଭ‫َؚ‬ᅫ৬૮ःऊै௳मॽগ‫ॺش‬ছঝदौअछُ 7KH SDVVHQJHU VDLG n%HFDXVH ,W LV D ZDVWH WR FRQVXPH JDVROLQH OHWV UXQ GRZQKLOO ZLWK WKH JHDU LQ QHXWUDO| 皆それは良いと、賛同して⻑い坂をニュートラルで下り始 めました、直線の⻑い坂道でした。 (YHU\\RQH DJUHHG WKDW LW ZDV JRRG LGHD DQG VWDUWHG WR JR GRZQ D ORQJ GRZQKLOO ZKLFK ZDV VWUDLJKW ・・・と彼は下りにガソリンは要らないと、エンジンを切 ॉჶ॑௷ःथपِ⾒せましたّ‫؛‬ +H VDLG WKDW ZH GLG QRW QHHG JDVROLQH WR JR GRZQ WXUQHG RII WKH HQJLQH XQORFNHG WKH NH\\ DQG nVKRZHG| LW", "figure_data": "‫'؞‬RFXPHQW︓彼、「⾞を返す時ガソリンを満タンにするのか、だいぶढञऊैऩऎऩढञऩऀُ+H VDLG n:WR HYHU\\RQH‫4؞‬XHVWLRQ︓‫⾒ِ॑سس‬せましたّ‫ؚ‬の〇〇に⼊るものは何か︖:KDW LV WKH DFFXVDWLYH RI nVKRZHG|\"‫$؞‬QVZHU&RUUHFW DQVZHUჶ WKH NH\\0&VLQJOH︓ ௳ GRZQKLOO0&PHUJHG⾞ WKLV FDU0&VWHSZLVHჶ WKH NH\\"}], "doi": ""}