{"authors": "Ari Graciela; Ivan Davy; Anne-Lyse Karen; Graciela Gonzalez-Hernandez; Ari Z Klein; Davy Weissenbacher; Karen O'connor; Anne-Lyse Minard; Robert Leaman", "pub_date": "", "title": "Organizing and Program Committees Organizing Committee", "abstract": "In its fifth iteration, #SMM4H 2020 continues to serve as a venue for bringing together researchers interested in addressing the significant opportunities and challenges of utilizing the vast amount of data on social media for health informatics. For #SMM4H 2020, we accepted 5 workshop papers (acceptance rate of 56%) and 26 shared task system description papers. Each submission was peer-reviewed by two reviewers. The accepted workshop papers span a range of social media data-Twitter, Facebook, Reddit, and online health forums-and health domains, including diabetes, depression, COVID-19, medical misinformation, and adverse drug reactions. Cornelius et al. present an online platform that aggregates and visualizes methods for extracting information related to COVID-19 on Twitter. Dirkson et al. explore modeling conversational features of posts, in addition to the posts themselves, for detecting adverse drug reactions on Facebook, and medical misinformation. Romberg et al. present an annotated, Germanlanguage corpus for extracting information needs expressed online by patients with diabetes. Moßburger et al. use various text mining techniques to compare features of depression forums on Reddit and a curated, moderated site. Finally, Owen et al. present an annotated, English-language corpus for detecting depression and anxiety on Twitter. The #SMM4H 2020 shared tasks sought to advance the use of Twitter data (tweets) for pharmacovigilance, toxicovigilance, and epidemiology of birth defects. In addition to re-reruns of three tasks, #SMM4H 2020 included new tasks for detecting adverse drug reactions in French and Russian tweets, characterizing chatter related to prescription medication abuse, and detecting self reports of birth defect pregnancy outcomes. The five tasks required methods for binary classification, multiclass classification, and named entity recognition (NER). With 29 teams and a total of 130 system submissions, participation in the #SMM4H shared tasks continues to grow. Among the 26 shared task system description papers that were accepted, 6 teams were invited to present their system orally. The organizing committee of #SMM4H 2020 would like to thank the program committee, the additional reviewers of system description papers, the organizers of COLING 2020 (especially the workshop cochairs), the annotators of the shared task data, and, of course, everyone who submitted a paper or participated in the shared tasks. #SMM4H 2020 would not have been possible without all of them.", "sections": [], "references": [], "figures": [], "doi": ""}