{"authors": "Regina Barzilay; Min-Yen Kan; Hal Daumé; Michael White; Joel Tetreault; Emily Bender; Pushpak Bhattacharyya; Dragomir Radev; Graeme Hirst; Yejin Choi; Priscilla Rasmussen; Chris Callison-Burch; Anoop Sarkar; Wei Xu; Maja Popović; Wei Lu; Margaret Mitchell; Heng Ji; Spandana Gella; Cecilia Ovesdotter Alm; Charley Chan; Christian Federmann; Maryam Siahbani; Nitin Madnani; Mourad Abbas; Omri Abend; Amjad Abu-Jbara; Gilles Adda; Heike Adel; Ster- Gos Afantenos; Apoorv Agarwal; Eneko Agirre; Željko Agić; Alan Akbik; Ahmet Aker; Mo- Hammed Alam; Hanan Aldarmaki; Enrique Alfonseca; Afra Alishahi; Laura Alonso Alemany; David Alvarez-Melis; Maxime Amblard; Maryam Aminian; Silvio Amir; Waleed Ammar; Daniel Andrade; Jacob Andreas; Nicholas Andrews; Ion Androutsopoulos; Galia Angelova; Jean-Yves Antoine; Emilia Apostolova; Jun Araki; Yuki Arase; Lora Aroyo; Philip Arthur; Yoav Artzi; Masayuki Asahara; Giuseppe Attardi; Aiti Aw; Ahmed Hassan Awadallah; Wilker Aziz; Collin Baker; Alexandra Balahur; Niranjan Balasubramanian; Timothy Baldwin; Tyler Baldwin; Miguel Ballesteros; David Bamman; Rafael E Banchs; Carmen Banea; Ritwik Banerjee; Srini- Vas Bangalore; Libby Barak; Alistair Baron; Marco Baroni; Alberto Barrón-Cedeño; Roberto Basili; David Batista; Daniel Bauer; Timo Baumann; Daniel Beck; Srikanta Bedathur; Beata Beigman Klebanov; Kedar Bellare; Charley Beller; Islam Beltagy; Anja Belz; Yassine Bena- Jiba; Fabrício Benevenuto; Luciana Benotti; Jonathan Berant; Taylor Berg-Kirkpatrick; Sabine Bergler; Robert Berwick; Laurent Besacier; Steven Bethard; Archna Bhatia; Chris Biemann; Joachim Bingel; Alexandra Birch; Arianna Bisazza; Yonatan Bisk; Prakhar Biyani; Johannes Bjerva; Anders Björkelund; Philippe Blache; Frédéric Blain; Eduardo Blanco; Nate Blaylock; Bernd Bohnet; Gemma Boleda; Danushka Bollegala; Claire Bonial; Francesca Bonin; Kalina Bontcheva; Benjamin Börschinger; Johan Bos; Elizabeth Boschee; Florian Boudin; Fethi Bougares; Samuel Bowman; Johan Boye; Kristy Boyer; Cem Bozsahin; David Bracewell; S R K Branavan; Pavel Braslavski; Adrian Brasoveanu; Ted Briscoe; Chris Brockett; Julian Brooke; Elia Bruni; William Bryce; Marco Büchler; Christian Buck; Paul Buitelaar; Harry Bunt; Manuel Burghardt; David Burkett; Hendrik Buschmeier", "pub_date": "", "title": "Preface: General Chair", "abstract": "Welcome to ACL 2017 in Vancouver, Canada! This is the 55th annual meeting of the Association for Computational Linguistics. A tremendous amount of knowledge has been presented at more than half a century's worth of our conferences. Hopefully, some of it is still relevant now that deep learning has solved language. We are anticipating one of the largest ACL conferences ever. We had a record number of papers submitted to the conference, and a record number of industry partners joining us as sponsors of the conference. We are on track to be one of the best attended ACL conferences to date. I hope that this year's conference is intellectually stimulating and that you take home many new ideas and techniques that will help extend your own research.", "sections": [{"heading": "", "text": "In addition, oral presentations were shortened to fourteen (twelve) minutes for long (short) papers, plus time for questions. While this places a greater demand on speakers to be concise, we believe it is worth the effort, allowing far more work to be presented orally. We also took advantage of the many halls available and expanded the number of parallel talks to five during most of the conference sessions.\nIn keeping with changes introduced in the ACL community from last year, we continued the practice of recognizing outstanding papers at ACL. The 22 outstanding papers (15 long, 7 short, 1.6% of submissions) represent a broad spectrum of exciting contributions and have been specially placed on the final day of the main conference where the program is focused into two parallel sessions of these outstanding contributions. From these, a best paper and a best short paper those will be announced in the awards session on Wednesday afternoon.\nChris has already mentioned our introduction of the chairs' blog 2 , where we strove to make the selection process of the internal workings of the scientific committee more transparent. We have publicly documented our calls for area chairs, reviewers and accepted papers selection process. Via the blog, we communicated several innovations in the conference organization workflow, of which we would call attention to two key ones here.\nIn the review process, we pioneered the use of the Toronto Paper Matching System, a topic model based approach to the assignment of reviewers to papers. We hope this decision will spur other program chairs to adopt the system, as increased coverage will better the reviewer/submission matching process, ultimately leading to a higher quality program.\nFor posterity, we also introduced the usage of hyperlinks in the bibliography reference sections of papers, 1 These numbers exclude papers that were not reviewed due to formatting, anonymity, or double submission violations or that were withdrawn prior to review, which was unfortunately a substantial number.\n2 https://chairs-blog.acl2017.org/ viii and have worked with the ACL Anthology to ensure that digital object identifiers (DOIs) appear in the footer of each paper. These steps will help broaden the long-term impact of the work that our community has on the scientific world at large.\nThere are many individuals we wish to thank for their contributions to ACL 2017, some multiple times:\n• The 61 area chairs who volunteered for our extra duty. They recruited reviewers, led discussions on each paper, replied to authors' direct comments to them and carefully assessed each submission.\nTheir input was instrumental in guiding the final decisions on papers and selecting the outstanding papers.\n• Our full program committee of BUG hard-working individuals who reviewed the conference's 1,318 submissions (including secondary reviewers).\n• TACL editors-in-chief Mark Johnson, Lillian Lee, and Kristina Toutanova, for coordinating with us on TACL presentations at ACL.\n• Noah Smith and Katrin Erk, program co-chairs of ACL 2016 and Ani Nenkova and Owen Rambow, program co-chairs of NAACL 2016, who we consulted several times on short order for help and advice.\n• Wei Lu and Sameer Singh, our well-organized publication chairs, with direction and oversight from publication chair mentor Meg Mitchell. Also, Christian Federmann who helped with the local handbook.\n• The responsive team at Softconf led by Rich Gerber, who worked quickly to resolve problems and who strove to integrate the use of the Toronto Paper Matching System (TPMS) for our use.\n• Priscilla Rasmussen and Anoop Sarkar and the local organization team, especially webmaster Nitin Madnani.\n• Christopher Calliston-Burch, our general chair, who kept us coordinated with the rest of the ACL 2017 team and helped us free our time to concentrate on the key duty of organizing the scientific program.\n• Key-Sun Choi, Jing Jiang, Graham Neubig, Emily Pitler, and Bonnie Webber who carefully reviewed papers under consideration for best paper recognition.\n• Our senior correspondents for the blog, who contributed guest posts and advice for writing and reviewing: Waleed Ammar, Yoav Artzi, Tim Baldwin, Marco Baroni, Claire Cardie, Xavier Carreras, Hal Daumé, Kevin Duh, Chris Dyer, Marti Hearst, Mirella Lapata, Emily M. Bender, Aurélien Max, Kathy McKeown, Ray Mooney, Ani Nenkova, Joakim Nivre, Philip Resnik, and Joel Tetreault. Without them, the participation of the community through the productive comments, and without you the readership, our blog for disseminating information about the decision processes would not have been possible and a success. With twin upward trends in the interest in computational linguistics and natural language processing and the size of our annual meeting, ACL has begun the practice of recognizing outstanding papers that represent a select cross-section of the entire field, as nominated by reviewers and vetted by the area chairs and program co-chairs. These papers have been centrally located in the program, on the last day of our meeting, in a more focused two parallel tracks format.\nThis year, we have nominated 15 long papers and 7 short papers, representing 1.8% of all submissions and approximately 5% of the accepted ACL program. Congratulations, authors! (in alphabetical order by first author surname)\nLong Papers\n• Jan Buys and Phil Blunsom. Robust Incremental Neural Semantic Graph Parsing.\n• Xinchi Chen, Zhan Shi, Xipeng Qiu and Xuanjing Huang. Adversarial Multi-Criteria Learning for Chinese Word Segmentation.\n• ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Abstract", "text": "The computational linguistics and natural language processing community is experiencing an episode of deep fascination with representation learning. Like many other presenters at this conference, I will describe new ways to use representation learning in models of natural language.\nNoting that a data-driven model always assumes a theory (not necessarily a good one), I will argue for the benefits of language-appropriate inductive bias for representation-learning-infused models of language. Such bias often comes in the form of assumptions baked into a model, constraints on an inference algorithm, or linguistic analysis applied to data. Indeed, many decades of research in linguistics (including computational linguistics) put our community in a strong position to identify promising inductive biases. The new models, in turn, may allow us to explore previously unavailable forms of bias, and to produce findings of interest to linguistics. I will focus on new models of documents and of sentential semantic structures, and I will emphasize abstract, reusable components and their assumptions rather than applications. In this talk I will argue that in order to render electronic data more accessible to individuals and computers alike, new types of translation models need to be developed. I will focus on three examples, text simplification, source code generation, and movie summarization. I will illustrate how recent advances in deep learning can be extended in order to induce general representations for different modalities and learn how to translate between these and natural language.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Biography", "text": "Mirella Lapata is professor of natural language processing in the School of Informatics at the University of Edinburgh. Her research focuses on getting computers to understand, reason with, and generate. She is as an associate editor of the Journal of Artificial Intelligence Research and has served on the editorial boards of Transactions of the ACL and Computational Linguistics. She was the first recipient of the Karen Sparck Jones award of the British Computer Society, recognizing key contributions to NLP and information retrieval. She received two EMNLP best paper awards and currently holds a prestigious Consolidator Grant from the European Research Council.\nxxiii ", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "", "journal": "John Conroy * , Matthieu Constant", "year": "", "authors": "G C José; Deng Souza; Jose Cai; Berkant Camacho-Collados; Erik Barla Cambazoglu; Burcu Cambria; Marie Can; Hailong Candito; Kris Cao; * Cao; Yuan Cao; Ziqiang Cao; Cornelia Caragea; Jesus Cardeńosa; Giuseppe Carenini; Marine Carpuat; Xavier Carreras; John Carroll; Paula Carvalho; Francisco Casacuberta; Helena Caseli; Tommaso Caselli; * ; Taylor Cassidy; Vittorio Castelli; Giuseppe Castellucci; Asli Celikyilmaz; * ; Daniel Cer; Özlem Çetinoglu; Mauro Cettolo; Arun Chaganty; Joyce Chai; Soumen Chakrabarti; Yllias Gaël De Chalendar; Nathanael Chali; Jane Chambers; Muthu Chandlee; Angel Kumar Chandrasekaran; * Chang; Baobao Chang; Kai-Wei Chang; Ming-Wei Chang; Snigdha Chaturvedi; Wanxiang Che; Ciprian Chelba"}, {"title": "Dayne Freitag, Lea Frermann, Annemarie Friedrich, Piotr W. Fuglewicz, Akinori Fujino, Fumiyo Fukumoto", "journal": "Abhijeet Gupta", "year": "", "authors": "Luis Fernando; D' Haro; Giovanni Da San; Walter Martino; Daniel Daelemans; Amitava Dahlmeier; Dipanjan Das; Rajarshi Das; Pradeep Das; Johannes Dasigi; Munmun De Daxenberger; Eric De Choudhury; La Clergerie; Thierry Declerck; Luciano Del Corro; Louise Deléger; Felice Dell'orletta; Claudio Delli Bovi; Li Deng; Lingjia Deng; Pascal Denis; Michael Denkowski; Tejaswini Deoskar; Leon Derczynski; Nina Dethlefs; Ann Devitt; Jacob Devlin; Lipika Dey; Barbara Di Eugenio; Giuseppe Di Fabbrizio; Gaël Dias; Fernando Diaz; Georgiana Dinu; P Liviu; Stefanie Dinu; Dmitriy Dipper; Simon Dligach; Ellen Dobnik; Jesse Dodge; Daxiang Dodge; Li Dong; Doug Dong; Gabriel Downey; A Doyle; Eduard Seza Dogruöz; Mark Dragut; * Dras; Markus Dreyer; Lan Du; Nan Duan; Xiangyu Duan; Kevin Duh; * ; Long Duong; Emmanuel Dupoux; Nadir Durrani; Greg Durrett; Ondřej Dušek; * ; Marc Dymetman Judith Eckle-Kohler; Steffen Eger; * ; Markus Egg; Koji Eguchi; Patrick Ehlen; Maud Ehrmann; * ; Vladimir Eidelman; Andreas Eisele; Jacob Eisenstein; * ; Heba Elfardy; Michael Elhadad; * ; Desmond Elliott; * ; Micha Elsner; Nikos Engonopoulos; Messina Enza; Katrin Erk; Arash Eshghi; Miquel Esplà-Gomis James Fan; Federico Fancellu; Licheng Fang; Benamara Farah; Stefano Faralli; Richárd Farkas; Afsaneh Fazly; Geli Fei; Anna Feldman; Minwei Feng; Yansong Feng; Olivier Ferret; Oliver Ferschke; Simone Filice; Denis Filimonov; Katja Filippova; * ; Andrew Finch; Nicolas Fiorini; Orhan Firat; * ; Radu Florian; Evandro Fonseca; Markus Forsberg; Eric Fosler-Lussier; George Foster; James Foulds; * ; Marc Franco-Salvador; Alexander Fraser ; Jianfeng; Claire Gao; * Gardent; Matt Gardner; Guillermo Garrido; Justin Garten; Milica Gasic; Eric Gaussier; Tao Ge; Georgi Georgiev; Kallirroi Georgila ; De Gispert; Dimitra Gkatzia; * ; Goran Glavaš; Amir Globerson; Yoav Goldberg; Dan Goldwasser; Carlos Gómez-Rodríguez; * ; Graciela Gonzalez; Edgar Gonzàlez Pellicer; Kyle Gorman; Matthew R Gormley; Isao Goto; Cyril Goutte; Amit Goyal; Kartik Goyal; Pawan Goyal; Joao Graca; Yvette Graham; Roger Granada; Stephan Greene; Jiatao Gu; Bruno Guillaume; Liane Guillou; Curry Guinn; Hongyu Guo; James Gung; Jiang Guo; Weiwei Guo; Yufan Guo; Yuhong Guo"}, {"title": "Aurélie Herbelot * , Ulf Hermjakob", "journal": "", "year": "", "authors": "Thanh-Le Ha; Christian Hadiwinoto; Gholamreza Haffari; Matthias Hagen; Udo Hahn; Jörg Hakenberg; Dilek Hakkani-Tur; Keith Hall; William L Hamilton; Michael Hammond; Xianpei Han; Sanda Harabagiu; Christian Hardmeier; Sadid A Kazi Saidul Hasan; Saša Hasan; Eva Hasan; Hany Hasler; Helen Hassan; Claudia Hastie; He Hauff; * He; Hua He; Luheng He; Shizhu He; Xiaodong He; Yulan He; Peter Heeman; Carmen Heger; Serge Heiden; Georg Heigold; Michael Heilman"}, {"title": "", "journal": "", "year": "", "authors": "Ignacio Iacobacci; Nancy Ide; Marco Idiart; Gonzalo Iglesias; Ryu Iida; Kenji Imamura; Diana Inkpen; Naoya Inoue; Hitoshi Isahara; Mohit Iyyer Tommi Jaakkola; Cassandra L Jacobs; Guillaume Jacquet; Evan Jaffe; Jagadeesh Jagarlamudi; Siddharth Jain; Aren Jansen; Sujay Kumar Jauhar; Laura Jehl; Minwoo Jeong; Yacine Jernite; Rahul Jha; Donghong Ji; Guoliang Ji; Sittichai Jiampojamarn; Hui Jiang"}, {"title": "Prasanth Kolachina, Varada Kolhatkar, Mamoru Komachi, Kazunori Komatani, Rik Koncel-Kedziorski, Fang Kong, Lingpeng Kong, Ioannis Konstas * , Selcuk Kopru, Valia Kordoni, Yannis Korkontzelos, Bhushan Kotnis", "journal": "", "year": "", "authors": "Besim Kabashi; Ákos Kádár; * Sylvain Kahane; Juliette Kahn; Herman Kamper; Jaap Kamps; Hiroshi Kanayama; Hung-Yu Kao; Justine Kao; Mladen Karan; Dimitri Kartsaklis; Arzoo Katiyar; David Kauchak; Daisuke Kawahara; Anna Kazantseva; Hideto Kazawa; Andrew Kehler; Simon Keizer; Frank Keller; Casey Kennington; M Mitesh; Douwe Khapra; Halil Kiela; * Kilicoglu; Jin-Dong Kim; Jooyeon Kim; Seokhwan Kim; Suin Kim; Yoon Kim; Young-Bum Kim; Irwin King; Brian Kingsbury; Svetlana Kiritchenko; Dietrich Klakow; Alexandre Klementiev; Sigrid Klerke; Roman Klinger ; Alexander; Mikhail Kotov; Martin Kozhevnikov; Julia Krallinger; * Kreutzer; Jayant Krishnamurthy; * ; Kriste Krstovski; Canasai Kruengkrai; Germán Kruszewski; Mark Kröll; Lun-Wei Ku; * ; Marco Kuhlmann; Jonas Kuhn; Roland Kuhn; Shankar Kumar; Jonathan K Kummerfeld; Sadao Kurohashi; Polina Kuznetsova; Tom Kwiatkowski"}, {"title": "", "journal": "", "year": "", "authors": "Igor Labutov; Wai Lam; Patrik Lambert; Man Lan; Ian Lane; Ni Lao; Mirella Lapata; Shalom Lappin; Romain Laroche; Kornel Laskowski; Jey Han Lau; Alon Lavie; Angeliki Lazaridou; Phong Le; * ; Joseph Le Roux; Robert Leaman; Kenton Lee; Lung-Hao Lee; Moontae Lee; Sungjin Lee; Yoong Keok Lee; Young-Suk Lee; Els Lefever; Tao Lei; Jochen L Leidner; Alessandro Lenci; Yves Lepage; * ; Johannes Leveling; Tomer Levinboim; Gina-Anne Levow; * ; Omer Levy; * ; Roger Levy; Dave Lewis; Mike Lewis; Binyang Li; Chen Li; Cheng-Te Li; Chenliang Li; Fangtao Li; Haizhou Li; Hang Li; Jiwei Li; Junhui Li; Junyi Jessy Li; Lishuang Li; Peifeng Li; Peng Li; Qi Li; Qing Li; Shaohua Li; Sheng Li; Shoushan Li; Xiaoli Li; Yanran Li; Yunyao Li; Zhenghua Li; Maria Liakata; * ; Kexin Liao; * ; Xiangwen Liao ; Hongfang; Jiangming Liu; Lemao Liu; Qian Liu; Qun Liu; Tie-Yan Liu; Ting Liu; Xiaobing Liu; Yang Liu; Nikola Liu; Chi-Kiu Ljubešić; Henning Lo; Varvara Lobin; Lucelene Logacheva; Adam Lopes; Oier Lopez; Aurelio Lopez De Lacalle; Annie Lopez-Lopez; Bin Louis; Yi Lu; Andy Luan; Michal Luecking; Xiaoqiang Lukasik;  Luo"}, {"title": "", "journal": "", "year": "", "authors": "Ji Ma; Qingsong Ma; Shuming Ma; Xuezhe Ma; Wolfgang Macherey; Nitin Madnani; Saad Mahamood; Cerstin Mahlow; Wolfgang Maier; Prodromos Malakasiotis; Andreas Maletti; Shervin Malmasi; Suresh Titus Von Der Malsburg; Gideon Manandhar; Diego Mann; Daniel Marcheggiani; David Marcu; Matthew Mareček; Benjamin Marge; Katja Marie;  Markert"}, {"title": "", "journal": "", "year": "", "authors": "Erwin Marneffe; Patricio Marsi;  Martinez-Barco; F T André; * Martins; Sebastian Martschat; Eugenio Héctor Martínez Alonso; * Martínez-Cámara; Fernando Martínez-Santiago; Yann Mathet; Shigeki Matsubara; Yuichiroh Matsubayashi; Yuji Matsumoto; Takuya Matsuzaki; Austin Matthews; Jonathan May; David Mcclosky; Tara Mcintosh; Kathy Mckeown; Michael Mctear; Yashar Mehdad; Sameep Mehta; Hongyuan Mei; * ; Yelena Mejova; Oren Melamud; Fandong Meng; Adam Meyers; Yishu Miao; Rada Mihalcea; Todor Mihaylov; Timothy Miller; Tristan Miller; * ; David Mimno; Bonan Min; Shachar Zhao-Yan Ming;  Mirkin"}, {"title": "", "journal": "", "year": "", "authors": "Masaaki Nagata; Ajay Nagesh; Vinita Nahar; Iftekhar Naim; Tetsuji Nakagawa; Mikio Nakano; Yukiko Nakano; Ndapandula Nakashole; Ramesh Nallapati; Courtney Napoles; Jason Naradowsky; Karthik Narasimhan; * ; Shashi Narayan; Alexis Nasr; Vivi Nastase; Borja Navarro; Roberto Navigli; Adeline Nazarenko; * ; Mark-Jan Nederhof; Arvind Neelakantan; Sapna Negi; Matteo Negri; Aida Nematzadeh; Guenter Neumann; Mariana Neves; Denis Newman-Griffis; Dominick Ng; Hwee Tou Ng; Jun-Ping Ng; Vincent Ng; Dong Nguyen; * ; Thien Huu Nguyen; T Truc-Vien; Viet-An Nguyen; Garrett Nguyen; Massimo Nicolai; Vlad Nicosia; * Niculae; Jian-Yun Nie; Jan Niehues; Luis Nieto Piña; * ; Ivelina Nikolova; Malvina Nissim; * ; Joakim Nivre; * ; Hiroshi Noji; Joel Gertjan Van Noord; O' Nothman Brendan; Timothy O Connor; Yusuke Donnell; Stephan Oda; Kemal Oepen; * Oflazer; Alice Oh; * ; Jong-Hoon Oh; Tomoko Ohta; Kiyonori Ohtake; Hidekazu Oiwa; Naoaki Okazaki; Manabu Okumura; G Hiroshi; Constantin Okuno; Vicente Orasan; Petya Ordonez; Mari Osenova; * Ostendorf; Myle Ott; Katja Ovchinnikova"}, {"title": "15 Unifying Text, Metadata, and User Network Representations with a Neural Network for Geolocation Prediction Yasuhide Miura, Motoki Taniguchi, Tomoki Taniguchi and Tomoko Ohkuma", "journal": "", "year": "", "authors": "Muntsa Padró; Alexis Valeria De Paiva; Martha Palmer; Alessio Palmer; Sinno Palmero Aprosio; * Jialin Pan; Xiaoman Pan; Denis Paperno; Ankur Parikh; Cecile Paris; Seong-Bae Park; Tommaso Pasini; Marco Passarotti; * ; Peyman Passban; Panupong Pasupat; Siddharth Patwardhan; Michael J Paul; * ; Adam Pauls; Ellie Pavlick; * ; Adam Pease; Pavel Pecina; Ted Pedersen; Nanyun Peng; Xiaochang Peng; Gerald Penn; Marco Pennacchiotti; Bryan Perozzi; Casper Petersen; Slav Petrov; Eva Pettersson; Anselmo Peñas; Hieu Pham; Nghia The Pham; Lawrence Phillips; Davide Picca; Karl Pichotta; Olivier Pietquin; Mohammad Taher Pilehvar; Yuval Pinter; Paul Piwek; Thierry Poibeau; Tamara Polajnar; Heather Pon-Barry; Simone Paolo Ponzetto; Andrei Popescu-Belis; Maja Popović; Fred Popowich; François Portet; * ; Matt Post; * ; Christopher Potts; Vinodkumar Prabhakaran; Daniel Preoţiuc-Pietro; Emily Prud'hommeaux; * ; Laurent Prévot; Jay Pujara; Matthew Purver; James Pustejovsky Juan Antonio Pérez-Ortiz; Ashequl Qadir; Peng Qi; Longhua Qian; Xian Qian; Lu Qin; Long Qiu; Xipeng Qiu; Lizhen Qu; Ariadna Quattoni; Chris Quirk * Alexandre Rademaker; Will Radford; Alessandro Raganato; Afshin Rahimi; * ; Altaf Rahman; Maya Ramanath; Rohan Ramanath; Arti Ramanathan; Gabriela Ramesh; Carlos Ramirez-De-La-Rosa; Anita Ramisch; Vivek Ramm;  Kumar Rangarajan; Ari Sridhar; Mohammad Rappoport; Pushpendre Sadegh Rasooli;  Rastogi; Sravana Anxvii Toine Raux; Ines Reddy; * Rehbein; Georg Rehm; Roi Reichart; Ehud Reiter; Zhaochun Ren; Corentin Ribeyre; Matthew Richardson; Martin Riedl; Jason Riesa; German Rigau; Ellen Riloff; * ; Laura Rimell; * ; Alan Ritter; Brian Roark; * ; Molly Roberts; Tim Rocktäschel; Oleg Rokhlenko; Salvatore Romeo; Andrew Rosenberg; Sara Rosenthal; * ; Paolo Rosso; Benjamin Roth; Michael Roth; Sascha Rothe; Masoud Rouhizadeh; Mickael Rouvier; Alla Rozovskaya; Josef Ruppenhofer; Delia Rusu; Attapol Rutherford Mrinmaya Sachan; Kugatsu Sadamitsu; Fatiha Sadat; Mehrnoosh Sadrzadeh; Markus Saers; Kenji Sagae; Horacio Saggion; Saurav Sahay; Magnus Sahlgren; Patrick Saint-Dizier; Hassan Sajjad; Sakriani Sakti; Mohammad Salameh; Bahar Salehi; Avneesh Saluja; Rajhans Samdani; Mark Sammons; Germán Sanchis-Trilles; Ryohei Sasano; Agata Savary; * ; Asad Sayeed; Carolina Scarton; Tatjana Scheffler; Christian Scheible; David Schlangen; Natalie Schluter; Allen Schmaltz; * ; Helmut Schmid; Alexandra Schofield; William Schuler; Sebastian Schuster; Lane Schwartz; Roy Schwartz; * ; Christof Schöch; Ó Diarmuid; Djamé Séaghdha; Abigail Seddah; Nina See; Satoshi Seemann; Mark Sekine; Minjoon Seligman; Burr Seo; Lei Settles; Kashif Sha; Rebecca Shah; Shiqi Sharp; Shuming Shen; Hiroyuki Shi; Koichi Shindo; Chaitanya Shinoda; Eyal Shivade; * Shnarch; Milad Shokouhi; Ekaterina Shutova; Advaith Siddharthan; Avirup Sil; Carina Silberer; Yanchuan Sim; Patrick Simianer; Kiril Simov; Kairit Sirts; Amy Siu; Gabriel Skantze ; Veselin; Carlo Stoyanov; Karl Strapparava; Kristina Stratos; * Striegnitz; Emma Strubell; Tomek Strzalkowski; Sara Stymne; Maik Stührenberg; Jinsong Su; Keh-Yih Su; Yu Su; L V Subramaniam; Katsuhito Sudoh; Ang Sun; Huan Sun; Le Sun; Weiwei Sun; Xu Sun; Simon Suster; Hisami Suzuki; Jun Suzuki; Yoshimi Suzuki; Swabha Swayamdipta; Stan Szpakowicz ; Feng; Hongyun Wang; Yuexing Bao;  Hao"}], "figures": [{"figure_label": "", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Abstract Syntax Networks for Code Generation and Semantic Parsing. Xinyu Hua and Lu Wang. Understanding and Detecting Diverse Supporting Arguments on Controversial Issues. Squashing Computational Linguistics Noah A. Smith Paul G. Allen School of Computer Science and Engineering, University of Washington", "figure_data": "Short Papers• • Jindřich Libovický and Jindřich Helcl. Attention Strategies for Multi-Source Sequence-to-Sequence Learning.• Bogdan Ludusan, Reiko Mazuka, Mathieu Bernard, Alejandrina Cristia and Emmanuel Dupoux. The Role of Prosody and Speech Register in Word Segmentation: A Computational ModellingPerspective.• Afshin Rahimi, Trevor Cohn and Timothy Baldwin. A Neural Model for User Geolocation and Lexical Dialectology.• Keisuke Sakaguchi, Matt Post and Benjamin Van Durme. Error-repair Dependency Parsing for Ungrammatical Texts.• Ines Rehbein and Josef Ruppenhofer. Detecting annotation noise in automatically labelled data.• Jiwei Tan, Xiaojun Wan and Jianguo Xiao. Abstractive Document Summarization with a Graph-Based Attentional Neural Model.xx"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "BiographyNoah Smith is an Associate Professor in the Paul G. Allen School of Computer Science and Engineering at the University of Washington. Previously, he was an Associate Professor in the School of Computer Science at Carnegie Mellon University. He received his Ph.D. in Computer Science from Johns Hopkins University and his B.S. in Computer Science and B.A. in Linguistics from the University of Maryland. His research spans many topics in natural language processing, machine learning, and computational social science. He has served on the editorial boards of CL, JAIR, and TACL, as the secretary-treasurer ofSIGDAT (2012SIGDAT ( -2015, and as program co-chair of ACL 2016. Alumni of his research group, Noah's ARK, are international leaders in NLP in academia and industry. Smith's work has been recognized with a UW Innovation award, a Finmeccanica career development chair at CMU, an NSF CAREER award, a Hertz Foundation graduate fellowship, numerous best paper nominations and awards, and coverage by NPR, BBC, CBC, the New York Times, the Washington Post, and Time.xxii Invited Talk: Translating from Multiple Modalities to Text and BackMirella LapataProfessor, School of Informatics, University of EdinburghAbstractRecent years have witnessed the development of a wide range of computational tools that process and generate natural language text. Many of these have become familiar to mainstream computer users in the from of web search, question answering, sentiment analysis, and notably machine translation. The accessibility of the web could be further enhanced with applications that not only translate between different languages (e.g., from English to French) but also within the same language, between different modalities, or different data formats. The web is rife with non-linguistic data (e.g., video, images, source code) that cannot be indexed or searched since most retrieval tools operate over textual data.", "figure_data": ""}, {"figure_label": "of", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Adversarial Multi-task Learning for Text Classification Pengfei Liu, Xipeng Qiu and Xuanjing Huang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Neural End-to-End Learning for Computational Argumentation Mining Steffen Eger, Johannes Daxenberger and Iryna Gurevych . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .", "figure_data": ""}], "doi": ""}