{"authors": "", "pub_date": "", "title": "", "abstract": "", "sections": [{"heading": "Introduction", "text": "Welcome to the inaugural Workshop on Knowledge Extraction and Integration for Deep Learning Architectures (DeeLIO)! The DeeLIO workshop aims to bring together the knowledge interpretation, extraction and integration lines of research in deep learning, and cover the area in between. We hope that the DeeLIO workshop will become a regular forum for the exchange of ideas and will contribute to foster collaboration within these research fields. This volume includes the 11 papers presented at the workshop. DeeLIO was co-located with the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP 2020) and was held on November 19, 2020 as an online workshop, following the exceptional \"new normal\" circumstances of 2020.\nFor the first edition of the workshop, we received 21 paper submissions. We accepted 11 papers (acceptance rate 52.4%) which were presented at the workshop. The accepted papers cover both thematic aspects of DeeLIO: the extraction of linguistic knowledge from deep neural models and the integration of knowledge from external resources, for different languages and applications. In addition to the regular workshop papers, the first edition of DeeLIO also included presentations of several papers from the EMNLP companion volume 'Findings of EMNLP' which were thematically relevant to the workshop goals. There was no distinction between oral and poster presentations this year, and all presentations involved pre-recorded talks accompanied with individual live Q&A sessions.\nWe take this opportunity to thank the DeeLIO program committee for their thorough reviews. We also thank the authors who presented their work at DeeLIO, and the workshop participants for the valuable feedback and discussions. Finally, we are honored to have two excellent invited talks from our invited speakers Ellie Pavlick and Eduard Hovy.  ", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [], "figures": [{"figure_label": "", "figure_type": "", "figure_id": "fig_0", "figure_caption": "TheMikel Artetxe (Facebook AI) Yonatan Belinkov (Harvard University) Gemma Boleda (University Pompeu Fabra) Jose Camacho-Collados (University of Cardiff) Grzegorz Chrupała (Tilburg University) Luis Espinosa-Anke (University of Cardiff) John William Hewitt (Stanford University) Goran Glavaš (University of Mannheim) Aishwarya Kamath (New York University) Gorka Labaka (University of the Basque Country) Olga Majewska (University of Cambridge) Prodromos Malakasiotis (Athens University of Economics and Business) Tal Linzen (Johns Hopkins University) Roberto Navigli (Sapienza University) Kim-Anh Nguyen (University of Stuttgart) Sebastian Padó (University of Stuttgart) Valeria de Paiva (Samsung Research) Jonas Pfeiffer (TU Darmstadt) Edoardo Maria Ponti (University of Cambridge) Simone Paolo Ponzetto (University of Mannheim) Alessandro Raganato (University of Helsinki) Marek Rei (Imperial College London) Roi Reichart (Technion, IIT) Steven Schockaert (University of Cardiff) Sabine Schulte im Walde (University of Stuttgart) Aitor Soroa (University of the Basque Country) Daniil Sorokin (Amazon) Lena Voita (University of Edinburgh) Yogarshi Vyas (University of Maryland) John Wieting (Carnegie Mellon University) Deyi Xiong (Tianjin University) v", "figure_data": ""}, {"figure_label": "of", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Correcting the Misuse: A Method for the Chinese Idiom Cloze Test Xinyu Wang, Hongsheng Zhao, Tan Yang and Hongbo Wang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1 Relation Extraction with Contextualized Relation Embedding Xiaoyu Chen and Rohan Badlani . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11", "figure_data": ""}], "doi": ""}