{"authors": "Hsiang-Sheng Tsai; Heng-Jui Chang; Wen-Chin Huang; Zili Huang; Kushal Lakhotia; Shu-Wen Yang; Shuyan Dong; Andy T Liu; Jeff Cheng-I;  Lai; Jiatong Shi; Xuankai Chang; Phil Hall; Hsuan-Jui Chen; Shang-Wen Li; Shinji Watanabe; Abdelrahman Mohamed; Hung-Yi Lee", "pub_date": "", "title": "SUPERB-SG: Enhanced Speech processing Universal PERformance Benchmark for Semantic and Generative Capabilities", "abstract": "Transfer learning has proven to be crucial in advancing the state of speech and natural language processing research in recent years. In speech, a model pre-trained by self-supervised learning transfers remarkably well on multiple tasks. However, the lack of a consistent evaluation methodology is limiting towards a holistic understanding of the efficacy of such models. SUPERB was a step towards introducing a common benchmark to evaluate pretrained models across various speech tasks. In this paper, we introduce SUPERB-SG, a new benchmark focused on evaluating the semantic and generative capabilities of pre-trained models by increasing task diversity and difficulty over SUPERB. We use a lightweight methodology to test the robustness of representations learned by pre-trained models under shifts in data domain and quality across different types of tasks. It entails freezing pretrained model parameters, only using simple task-specific trainable heads. The goal is to be inclusive of all researchers, and encourage efficient use of computational resources. We also show that the task diversity of SUPERB-SG coupled with limited task supervision is an effective recipe for evaluating the generalizability of model representation. Equal contribution.", "sections": [{"heading": "Introduction", "text": "Transfer learning is a paradigm in machine learning that has been very effective for natural language processing (NLP) (Peters et al., 2018;Devlin et al., 2019;Lan et al., 2019;Dong et al., 2019;Raffel et al., 2020;Conneau et al., 2020), and speech processing (van den Oord et al., 2018;Rivière et al., 2020;Chung et al., 2019;Schneider et al., 2019;Baevski et al., 2020b;Hsu et al., 2021;Liu et al., 2020c,b;Ravanelli et al., 2020;. Self-supervised learning (SSL) is the main driver of this paradigm, an effective and scalable way to learn high-level representation of language that transfers to a variety of tasks. SSL entails learning from the input or some perturbation of it without the need for labelled data. This has unlocked the usage of large amounts of cheaply available unlabelled data. It lends naturally to neural network models that have been shown to possess impressive scaling characteristics such that it is often enough to increase the model and data sizes to improve downstream performance (Hestness et al., 2017;Jozefowicz et al., 2016;Mahajan et al., 2018;Radford et al., 2019).\nSpeech signal consists of acoustic, linguistic, prosodic, and speaker characteristics. SSL algo-rithms in speech must be evaluated in their ability to produce representations that are useful for tasks that demand understanding of linguistic, speaker, and prosodic elements of spoken language as well as high-level semantics. Researchers have used auto-regressive, contrastive, discriminative and multi-task learning objectives to pre-train models, and have investigated their capabilities across tasks like phoneme recognition (van den Oord et al., 2018;Chung et al., 2019), automatic speech recognition (ASR) (Liu et al., 2020b;Schneider et al., 2019;Ravanelli et al., 2020;Hsu et al., 2021;Chang et al., 2021), speaker verification (Fan et al., 2020), speaker identification (Chung et al., 2019;Liu et al., 2020c), emotion recognition (Macary et al., 2021), speech translation (Chung et al., 2019), voice conversion (Lin et al., 2020;Huang et al., 2021a), spoken language understanding (Lai et al., 2021), and text-tospeech (Álvarez et al., 2019). However, the methodologies in such studies vary in the use of datasets, fine-tuning strategies and task-specific model architectures. To bridge this gap, SUPERB (Yang et al., 2021) introduced a standardized benchmark of 10 speech tasks to compare 13 pre-trained models and a Log Mel-Filterbank baseline. It studied the models' performance in tasks focusing on linguistic (phoneme recognition and automatic speech recognition, keyword spotting and query by example), shallow semantic (intent classification and slot filling), speaker (speaker identification, speaker verification and speaker diarization), and prosodic (emotion recognition) characteristics.\nIn this paper, we introduce SUPERB-SG, a benchmark with 5 new tasks, which are speech translation, out-of-domain ASR, voice conversion, speech separation, and speech enhancement, with an emphasis on evaluating the semantic and generative capabilities of pre-trained models that require high-level representations to capture linguistic, semantic, and speaker characteristics. These tasks go beyond speech recognition by focusing on various other aspects that are essential to building intelligent speech interfaces. Further, we show that while SSL models achieve close to state-of-the-art performance on many tasks, there isn't one model that outperforms all others, and that a simple Log Mel-Filterbank can perform competitively on some tasks. We also demonstrate the robustness of our methodology with an ablation study over different task-specific model architectures and data sizes.", "n_publication_ref": 35, "n_figure_ref": 0}, {"heading": "Downstream Model", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Downstream", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Features 1", "text": "Upstream Model (eg. FBANK, TERA, etc.)  The introduction of these new tasks of varying difficulty takes us closer to a more comprehensive unified standard speech benchmark. We hope that this will motivate the development of more powerful, generalizable, and reusable pre-trained models to democratize the advancement of speech research. To facilitate this, we released the codes 1 and integrated the tasks with the SUPERB benchmark.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Upstream (frozen)", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Related Work", "text": "As more powerful SSL models are proposed with promising performance on various tasks, researchers continually try to find extensive evaluation methods to assess model performance, and wish to holistically understand the capability of the learned representations in these models.\nSUPERB (Yang et al., 2021) is a framework to benchmark the SSL models on 10 speech tasks by learning task-specific prediction heads on top of the frozen shared SSL models. Although the tasks in SUPERB span across different domains, most of them are simple classification problems, or only require utilization of shallow semantics. In contrast, we focus on harder semantic and generative tasks.\nAnother recently proposed benchmark is the LeBenchmark (Evain et al., 2021), investigating the performance of SSL models trained on French data with three semantic tasks. However, they only consider wav2vec 2.0 (Baevski et al., 2020b) with different architectures as their upstream models (i.e., networks pre-trained with SSL). Here, we evaluate a diverse set of SSL models, and offer a more comprehensive analysis.\nThe Zero Resource Speech Benchmark 2021 (Nguyen et al., 2020) introduces unsupervised speech processing tasks, particularly the spoken language modeling problem. They evaluate the SSL models via zero-shot probings at four linguistic levels. While their benchmark task is specific for certain domain, we use various tasks to evaluate different aspects of SSL models.\nThe HEAR 2021 Challenge 2 aims to develop general-purpose audio representation by focusing on audio tasks beyond speech that include sound event detection, speech commands and pitch & chroma classification. We specifically focus on various aspects of speech processing, thus providing a wide variety of spoken language tasks.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "SUPERB-SG", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Tasks and Datasets", "text": "This section introduces the tasks in SUPERB-SG, including why we choose these tasks and how we design the task-specific heads for fine-tuning. Following SUPERB's methodology, we use a lightweight fine-tuning approach wherein we freeze the pre-trained model parameters and only keep the task-specific head's parameters trainable. This setting serves the dual purpose of evaluating the robustness as well as the generalizability of the speech representations, and provides a resourceefficient way of fine-tuning the models that is inclusive of participants with constrained compute resources. We call the pre-trained model as upstream model and the task-specific heads as downstream model. We now discuss the newly added tasks in SUPERB-SG in the following sub-sections.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Speech Translation", "text": "Speech translation (ST) involves translating the acoustic speech signals in the source language into the words in the target language. We use it to evaluate the semantic capability of SSL models, and how they benefit the translation task. We use the CoVoST2 EnÑDe (Wang et al., 2020) dataset (CC0 Licensed) with their official train, validation, and test splits while removing all the samples containing \"REMOVE\", resulting in 425.8, 25.9 and 24.5 hours respectively. For text, we keep original case, normalize punctuation, and build character vocabulary with 100% train-set coverage. We report case-sensitive de-tokenized BLEU using sacreBLEU (Post, 2018). Our downstream model has an encoder-decoder architecture with 3 layers of Transformers (Vaswani et al., 2017) each with hidden dimension of 512. A convolutional subsampler is used to reduce the sequence length of the input before feeding it to the encoder. We train our model with label-smoothing using a probability of 0.1. A beam size of 20 is used for inference.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Out-of-domain ASR", "text": "Although an ASR is included in SUPERB, it only examines SSL models on read English corpus Lib-riSpeech (Panayotov et al., 2015). Therefore, we introduce out-of-domain ASR (OOD-ASR), which aims to evaluate the models' capabilities across languages, and out-of-domain scenarios. The OOD-ASR tasks are categorized into cross-lingual and spontaneous speech tasks. For the cross-lingual tasks, we choose the Mexican Spanish (es), Mandarin (zh), and Arabic (ar) subsets from Common Voice 7.0 (Ardila et al., 2020) (CC0 Licensed) containing 21.5, 31.2, and 30.7 hours of training data respectively. The validation set sizes are 1.2 hours, 14.4 hours and 12.24 hours, and the test set sizes are 0.6 hour, 15.3 hours and 12.5 hours for es, zh and ar respectively. For the spontaneous speech task (spon), we use the Santa Barbara Corpus of Spoken American English (SBCSAE) (Du Bois et al., 2000-2005 (CC BY-ND 3.0 Licensed), consisting of 60 conversations over different topics spanning 16.7 hours of data. The validation and test set sizes are 1.6 hours and 2.2 hours respectively. For evaluation, we use word error rate (WER) as the metric except for Mandarin which character error rate (CER) is used. The error rates are averaged across all sub-tasks to offer an overall score. The ASR model is a 2-layer BLSTM (Hochreiter and Schmidhuber, 1997) with hidden states of 1024 dimension. The training objective is to minimize the Connectionist Temporal Classification (CTC) loss (Graves et al., 2006). During inference, we use CTC greedy decoding without language model re-scoring to simplify the process and to highlight the impact of the learned acoustic representations.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Voice Conversion", "text": "For voice conversion (VC), we consider the intralingual VC task in VCC2020 (Zhao et al., 2020)   For the pretraining methods, we abbreviate \"vector quantization\" as VQ, \"future\" as F, \"masked\" as M, \"generation\" as G, \"contrastive discrimination\" as C, and \"token prediction/classification\" as P. Parameters for both pretraining and inference are counted.\n(ODbL Licensed) under the any-to-one (A2O) setting. A2O VC aims to convert speech from any arbitrary speaker into that of a predefined target speaker. We use the task to evaluate the speaker transferability as well as the generalizability of the SSL models. We use 60 utterances from the target speaker that spans 5 minutes for training, and 25 utterances for testing that span 2 minutes. No validation set was used. We use the commonly used mel-cepstrum distortion (MCD), word error rate (WER) and automatic speaker verification (ASV) accept rate from off-the-shelf ASR and ASV models as evaluation metrics. The downstream model is trained to reconstruct the acoustic feature from the upstream representations in a target-speaker-dependent manner. In the conversion phase, given the representations extracted by the upstream, the model generates the converted acoustic features, which are then sent to a neural vocoder to synthesize the converted waveform. We adopted Tacotron2 (Shen et al., 2018) as the downstream model, which is an autoregressive network consisting of convolutional and LSTM layers. For the neural vocoder, we used the Hifi-GAN (Kong et al., 2020). We follow an implementation described in (Huang et al., 2021b).", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Speech Separation", "text": "Speech separation (SS) is the task of separating target speech from background interference   . We choose frequency domain method instead of a time domain based method because of the stride size constraint and computational cost.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Speech Enhancement", "text": "Speech enhancement (SE) is the task of removing background noise from a degraded speech signal, and it aims to improve the perceived quality and intelligibility of the signal. We include this   . A 3-layer BLSTM model similar to the speech separation task is trained to predict the spectral mask for the clean signal. The mean square error between the predicted mask and INPSM is used as the objective.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Self-supervised Models", "text": "We evaluate the tasks on 15 upstream models, which are PASE+ (Ravanelli et al., 2020), APC (Chung et al., 2019), VQ-APC , NPC (Liu et al., 2020a), Mockingjay (Liu et al., 2020c), TERA (Liu et al., 2020b), DeCoAR 2.0 (Ling and Liu, 2020), Modifile CPC (Rivière et al., 2020), wav2vec family (Schneider et al., 2019) (Baevski et al., 2020a) (Baevski et al., 2020b) and HuBERT (Hsu et al., 2021). They span across different architectures, sizes and learning objectives. Some models also use vector quantization which has an added benefit of signal compression.\nFor grounding, we use Log Mel Filterbank as our baseline. The detailed properties of upstream mod-els are shown in Table 1.", "n_publication_ref": 10, "n_figure_ref": 0}, {"heading": "Experimental Setup", "text": "Following SUPERB, we fix upstream models parameters for all downstream tasks' training. We extract the frame-level representations for each hidden layer of the upstream models from raw waveform, and use a trainable task-specific weightedsum mechanism to summarize all layers' representations into a sequence of vectors. The summarized representations are then used as the downstream model's input. An overview of the training procedure is demonstrated in Figure 1. Each experiment is done by one single run with the same seed. This procedure is consistent for all experiments, offering a fair and simple evaluation strategy for all upstream models.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Results and Discussion", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Main result", "text": "The results of the upstream models evaluated on SUPERB-SG are shown in Table 2. We only report the averaged WER for OOD-ASR. Full results can be found in Appendix A. For speech-to-text tasks (ST and OOD-ASR), wav2vec 2.0 and HuBERT offer competitive results, while DeCoAR 2.0 shows some improvements. In speech generation tasks (VC, SS, and SE), FBANK yields comparable or superior performance than some SSL models, especially for those metrics that take the quality of the output signal into account. For VC, the 3 reported metrics have the same trend for respective models. Here, vq-wav2vec achieves the best performance on MCD and ASV, while HuBERT performs the best on WER. For SS, Hubert-Large achieves the best performance, followed by Modified CPC. PASE+, which is pre-trained with denoising tasks, performs better than half the SSL models, but this observation doesn't transfer to the other tasks. For SE, all upstream models perform comparably. The largest gap is only 0.17 in PESQ and 1.1 in STOI.\nOverall, no model outperforms all others on all tasks. However, HuBERT-Large performs most competitively on all downstream tasks, especially those requiring linguistic and semantic signals.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Correlation between tasks", "text": "We analyze the correlations between tasks in SUPERB-SG to understand the similarity between tasks, and verify if the experimental results agree with the common understanding of related tasks based on shared representation they require.\nTo compute the correlation, we first change all metrics into a higher-better manner. Then, we compute the Spearman's rank correlation coefficients (Spearman's ρ) between all pairs of tasks. For multiple metrics contained in a single task, such as MCD/WER/ASV in VC as well as PESQ/STOI in SE, we compute each of them separately.\nTo make our analysis more representative and generalized to all speech domains, we bring back the six tasks from SUPERB (Yang et al., 2021) that are considered representative of the following four domains: (i) Content recognition tasks contain-   ing Phoneme Recognition (PR), Automatic Speech Recognition (ASR) (ii) Speaker identity tasks including Identification (SID), Automatic Speaker Verification (ASV) (iii) Semantics task which is Intent Classification (IC) and (iv) Prosodic task which is Emotion Recognition (ER). Together with the 5 tasks introduced in this paper, we show the results of total 11 downstream tasks with the 14 corresponding metrics in Figure 2.\nOverall, results show that all tasks except SS and SE have strong positive correlation among them. One possible explanation for SS and SE not showing strong correlation is that the low-level information closely related to audio signals is more critical as they need to reconstruct clean speech from interfering speakers and background noise by estimating the STFT masks. As a result, high-level information extracted from SSL models has little benefit for these tasks but is helpful for other tasks. As noted earlier, there is only a small gap in performance between FBANK and SSL models. If we leave SS and SE out, all correlation coefficients are greater than 0.58, showing that the SSL model representations are useful for multiple domains.\nAlthough the Spearman's ρ are large in general in Figure 2, differences between tasks are observable. Here, we focus on the relation between correlation and similarity of tasks. We list the most and the least two correlated tasks comparing with ST, OOD-ASR, VC, SS, and SE. SS and SE are skipped as candidates for for the least correlated   tasks since they dominate the results. For VC, we average the correlation coefficients across the three metrics. The results are shown in Table 3. ST and OOD-ASR are highly correlated with ASR since they both transform speech signals into discrete text tokens. IC is also correlated with ST since semantic information is required to perform both tasks. Moreover, ASV and VC are the least correlated tasks since they primarily focus on the speaker information with lesser regard to the semantic content. However, the absolute correlation values are still larger than 0.7. For VC, the speaker information needs to be removed while the content has to be kept, similar to PR and ASR but different from SID. SS and SE are correlated with each other and have a much lower correlation with speaker identity and semantics tasks, supporting our assumption. Overall, we find that empirically highly-correlated tasks require similar knowledge or understanding ability.\nTo give a broader view of our correlation results, we further cluster the downstream tasks by their correlation with each other using K-means. In this way, all the tasks are considered simultaneously, and the grouping is driven automatically by the empirical correlation results. If more than one metric are used in a downstream task, we cluster them independently. The clustering results are shown in Table 4 and a rearranged correlation map is shown in Figure 3. The result shows that the clusters of the tasks align with our empirical knowledge. Cluster A includes tasks that require content information, while tasks in cluster B are more sensitive to speaker and prosodic features. Cluster C contains metrics MCD and ASV of VC, which are used to evaluate the signal quality and the rates of speaker transfer. It is worth noting that WER in VC belongs to cluster A, showing that it is more similar to content-related tasks. Furthermore, clusters D, E, and F each contain one of the metrics in SS and SE, aligning with our assumption that these tasks utilize different types of information compared to other tasks.\nWith the analysis of the correlation between tasks, we empirically confirm the reliability of the results, and show that we increase the heterogeneity among speech tasks over SUPERB. We further discover shared properties between tasks with clustering, and the result is aligned with our common understanding of related tasks.", "n_publication_ref": 1, "n_figure_ref": 3}, {"heading": "Robustness of SUPERB-SG", "text": "To study the impact of downstream model architecture and the data sizes used in SUPERB-SG we evaluate the robustness of SUPERB-SG with variations in downstream model as well as training data size, and show that our conclusions still hold true.\nWe choose ST, OOD-ASR and SS as the downstream tasks for evaluation with an aim to cover semantic, content recognition, and generative task types. For the upstream models, FBANK, TERA, CPC, wav2vec 2.0 Base and HuBERT Base are used to cover different SSL algorithms.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Downstream model", "text": "For each task, 2 additional downstream architectures are created by modifying the number of layers and the hidden dimensions compared to our default setting. We create small and large models that are roughly the half and twice of default in terms of the number of trainable parameters. A detailed comparison of the downstream architectures is shown in Table 5. The results are shown in Table 6.\nWe show that the ranking of the upstream models is almost fixed when the model sizes are varied. As expected, the small architecture has worse perfor-   mance than default, while large has better. Moreover, the scores causing the change in ranking are negligible, e.g., TERA/CPC in SS and wav2vec 2.0 Base/HuBERT Base in OOD-ASR with large. The results show that the relative performance achieved by different upstream models is agnostic to the downstream architecture, confirming the robustness of the framework used in SUPERB-SG.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Training data size", "text": "To study the effect of data size, we create 3 pseudo datasets per task by sub-sampling 10%, 5% and  1% from the original training set while fixing the validation and test sets. The statistics of the datasets are shown in Table 7, and the results are in Table 8. The ranking of the upstream models remains almost the same for 10% of training data. When that is further reduced to 5%, there is a change in ranking in SS due to a performance drop in Modified CPC. Excluding Modified CPC, the ranking is still fixed showing that the relative performance of the upstream models is agnostic to data size. Furthermore, when using only 1% of training data, most of the SSL models fail on the 3 downstream tasks. This phenomenon is caused by insufficient task-specific knowledge due to limited training data size. Although SSL models learn highlevel representations from the unlabeled speech signal, acquisition of task-specific knowledge such as translingual ability in ST, text-level token mapping in OOD-ASR, and mask prediction in SS, requires non-trivial supervision.\nWe  We have open-sourced all the codes 1 and released a challenge 3 to encourage further research of SSL in speech. We welcome the community to participate and advance the research frontier together.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Ethics", "text": "This work fully adheres to the ACL code of ethics. For more details, we provide a checklist in Appendix B.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "A Complete Out-of-domain ASR Results", "text": "Here, we provide complete results of OOD-ASR tasks, as shown in Tables 9, 10, 11. All upstream models used in this paper are trained with English speech data, but we are also interested in multilingual pre-trained models in OOD-ASR. Therefore, we evaluate the wav2vec 2.0 XLSR model on the OOD-ASR tasks, as shown in the last row of Table 9. XLSR has identical architecture as wav2vec 2.0 Large, but is trained with 56k hours of speech including 53 different languages. The pre-training data of XLSR cover our cross-lingual tasks' training data. As expected, using multilingual data improves OOD-ASR tasks and achieves the best performance among all upstream models.  ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "B Responsible NLP Research Checklist", "text": "Here we answer the ethics questions to show our ethics statement.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "B.1 Did you discuss the limitations of your work?", "text": "Yes, we discussed the constrains on the frozen upstreams and simple task specific heads in abstract and Section 3.   Yes, we used public datasets and pre-trained models mentioned in Section 3.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "B.4.1 Did you cite the creators of artifacts you used?", "text": "Yes, we cited those artifacts properly in Section 3.\nB.4.2 Did you discuss the license or terms for use and/or distribution of any artifacts?\nYes, the licenses of the artifacts are clearly indicated in Section 3.\nB.4.3 Did you discuss if your use of existing artifact(s) was consistent with their intended use, provided that it was specified? For the artifacts you create, do you specify intended use and whether that is compatible with the original access conditions (in particular, derivatives of data accessed for research purposes should not be used outside of research contexts)?\nYes, we use the official implementations of the upstream models in Table 1 and followed their public API to access the models. For the datasets, we also follow their licenses.\nB.4.4 Did you discuss the steps taken to check whether the data that was collected/used contains any information that names or uniquely identifies individual people or offensive content, and the steps taken to protect / anonymize it?\nNo, there were no data collection involved in this work. We used the widely-used public datasets and followed the common data preprocessing steps.\nB.4.5 Did you provide documentation of the artifacts, e.g., coverage of domains, languages, and linguistic phenomena, demographic groups represented, etc.?\nYes, the properties of the artifacts were indicated in Section 3.  Yes.\nB.5.1 Did you report the number of parameters in the models used, the total computational budget (e.g., GPU hours), and computing infrastructure used?\nWe reported the number of the parameters in Section 5.3.1. The computational budget and computing infrastructures are reported in Table 12.\nB.5.2 Did you discuss the experimental setup, including hyperparameter search and best-found hyperparameter values?\nNo, we didn't do the hyperparameter searching in a unified way. Some hyperparameters came from the official implementation or related works and some were searched by ourselves. However, the hyperparameters we used are public available 1 . B.5.3 Did you report descriptive statistics about your results (e.g., error bars around results, summary statistics from sets of experiments), and is it transparent whether you are reporting the max, mean, etc. or just a single run?\nYes, we indicated that in Section 4.\nB.5.4 If you used existing packages (e.g., for preprocessing, for normalization, or for evaluation), did you report the implementation, model, and parameter settings used (e.g., NLTK, Spacy, ROUGE, etc.)?\nYes, we reported them in Section 3.\nB.6 Did you use human annotators (e.g., crowdworkers) or research with human subjects?\nNo.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Problem-agnostic speech embeddings for multi-speaker text-to-speech with samplernn", "journal": "", "year": "2019", "authors": "David Álvarez"}, {"title": "Common voice: A massivelymultilingual speech corpus", "journal": "", "year": "2020", "authors": "Rosana Ardila; Megan Branson; Kelly Davis; Michael Kohler; Josh Meyer; Michael Henretty; Reuben Morais; Lindsay Saunders; Francis Tyers; Gregor Weber"}, {"title": "vq-wav2vec: Self-supervised learning of discrete speech representations", "journal": "", "year": "2020", "authors": "Alexei Baevski; Steffen Schneider; Michael Auli"}, {"title": "Abdelrahman Mohamed, and Michael Auli. 2020b. wav2vec 2.0: A framework for self-supervised learning of speech representations", "journal": "", "year": "", "authors": "Alexei Baevski; Yuhao Zhou"}, {"title": "DistilHuBERT: Speech representation learning by layer-wise distillation of hidden-unit BERT", "journal": "", "year": "2021", "authors": "Heng-Jui Chang; Shu-Wen Yang; Hung-Yi Lee"}, {"title": "An Unsupervised Autoregressive Model for Speech Representation Learning", "journal": "", "year": "2019", "authors": "Yu-An Chung; Wei-Ning Hsu; Hao Tang; James Glass"}, {"title": "Vector-quantized autoregressive predictive coding", "journal": "", "year": "2020", "authors": "Yu-An Chung; Hao Tang; James Glass"}, {"title": "", "journal": "", "year": "2020", "authors": "Alexis Conneau; Kartikay Khandelwal; Naman Goyal; Vishrav Chaudhary; Guillaume Wenzek; Francisco Guzmán; Edouard Grave; Myle Ott; Luke Zettlemoyer; Veselin Stoyanov"}, {"title": "Librimix: An open-source dataset for generalizable speech separation", "journal": "", "year": "2020", "authors": "Joris Cosentino; Manuel Pariente; Samuele Cornell; Antoine Deleforge; Emmanuel Vincent"}, {"title": "Bert: Pre-training of deep bidirectional transformers for language understanding", "journal": "", "year": "2019", "authors": "Jacob Devlin; Ming-Wei Chang; Kenton Lee; Kristina Toutanova"}, {"title": "Unified language model pre-training for natural language understanding and generation", "journal": "", "year": "2019", "authors": "Li Dong; Nan Yang; Wenhui Wang; Furu Wei; Xiaodong Liu; Yu Wang; Jianfeng Gao; Ming Zhou; Hsiao-Wuen Hon"}, {"title": "", "journal": "", "year": "2000", "authors": "John W Du Bois; Wallace L Chafe; Charles Meyer; A Sandra; Nii Thompson;  Martey"}, {"title": "Philadelphia: Linguistic Data Consortium", "journal": "", "year": "", "authors": ""}, {"title": "Phase-sensitive and recognition-boosted speech separation using deep recurrent neural networks", "journal": "IEEE", "year": "2015", "authors": "Hakan Erdogan; R John; Shinji Hershey; Jonathan Le Watanabe;  Roux"}, {"title": "Titouan Parcollet, Alexandre Allauzen, Yannick Esteve, Benjamin Lecouteux, Francois Portet, Solange Rossato, Fabien Ringeval, Didier Schwab, and Laurent Besacier", "journal": "", "year": "2021", "authors": "Solene Evain; Ha Nguyen; Hang Le;  Marcely Zanon; Salima Boito; Sina Mdhaffar; Ziyi Alisamir; Natalia Tong; Marco Tomashenko;  Dinarelli"}, {"title": "Exploring wav2vec 2.0 on speaker verification and language identification", "journal": "", "year": "2020", "authors": "Zhiyun Fan; Meng Li; Shiyu Zhou; Bo Xu"}, {"title": "Connectionist temporal classification: labelling unsegmented sequence data with recurrent neural networks", "journal": "", "year": "2006", "authors": "Alex Graves; Santiago Fernández; Faustino Gomez; Jürgen Schmidhuber"}, {"title": "Deep learning scaling is predictable, empirically", "journal": "", "year": "2017", "authors": "Joel Hestness; Sharan Narang; Newsha Ardalani; Gregory Diamos; Heewoo Jun; Hassan Kianinejad; Md. Mostofa Ali Patwary; Yang Yang; Yanqi Zhou"}, {"title": "Long short-term memory", "journal": "Neural computation", "year": "1997", "authors": "Sepp Hochreiter; Jürgen Schmidhuber"}, {"title": "Hubert: Self-supervised speech representation learning by masked prediction of hidden units", "journal": "", "year": "2021", "authors": "Wei-Ning Hsu; Benjamin Bolte; Yao-Hung Hubert Tsai; Kushal Lakhotia"}, {"title": "Any-to-One Sequence-to-Sequence Voice Conversion using Self-Supervised Discrete Speech Representations", "journal": "", "year": "2021", "authors": "W.-C Huang; Y.-C Wu; T Hayashi; T Toda"}, {"title": "S3prl-vc: Open-source voice conversion framework with self-supervised speech representations", "journal": "", "year": "2021", "authors": "Wen-Chin Huang; Shu-Wen Yang; Tomoki Hayashi; Hung-Yi Lee; Shinji Watanabe; Tomoki Toda"}, {"title": "Exploring the limits of language modeling", "journal": "", "year": "2016", "authors": "Rafal Jozefowicz; Oriol Vinyals; Mike Schuster; Noam Shazeer; Yonghui Wu"}, {"title": "Multitalker speech separation with utterance-level permutation invariant training of deep recurrent neural networks", "journal": "IEEE/ACM Transactions on Audio, Speech, and Language Processing", "year": "2017", "authors": "Morten Kolbaek; Dong Yu; Zheng-Hua Tan; Jesper Jensen"}, {"title": "HiFi-GAN: Generative Adversarial Networks for Efficient and High Fidelity Speech Synthesis", "journal": "", "year": "2020", "authors": "J Kong; J Kim; J Bae"}, {"title": "Semi-supervised spoken language understanding via self-supervised speech and language model pretraining", "journal": "", "year": "2021", "authors": "-I Cheng; Yung-Sung Lai; Hung-Yi Chuang; Shang-Wen Lee; James Li;  Glass"}, {"title": "Albert: A lite bert for self-supervised learning of language representations", "journal": "", "year": "2019", "authors": "Zhenzhong Lan; Mingda Chen; Sebastian Goodman; Kevin Gimpel; Piyush Sharma; Radu Soricut"}, {"title": "Denoising sequence-to-sequence pre-training for natural language generation, translation, and comprehension", "journal": "ACL", "year": "2019", "authors": "Mike Lewis; Yinhan Liu; Naman Goyal ; Abdelrahman Mohamed; Omer Levy; Ves Stoyanov; Luke Zettlemoyer"}, {"title": "Fragmentvc: Anyto-any voice conversion by end-to-end extracting and fusing fine-grained voice fragments with attention", "journal": "", "year": "2020", "authors": "Y Yist; Chung-Ming Lin; Jheng-Hao Chien; Hungyi Lin; Lin-Shan Lee;  Lee"}, {"title": "DeCoAR 2.0: Deep contextualized acoustic representations with vector quantization", "journal": "", "year": "2020", "authors": "Shaoshi Ling; Yuzong Liu"}, {"title": "Deep contextualized acoustic representations for semi-supervised speech recognition", "journal": "IEEE", "year": "2020", "authors": "Shaoshi Ling; Yuzong Liu; Julian Salazar; Katrin Kirchhoff"}, {"title": "Non-autoregressive predictive coding for learning speech representations from local dependencies", "journal": "", "year": "2020", "authors": "H Alexander; Yu-An Liu; James Chung;  Glass"}, {"title": "Tera: Self-supervised learning of transformer encoder representation for speech", "journal": "", "year": "2020", "authors": "T Andy; Shang-Wen Liu; Hung-Yi Li;  Lee"}, {"title": "Mockingjay: Unsupervised speech representation learning with deep bidirectional transformer encoders", "journal": "ICASSP", "year": "2020", "authors": "Andy T Liu; Shu-Wen Yang; Po-Han Chi; Po-Chun Hsu; Hung-Yi Lee"}, {"title": "RoBERTa: A robustly optimized BERT pretraining approach", "journal": "", "year": "2019", "authors": "Yinhan Liu; Myle Ott; Naman Goyal; Jingfei Du; Mandar Joshi; Danqi Chen; Omer Levy; Mike Lewis; Luke Zettlemoyer; Veselin Stoyanov"}, {"title": "On the use of selfsupervised pre-trained acoustic and linguistic features for continuous speech emotion recognition", "journal": "IEEE", "year": "2021", "authors": "Manon Macary; Marie Tahon; Yannick Estève; Anthony Rousseau"}, {"title": "Exploring the limits of weakly supervised pretraining", "journal": "", "year": "2018", "authors": "Dhruv Mahajan; Ross Girshick; Vignesh Ramanathan; Kaiming He; Manohar Paluri; Yixuan Li"}, {"title": "The zero resource speech benchmark 2021: Metrics and baselines for unsupervised spoken language modeling", "journal": "", "year": "2020", "authors": " Tu Anh Nguyen"}, {"title": "Librispeech: an asr corpus based on public domain audio books", "journal": "IEEE", "year": "2015", "authors": "Vassil Panayotov; Guoguo Chen; Daniel Povey; Sanjeev Khudanpur"}, {"title": "Deep contextualized word representations", "journal": "", "year": "2018", "authors": "Matthew Peters; Mark Neumann; Mohit Iyyer; Matt Gardner; Christopher Clark; Kenton Lee; Luke Zettlemoyer"}, {"title": "A call for clarity in reporting BLEU scores", "journal": "", "year": "2018", "authors": "Matt Post"}, {"title": "Language models are unsupervised multitask learners", "journal": "", "year": "2019", "authors": "Alec Radford; Jeffrey Wu; Rewon Child; David Luan; Dario Amodei; Ilya Sutskever"}, {"title": "Exploring the limits of transfer learning with a unified text-to", "journal": "", "year": "2020", "authors": "Colin Raffel; Noam Shazeer; Adam Roberts; Katherine Lee; Sharan Narang; Michael Matena; Yanqi Zhou; Wei Li; Peter J Liu"}, {"title": "Multi-task self-supervised learning for robust speech recognition", "journal": "", "year": "2020-01", "authors": "Mirco Ravanelli; Jianyuan Zhong; Santiago Pascual; Pawel Swietojanski; Joao Monteiro"}, {"title": "Unsupervised pretraining transfers well across languages", "journal": "", "year": "2020", "authors": "Morgane Rivière; Armand Joulin; Pierre-Emmanuel Mazaré; Emmanuel Dupoux"}, {"title": "wav2vec: Unsupervised pre-training for speech recognition", "journal": "", "year": "2019", "authors": "Steffen Schneider; Alexei Baevski; Ronan Collobert; Michael Auli"}, {"title": "Outrageously large neural networks: The sparsely-gated mixture-of-experts layer", "journal": "", "year": "2017", "authors": "Noam Shazeer; Azalia Mirhoseini; Krzysztof Maziarz; Andy Davis; Quoc Le; Geoffrey Hinton; Jeff Dean"}, {"title": "Natural TTS Synthesis by Conditioning WaveNet on MEL Spectrogram Predictions. In Proc. ICASSP", "journal": "", "year": "2018", "authors": "J Shen; R Pang; R J Weiss; M Schuster; N Jaitly; Z Yang; Z Chen; Y Zhang; Y Wang; R Skerry-Ryan; R A Saurous; Y Agiomyrgiannakis; Y Wu"}, {"title": "Representation learning with contrastive predictive coding", "journal": "", "year": "2018", "authors": "Aäron Van Den Oord; Yazhe Li; Oriol Vinyals"}, {"title": "Attention is all you need", "journal": "", "year": "2017", "authors": "Ashish Vaswani; Noam Shazeer; Niki Parmar; Jakob Uszkoreit; Llion Jones; Aidan N Gomez; Łukasz Kaiser; Illia Polosukhin"}, {"title": "The voice bank corpus: Design, collection and data analysis of a large regional accent speech database", "journal": "IEEE", "year": "2013", "authors": "Christophe Veaux; Junichi Yamagishi; Simon King"}, {"title": "CoV-oST 2: A massively multilingual speech-to-text translation corpus", "journal": "", "year": "2020", "authors": "Changhan Wang; Anne Wu; Juan Pino"}, {"title": "Supervised speech separation based on deep learning: An overview", "journal": "IEEE/ACM Transactions on Audio, Speech, and Language Processing", "year": "2018", "authors": "Deliang Wang; Jitong Chen"}, {"title": "Wham!: Extending speech separation to noisy environments", "journal": "", "year": "2019", "authors": "Gordon Wichern; Joe Antognini; Michael Flynn; Licheng Richard Zhu; Emmett Mcquinn; Dwight Crow; Ethan Manilow; Jonathan Le Roux"}, {"title": "", "journal": "Abdelrahman Mohamed", "year": "", "authors": "Po-Han Shu-Wen Yang; Yung-Sung Chi;  Chuang; -I Jeff Cheng; Kushal Lai; Yist Y Lakhotia; Andy T Lin; Jiatong Liu; Xuankai Shi; Guan-Ting Chang; Tzu-Hsien Lin; Wei-Cheng Huang;  Tseng; Da-Rong Ko Tik Lee; Zili Liu; Shuyan Huang; Shang-Wen Dong; Shinji Li;  Watanabe"}, {"title": "XLNet: Generalized autoregressive pretraining for language understanding", "journal": "", "year": "2019", "authors": "Zhilin Yang; Zihang Dai; Yiming Yang; Jaime Carbonell; Ruslan Salakhutdinov; V Quoc;  Le"}, {"title": "Permutation invariant training of deep models for speaker-independent multi-talker speech separation", "journal": "IEEE", "year": "2017", "authors": "Dong Yu; Morten Kolbaek; Zheng-Hua Tan; Jesper Jensen"}, {"title": "Voice Conversion Challenge 2020 -Intra-lingual semi-parallel and cross-lingual voice conversion", "journal": "", "year": "2020", "authors": "Y Zhao; W.-C Huang; X Tian; J Yamagishi; R K Das; T Kinnunen; Z Ling; T Toda"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Illustration of the detailed training procedure. A trainable weighted-sum mechanism is used to summarize all layers' representations into a sequence of vectors and then taken by downstream model as input. Upstream is frozen through the whole process. Dashed arrow () is used to indicate the flow of gradient when back propagating.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 3 :3Figure 3: Spearman's ρ between tasks rearranged by clustering result.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Details of the investigated SSL representations. LibriSpeech and LibriLight are denoted as LS and LL, respectively.", "figure_data": ""}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "Evaluating various SSL representations on new semantic and generative downstream tasks. Ò indicates the higher the better and Ó indicates the lower the better. The complete results of OOD-ASR are in Appendix A.", "figure_data": "task to evaluate the generative capability undernoisy conditions. In SUPERB-SG, we discuss thespeech enhancement problem on the Voicebank-DEMAND (Veaux et al., 2013) (CC BY 4.0 Li-censed) corpus. The train, validation, and testsets contain 8.8, 0.6 and 0.6 hours of speech re-spectively. Our evaluation metrics are PerceptualEvaluation of Speech Quality (PESQ) and Short-Time Objective Intelligibility (STOI). For the down-stream model, we follow the mask-based speechenhancement pipeline in"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "", "figure_data": "ST OOD-ASR VC (MCD) VC (WER) VC (ASV) SS SE (PESQ) SE (STOI) PR ASR SID ASV ICST 1.0 0.0 OOD-ASR VC (MCD) VC (WER) VC (ASV) SS SE (PESQ) SE (STOI) PR ASR SID ASV IC ER 0.2 0.4 0.6 0.8 1.0ERFigure 2: Spearman's ρ between tasks."}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "", "figure_data": "1.00.80.60.40.20.0"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Top 2 and last 2 tasks correlated with the five SUPERB-SG tasks ranked by Spearman's ρ.", "figure_data": "ClusterMetricsAST, OOD-ASR, PR VC (WER), ASR, ICBSID, ASV, ERCVC (MCD), VC (ASV)DSSESE (PESQ)FSE (STOI)"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_9", "figure_caption": "", "figure_data": ""}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "A detailed comparison of downstream model architectures. We report the number of trainable parameters when using TERA as upstream model while minor difference (< 10%) exists due to different upstream dimensions. For OOD-ASR, we average values across all sub-tasks since sub-tasks have different vocabulary sizes.", "figure_data": "UpstreamSTOOD-ASRSSBLEUÒWERÓSI-SDRiÒdefaultFBANK2.3263.589.23TERA5.6658.4910.19Modified CPC4.8262.5410.40wav2vec 2.0 Base14.8146.959.77HuBERT Base15.5346.699.36smallFBANK0.5870.868.19TERA1.8464.809.20Modified CPC1.4467.839.56wav2vec 2.0 Base8.5550.758.83HuBERT Base9.2450.328.73largeFBANK3.0260.499.77TERA6.6457.95 (Ĳ) 10.87Modified CPC4.5659.73 (İ) 10.61wav2vec 2.0 Base16.81(Ĳ) 45.619.86HuBERT Base17.59(İ) 45.789.83"}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_12", "figure_caption": "Results on SS, ST, OOD-ASR when using different architectures. Ĳ and İ are used to denote the rank changing. The complete results of OOD-ASR are in Appendix A.", "figure_data": ""}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_14", "figure_caption": "Hours of data in pseudo datasets.", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_15", "figure_caption": "note that fewer training examples speeds training up but sacrifices the evaluation quality.", "figure_data": "UpstreamSTOOD-ASRSSBLEUÒWERÓSI-SDRiÒ100%FBANK2.3263.589.23TERA5.6658.4910.19Modified CPC4.8262.5410.40wav2vec 2.0 Base14.8146.959.77HuBERT Base15.5346.699.3610%FBANK0.4685.395.65TERA(İ) 0.8880.32(Ĳ) 6.72Modified CPC(Ĳ) 1.3085.32(İ) 6.59wav2vec 2.0 Base5.0463.856.45HuBERT Base5.5763.436.135%FBANK0.2789.704.52TERA0.4486.95 (Ĳ 1) 5.59Modified CPC0.3787.97 (İ 3) 4.95wav2vec 2.0 Base2.9169.88 (Ĳ 1) 5.36HuBERT Base3.3569.33 (Ĳ 1) 5.031%FBANK0.0399.532.29TERA0.0498.313.24Modified CPC0.0398.37 (İ 3) 2.87wav2vec 2.0 Base0.3392.46 (Ĳ 2) 3.34HuBERT Base0.3892.17 (Ĳ 1) 3.01"}, {"figure_label": "8", "figure_type": "table", "figure_id": "tab_16", "figure_caption": "Results on ST, OOD-ASR and SS when using different amount of training data. Ĳ and İ are used to denote the rank changing. The complete results of OOD-ASR are in Appendix A.", "figure_data": "Overall, we show the robustness of SUPERB-SGto variations in data size even when the trainingdata is reduced to 5%, showing the reliability ofthe benchmark.6 ConclusionWe introduce SUPERB-SG, a set of 5 new tasksthat include speech translation, out-of-domainASR, voice conversion, speech separation, andspeech enhancement to evaluate the deep seman-tic and generative capabilities of SSL models. Weevaluate 15 SSL models, and do a comprehensiveanalysis of the task correlations to demonstrate thereliability of our methodology. We test and con-firm the robustness of SUPERB-SG in terms ofthe downstream model architecture as well as thetraining data size. The latest introduction of the se-mantic and generative tasks increases the diversityand difficulty of SUPERB, which can boost a morecomprehensive understanding of the capability ofvarious SSL models' representations, and help re-searchers discover the hidden properties of SSL"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_17", "figure_caption": "XLSR 26.90 : 22.97 : 49.63 : 63.05 : 40.64 :", "figure_data": "UpstreameszharsponWERÓ CERÓ WERÓ WERÓAVGFBANK54.0335.4472.0792.7863.58PASE+52.1135.5270.4788.1561.56APC55.2336.3870.7990.0763.12VQ-APC55.3237.0671.5690.2963.56NPC51.0735.8569.8789.8661.66Mockingjay58.1138.1373.5791.2765.27TERA48.6732.2166.1886.8958.49Modified CPC54.3736.2268.9490.6162.54DeCoAR 2.043.1828.7761.0081.5353.62wav2vec46.1631.6960.8584.7255.86vq-wav2vec52.0236.5566.1987.8960.66wav2vec 2.0 Base37.8526.4455.9567.5546.95wav2vec 2.0 Large35.75 : 25.07 : 54.29 : 63.64 :44.69HuBERT Base37.1526.2354.9468.4146.69HuBERT Large30.9023.73 : 50.60 ; 71.09 ;44.08wav2vec 2.0"}, {"figure_label": "9", "figure_type": "table", "figure_id": "tab_18", "figure_caption": "Results of OOD-ASR tasks, where spon denotes spontaneous speech. : Normalized across dimensionality of representation to stabilize training and ensure convergence. ; Uses linear warmup of learning rates in the first 8k steps to stabilize training and ensure convergence.", "figure_data": ""}, {"figure_label": "10", "figure_type": "table", "figure_id": "tab_20", "figure_caption": "Complete results of OOD-ASR tasks with different model sizes.", "figure_data": "UpstreameszharsponWERÓ CERÓ WERÓ WERÓ AVG100%FBANK54.0335.4472.0792.7863.58TERA48.6732.2166.1886.8958.49Modified CPC54.3736.2268.9490.6162.54wav2vec 2.0 Base37.8526.4455.9567.5546.95HuBERT Base37.1526.2354.9468.4146.6910%FBANK84.8262.9793.27100.49 85.39TERA76.4458.5488.4997.7980.32Modified CPC83.8464.7891.20101.44 85.32wav2vec 2.0 Base61.2643.5072.9877.6563.85HuBERT Base58.0842.9472.7879.9463.435%FBANK89.4871.9996.69100.65 89.70TERA83.9871.0493.1599.6286.95Modified CPC88.6167.6195.7199.9387.97wav2vec 2.0 Base67.0950.5878.5383.3369.88HuBERT Base66.2950.7276.5983.7469.331%FBANK96.7996.7399.85104.73 99.53TERA94.7398.8299.7799.9398.31Modified CPC95.9397.9499.8099.8498.37wav2vec 2.0 Base82.0094.3892.41101.06 92.46HuBERT Base82.3694.3490.37101.60 92.17"}, {"figure_label": "11", "figure_type": "table", "figure_id": "tab_21", "figure_caption": "Complete results of OOD-ASR tasks with different data sizes. robustness of SUPERB-SG. Did you use or create scientific artifacts?", "figure_data": "B.3 Do the abstract and introductionsummarize the paper's main claims?Yes, the paper's main claims are summarized inabstract and Section 1."}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_22", "figure_caption": "B.4.6 Did you report relevant statistics like the number of examples, details of train/test/dev splits, etc. for the data that you used/created?", "figure_data": "STOOD-ASRVCSSSESteps32k500k10k150k150kTime25hr36hr4hr48hr72hrGPU3090V1003090 1080 Ti 1080 TiYes, the relevant statistics were reported in Section3."}, {"figure_label": "12", "figure_type": "table", "figure_id": "tab_23", "figure_caption": "Training steps, time and GPU devices used by each task when using HuBERT Base as upstream. NVIDIA ReForce RTX 3090, NVIDIA Tesla V100 and NVIDIA GeForce GTX 1080 Ti are denoted as 3090, V100 and 1080 Ti respectively.", "figure_data": "B.5 Did you run computational experiments?"}], "doi": ""}