{"authors": "Emma Strubell; Patrick Verga; David Belanger; Andrew Mccallum", "pub_date": "", "title": "Fast and Accurate Entity Recognition with Iterated Dilated Convolutions", "abstract": "Today when many practitioners run basic NLP on the entire web and large-volume traffic, faster methods are paramount to saving time and energy costs. Recent advances in GPU hardware have led to the emergence of bi-directional LSTMs as a standard method for obtaining pertoken vector representations serving as input to labeling tasks such as NER (often followed by prediction in a linear-chain CRF). Though expressive and accurate, these models fail to fully exploit GPU parallelism, limiting their computational efficiency. This paper proposes a faster alternative to Bi-LSTMs for NER: Iterated Dilated Convolutional Neural Networks (ID-CNNs), which have better capacity than traditional CNNs for large context and structured prediction. Unlike LSTMs whose sequential processing on sentences of length N requires O(N ) time even in the face of parallelism, ID-CNNs permit fixed-depth convolutions to run in parallel across entire documents. We describe a distinct combination of network structure, parameter sharing and training procedures that enable dramatic 14-20x testtime speedups while retaining accuracy comparable to the Bi-LSTM-CRF. Moreover, ID-CNNs trained to aggregate context from the entire document are even more accurate while maintaining 8x faster test time speeds.", "sections": [{"heading": "Introduction", "text": "In order to democratize large-scale NLP and information extraction while minimizing our environmental footprint, we require fast, resource-efficient methods for sequence tagging tasks such as part-of-speech tagging and named entity recognition (NER). Speed is not sufficient of course: they must also be expressive enough to tolerate the tremendous lexical variation in input data.\nThe massively parallel computation facilitated by GPU hardware has led to a surge of successful neural network architectures for sequence labeling (Ling et al., 2015;Ma and Hovy, 2016;Chiu and Nichols, 2016;Lample et al., 2016). While these models are expressive and accurate, they fail to fully exploit the parallelism opportunities of a GPU, and thus their speed is limited. Specifically, they employ either recurrent neural networks (RNNs) for feature extraction, or Viterbi inference in a structured output model, both of which require sequential computation across the length of the input.\nInstead, parallelized runtime independent of the length of the sequence saves time and energy costs, maximizing GPU resource usage and minimizing the amount of time it takes to train and evaluate models. Convolutional neural networks (CNNs) provide exactly this property (Kim, 2014;Kalchbrenner et al., 2014). Rather than composing representations incrementally over each token in a sequence, they apply filters in parallel across the entire sequence at once. Their computational cost grows with the number of layers, but not the input size, up to the memory and threading limitations of the hardware. This provides, for example, audio generation models that can be trained in parallel .\nDespite the clear computational advantages of CNNs, RNNs have become the standard method for composing deep representations of text. This is because a token encoded by a bidirectional RNN will incorporate evidence from the entire input sequence, but the CNN's representation is limited by the effective input width 1 of the network: the size of the input context which is observed, directly or indirectly, by the representation of a token at a given layer in the network. Specifically, in a network composed of a series of stacked convolutional layers of convolution width w, the number r of context tokens incorporated into a token's representation at a given layer l, is given by r = l(w − 1) + 1. The number of layers required to incorporate the entire input context grows linearly with the length of the sequence. To avoid this scaling, one could pool representations across the sequence, but this is not appropriate for sequence labeling, since it reduces the output resolution of the representation.\nIn response, this paper presents an application of dilated convolutions (Yu and Koltun, 2016) for sequence labeling (Figure 1). For dilated convolutions, the effective input width can grow exponentially with the depth, with no loss in resolution at each layer and with a modest number of parameters to estimate. Like typical CNN layers, dilated convolutions operate on a sliding window of context over the sequence, but unlike conventional convolutions, the context need not be consecutive; the dilated window skips over every dilation width d inputs. By stacking layers of dilated convolutions of exponentially increasing dilation width, we can expand the size of the effective input width to cover the entire length of most sequences using only a few layers: The size of the effective input width for a token at layer l is now given by 2 l+1 −1. More concretely, just four stacked dilated convolutions of width 3 produces token representations with a n effective input width of 31 tokens -longer than the average sentence length (23) in the Penn TreeBank.\nOur overall iterated dilated CNN architecture (ID-CNN) repeatedly applies the same block of dilated convolutions to token-wise representations. This parameter sharing prevents overfitting and also provides opportunities to inject supervision on intermediate activations of the network. Similar to models that use logits produced by an RNN, the ID-CNN provides two methods for performing prediction: we can predict each token's label independently, or by running Viterbi inference in a chain structured graphical model.", "n_publication_ref": 7, "n_figure_ref": 1}, {"heading": "In experiments on CoNLL 2003 and OntoNotes", "text": "1 What we call effective input width here is known as the receptive field in the vision literature, drawing an analogy to the visual receptive field of a neuron in the retina. 5.0 English NER, we demonstrate significant speed gains of our ID-CNNs over various recurrent models, while maintaining similar F1 performance. When performing prediction using independent classification, the ID-CNN consistently outperforms a bidirectional LSTM (Bi-LSTM), and performs on par with inference in a CRF with logits from a Bi-LSTM (Bi-LSTM-CRF). As an extractor of per-token logits for a CRF, our model out-performs the Bi-LSTM-CRF. We also apply ID-CNNs to entire documents, where independent token classification is as accurate as the Bi-LSTM-CRF while decoding almost 8× faster. The clear accuracy gains resulting from incorporating broader context suggest that these models could similarly benefit many other contextsensitive NLP tasks which have until now been limited by the computational complexity of existing context-rich models. 2 2 Background", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Conditional Probability Models for Tagging", "text": "Let x = [x 1 , . . . , x T ] be our input text and y = [y 1 , . . . , y T ] be per-token output tags. Let D be the domain size of each y i . We predict the most likely y, given a conditional model P (y|x). This paper considers two factorizations of the conditional distribution. First, we have\nP (y|x) = T t=1 P (y t |F (x)),(1)\nwhere the tags are conditionally independent given some features for x. Given these features, O(D) prediction is simple and parallelizable across the length of the sequence. However, feature extraction may not necessarily be parallelizable. For example, RNN-based features require iterative passes along the length of x.\nWe also consider a linear-chain CRF model that couples all of y together:\nP (y|x) = 1 Z x T t=1 ψ t (y t |F (x))ψ p (y t , y t−1 ), (2)\nwhere ψ t is a local factor, ψ p is a pairwise factor that scores consecutive tags, and Z x is the partition function (Lafferty et al., 2001). To avoid overfitting, ψ p does not depend on the timestep t or the input x in our experiments. Prediction in this model requires global search using the O(D 2 T ) Viterbi algorithm. CRF prediction explicitly reasons about interactions among neighboring output tags, whereas prediction in the first model compiles this reasoning into the feature extraction step (Liang et al., 2008). The suitability of such compilation depends on the properties and quantity of the data. While CRF prediction requires non-trivial search in output space, it can guarantee that certain output constraints, such as for IOB tagging (Ramshaw and Marcus, 1999), will always be satisfied. It may also have better sample complexity, as it imposes more prior knowledge about the structure of the interactions among the tags (London et al., 2016). However, it has worse computational complexity than independent prediction.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Dilated Convolutions", "text": "CNNs in NLP are typically one-dimensional, applied to a sequence of vectors representing tokens rather than to a two-dimensional grid of vectors representing pixels. In this setting, a convolutional neural network layer is equivalent to applying an affine transformation, W c to a sliding window of width r tokens on either side of each token in the sequence. Here, and throughout the paper, we do not explicitly write the bias terms in affine transformations. The convolutional operator applied to each token x t with output c t is defined as:\nc t = W c r k=0 x t±k ,(3)\nwhere ⊕ is vector concatenation. Dilated convolutions perform the same operation, except rather than transforming adjacent in-puts, the convolution is defined over a wider effective input width by skipping over δ inputs at a time, where δ is the dilation width. We define the dilated convolution operator:\nc t = W c r k=0 x t±kδ .\n(4)\nA dilated convolution of width 1 is equivalent to a simple convolution. Using the same number of parameters as a simple convolution with the same radius (i.e. W c has the same dimensionality), the δ > 1 dilated convolution incorporates broader context into the representation of a token than a simple convolution.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Multi-Scale Context Aggregation", "text": "We can leverage the ability of dilated convolutions to incorporate global context without losing important local information by stacking dilated convolutions of increasing width. First described for pixel classification in computer vision, Yu and Koltun (2016) achieve state-of-the-art results on image segmentation benchmarks by stacking dilated convolutions with exponentially increasing rates of dilation, a technique they refer to as multiscale context aggregation. By feeding the outputs of each dilated convolution as the input to the next, increasingly non-local information is incorporated into each pixel's representation. Performing a dilation-1 convolution in the first layer ensures that no pixels within the effective input width of any pixel are excluded. By doubling the dilation width at each layer, the size of the effective input width grows exponentially while the number of parameters grows only linearly with the number of layers, so a pixel representation quickly incorporates rich global evidence from the entire image.\nUnfortunately, simply increasing the depth of stacked dilated CNNs causes considerable overfitting in our experiments. In response, we present Iterated Dilated CNNs (ID-CNNs), which instead apply the same small stack of dilated convolutions multiple times, each iterate taking as input the result of the last application. Repeatedly employing the same parameters in a recurrent fashion provides both broad effective input width and desirable generalization capabilities. We also obtain significant accuracy gains with a training objective that strives for accurate labeling after each iterate, allowing follow-on iterations to observe and resolve dependency violations.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Model Architecture", "text": "The network takes as input a sequence of T vectors x t , and outputs a sequence of per-class scores h t , which serve either as the local conditional distributions of Eqn. (1) or the local factors ψ t of Eqn. (2).\nWe denote the jth dilated convolutional layer of dilation width δ as D\n(j) δ . The first layer in the net- work is a dilation-1 convolution D (0)\n1 that transforms the input to a representation i t :\ni t = D (0) 1 x t (5)\nNext, L c layers of dilated convolutions of exponentially increasing dilation width are applied to i t , folding in increasingly broader context into the embedded representation of x t at each layer. Let r() denote the ReLU activation function (Glorot et al., 2011). Beginning with c t (0) = i t we define the stack of layers with the following recurrence:\nc t (j) = r D (j−1) 2 Lc−1 c t (j−1)(6)\nand add a final dilation-1 layer to the stack:\nc t (Lc+1) = r D (Lc) 1 c t (Lc)(7)\nWe refer to this stack of dilated convolutions as a block B(•), which has output resolution equal to its input resolution. To incorporate even broader context without over-fitting, we avoid making B deeper, and instead iteratively apply B L b times, introducing no extra parameters. Starting with b t\n(1) = B (i t ): b t (k) = B b t (k−1)(8)\nWe apply a simple affine transformation W o to this final representation to obtain per-class scores for each token x t :\nh t (L b ) = W o b t (L b ) (9)", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Training", "text": "Our main focus is to apply the ID-CNN an encoder to produce per-token logits for the first conditional model described in Sec. 2.1, where tags are conditionally independent given deep features, since this will enable prediction that is parallelizable across the length of the input sequence. Here, maximum likelihood training is straightforward because the likelihood decouples into the sum of the likelihoods of independent logistic regression problems for every tag, with natural parameters given by Eqn. ( 9):\n1 T T t=1 log P (y t | h t (L b ) )(10)\nWe can also use the ID-CNN as logits for the CRF model (Eqn. (2)), where the partition function and its gradient are computed using the forward-backward algorithm.\nWe next present an alternative training method that helps bridge the gap between these two techniques. Sec. 2.1 identifies that the CRF has preferable sample complexity and accuracy since prediction directly reasons in the space of structured outputs. In response, we compile some of this reasoning in output space into ID-CNN feature extraction. Instead of explicit reasoning over output labels during inference, we train the network such that each block is predictive of output labels. Subsequent blocks learn to correct dependency violations of their predecessors, refining the final sequence prediction.\nTo do so, we first define predictions of the model after each of the L b applications of the block. Let h t (k) be the result of applying the matrix W o from (9) to b t (k) , the output of block k. We minimize the average of the losses for each application of the block:\n1 L b L b k=1 1 T T t=1 log P (y t | h t (k) ). (11\n)\nBy rewarding accurate predictions after each application of the block, we learn a model where later blocks are used to refine initial predictions.\nThe loss also helps reduce the vanishing gradient problem (Hochreiter, 1998) for deep architectures. Such an approach has been applied in a variety of contexts for training very deep networks in computer vision (Romero et al., 2014;Szegedy et al., 2015;Lee et al., 2015;Gülçehre and Bengio, 2016), but not to our knowledge in NLP.\nWe apply dropout (Srivastava et al., 2014) to the raw inputs x t and to each block's output b t b) to help prevent overfitting. The version of dropout typically used in practice has the undesirable property that the randomized predictor used at train time differs from the fixed one used at test time. Ma et al. (2017) present dropout with expectationlinear regularization, which explicitly regularizes these two predictors to behave similarly. All of our best reported results include such regularization. This is the first investigation of the technique's effectiveness for NLP, including for RNNs. We encourage its further application.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Related work", "text": "The state-of-the art models for sequence labeling include an inference step that searches the space of possible output sequences of a chain-structured graphical model, or approximates this search with a beam (Collobert et al., 2011;Weiss et al., 2015;Lample et al., 2016;Ma and Hovy, 2016;Chiu and Nichols, 2016). These outperform similar systems that use the same features, but independent local predictions. On the other hand, the greedy sequential prediction (Daumé III et al., 2009) approach of Ratinov and Roth (2009), which employs lexicalized features, gazetteers, and word clusters, outperforms CRFs with similar features.\nLSTMs (Hochreiter and Schmidhuber, 1997) were used for NER as early as the CoNLL shared task in 2003 (Hammerton, 2003;Tjong Kim Sang and De Meulder, 2003). More recently, a wide variety of neural network architectures for NER have been proposed. Collobert et al. (2011) employ a one-layer CNN with pre-trained word embeddings, capitalization and lexicon features, and CRF-based prediction. Huang et al. (2015) achieved state-of-the-art accuracy on partof-speech, chunking and NER using a Bi-LSTM-CRF. Lample et al. (2016) proposed two models which incorporated Bi-LSTM-composed character embeddings alongside words: a Bi-LSTM-CRF, and a greedy stack LSTM which uses a simple shift-reduce grammar to compose words into labeled entities. Their Bi-LSTM-CRF obtained the state-of-the-art on four languages without word shape or lexicon features. Ma and Hovy (2016) use CNNs rather than LSTMs to compose characters in a Bi-LSTM-CRF, achieving state-ofthe-art performance on part-of-speech tagging and CoNLL NER without lexicons. Chiu and Nichols (2016) evaluate a similar network but propose a novel method for encoding lexicon matches, presenting results on CoNLL and OntoNotes NER. Yang et al. (2016) use GRU-CRFs with GRUcomposed character embeddings of words to train a single network on many tasks and languages.\nIn general, distributed representations for text can provide useful generalization capabilities for NER systems, since they can leverage unsupervised pre-training of distributed word representations (Turian et al., 2010;Collobert et al., 2011;Passos et al., 2014). Though our models would also likely benefit from additional features such as character representations and lexicons, we focus on simpler models which use word-embeddings alone, leaving more elaborate input representations to future work.\nIn these NER approaches, CNNs were used for low-level feature extraction that feeds into alternative architectures. Overall, end-to-end CNNs have mainly been used in NLP for sentence classification, where the output representation is lower resolution than that of the input Kim (2014); Kalchbrenner et al. (2014); ; Toutanova et al. (2015). Lei et al. (2015) present a CNN variant where convolutions adaptively skip neighboring words. While the flexibility of this model is powerful, its adaptive behavior is not well-suited to GPU acceleration.\nOur work draws on the use of dilated convolutions for image segmentation in the computer vision community (Yu and Koltun, 2016;Chen et al., 2015). Similar to our block, Yu and Koltun (2016) employ a context-module of stacked dilated convolutions of exponentially increasing dilation width. Dilated convolutions were recently applied to the task of speech generation (van den , and concurrent with this work,  posted a pre-print describing the similar ByteNet network for machine translation that uses dilated convolutions in the encoder and decoder components. Our basic model architecture is similar to that of the ByteNet encoder, except that the inputs to our model are tokens and not bytes. Additionally, we present a novel loss and parameter sharing scheme to facilitate training models on much smaller datasets than those used by . We are the first to use dilated convolutions for sequence labeling.\nThe broad effective input width of the ID-CNN helps aggregate document-level context. Ratinov and Roth (2009) incorporate document context in their greedy model by adding features based on tagged entities within a large, fixed window of tokens. Prior work has also posed a structured model that couples predictions across the whole document (Bunescu and Mooney, 2004;Sutton and McCallum, 2004;Finkel et al., 2005).", "n_publication_ref": 27, "n_figure_ref": 0}, {"heading": "Experimental Results", "text": "We describe experiments on two benchmark English named entity recognition datasets. On CoNLL-2003 English NER, our ID-CNN performs on par with a Bi-LSTM not only when used to produce per-token logits for structured inference, but the ID-CNN with greedy decoding also performs on-par with the Bi-LSTM-CRF while running at more than 14 times the speed. We also observe a performance boost in almost all models when broadening the context to incorporate entire documents, achieving an average F1 of 90.65 on CoNLL-2003, out-performing the sentence-level model while still decoding at nearly 8 times the speed of the Bi-LSTM-CRF.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Data and Evaluation", "text": "We evaluate using labeled data from the CoNLL-2003 shared task (Tjong Kim Sang and De Meulder, 2003) and OntoNotes 5.0 (Hovy et al., 2006;Pradhan et al., 2006). Following previous work, we use the same OntoNotes data split used for co-reference resolution in the CoNLL-2012 shared task (Pradhan et al., 2012). For both datasets, we convert the IOB boundary encoding to BILOU as previous work found this encoding to result in improved performance (Ratinov and Roth, 2009). As in previous work we evaluate the performance of our models using segment-level micro-averaged F1 score. Hyperparameters that resulted in the best performance on the validation set were selected via grid search. A more detailed description of the data, evaluation, optimization and data pre-processing can be found in the Appendix.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "Baselines", "text": "We compare our ID-CNN against strong LSTM and CNN baselines: a Bi-LSTM with local decoding, and one with CRF decoding (Bi-LSTM-CRF). We also compare against a non-dilated CNN architecture with the same number of convolutional layers as our dilated network (4-layer CNN) and one with enough layers to incorporate an effective input width of the same size as that of the dilated network (5-layer CNN) to demonstrate that the dilated convolutions more effectively aggregate contextual information than simple convolutions (i.e. using fewer parameters). We also compare our document-level ID-CNNs to a baseline which does not share parameters between blocks (noshare) and one that computes loss only at the last block, rather than after every iterated block of dilated convolutions (1-loss).\nWe do not compare with deeper or more elaborate CNN architectures for a number of reasons: 1) Fast train and test performance are highly desirable for NLP practitioners, and deeper models require more computation time 2) more complicated models tend to over-fit on this relatively small dataset and 3) most accurate deep CNN architectures repeatedly up-sample and down-sample the inputs. We do not compare to stacked LSTMs for similar reasons -a single LSTM is already slower than a 4-layer CNN. Since our task is sequence labeling, we desire a model that maintains the token-level resolution of the input, making dilated convolutions an elegant solution.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "CoNLL-2003 English NER", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Sentence-level prediction", "text": "Table 1 lists F1 scores of models predicting with sentence-level context on CoNLL-2003. For models that we trained, we report F1 and standard deviation obtained by averaging over 10 random restarts. The Viterbi-decoding Bi-LSTM-CRF and ID-CNN-CRF and greedy ID-CNN obtain the highest average scores, with the ID-CNN-CRF outperforming the Bi-LSTM-CRF by 0.11 points of F1 on average, and the Bi-LSTM-CRF out-performing the greedy ID-CNN by 0.11 as well. Our greedy ID-CNN outperforms the Bi-LSTM and the 4-layer CNN, which uses the same number of parameters as the ID-CNN, and performs similarly to the 5-layer CNN which uses more parameters but covers the same effective input width. All CNN models out-perform the Bi-Model F1 Ratinov and Roth (2009) 86.82 Collobert et al. (2011) 86.96 Lample et al. (2016) 90.33 Bi-LSTM 89.34 ± 0.28 4-layer CNN 89.97 ± 0.20 5-layer CNN 90.23 ± 0.16 ID-CNN 90.32 ± 0.26 Collobert et al. (2011) 88.67 Passos et al. (2014) 90.05 Lample et al. (2016) 90.20 Bi-LSTM-CRF (re-impl) 90.43 ± 0.12 ID-CNN-CRF 90.54 ± 0.18 LSTM when paired with greedy decoding, suggesting that CNNs are better token encoders than Bi-LSTMs for independent logistic regression. When paired with Viterbi decoding, our ID-CNN performs on par with the Bi-LSTM, showing that the ID-CNN is also an effective token encoder for structured inference.\nOur ID-CNN is not only a better token encoder than the Bi-LSTM but it is also faster. Table 2 lists relative decoding times on the CoNLL development set, compared to the Bi-LSTM-CRF. We report decoding times using the fastest batch size for each method. 3 The ID-CNN model decodes nearly 50% faster than the Bi-LSTM. With Viterbi decoding, the gap closes somewhat but the ID-CNN-CRF still comes out ahead, about 30% faster than the Bi-LSTM-CRF. The most vast speed improvements come when comparing the greedy ID-CNN to the Bi-LSTM-CRF -our ID-CNN is more than 14 times faster than the Bi-LSTM-CRF at test time, with comparable accuracy. The 5-layer CNN, which observes the same effective input width as the ID-CNN but with more parameters, performs at about the same speed as the ID-CNN in our experiments. With a better implementation of dilated convolutions than currently included in TensorFlow, we would expect the ID-CNN to be notably faster than   3: Comparison of models trained with and without expectation-linear dropout regularization (DR). DR improves all models.\nthe 5-layer CNN.\nWe emphasize the importance of the dropout regularizer of Ma et al. (2017) in Table 3, where we observe increased F1 for every model trained with expectation-linear dropout regularization. Dropout is important for training neural network models that generalize well, especially on relatively small NLP datasets such as CoNLL-2003. We recommend this regularizer as a simple and helpful tool for practitioners training neural networks for NLP.", "n_publication_ref": 9, "n_figure_ref": 0}, {"heading": "Document-level prediction", "text": "In Table 4 we show that adding document-level context improves every model on CoNLL-2003. Incorporating document-level context further improves our greedy ID-CNN model, attaining 90.65 average F1. We believe this model sees greater improvement with the addition of document-level context than the Bi-LSTM-CRF due to the ID-CNN learning a feature function better suited for representing broad context, in contrast with the Bi-LSTM which, though better than a simple RNN at encoding long memories of sequences, may reach its limit when provided with sequences more than 1,000 tokens long such as entire documents.\nWe also note that our combination of training objective (Eqn. 11) and tied parameters (Eqn.    5 compares models trained to incorporate entire document context using the document baselines described in Section 6.2.\nIn Table 6 we show that, in addition to being more accurate, our ID-CNN model is also much faster than the Bi-LSTM-CRF when incorporating context from entire documents, decoding at almost 8 times the speed. On these long sequences, it also tags at more than 4.5 times the speed of the greedy Bi-LSTM, demonstrative of the benefit of our ID-CNNs context-aggregating computation that does not depend on the length of the sequence.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "OntoNotes 5.0 English NER", "text": "We observe similar patterns on OntoNotes as we do on CoNLL.   icalized greedy model of Ratinov and Roth (2009), and our ID-CNN out-performs the Bi-LSTM as well as the more complex model of Durrett and Klein (2014) which leverages the parallel coreference annotation available in the OntoNotes corpus to predict named entities jointly with entity linking and co-reference. Our greedy model is out-performed by the Bi-LSTM-CRF reported in Chiu and Nichols (2016) as well as our own re-implementation, which appears to be the new state-of-the-art on this dataset. The gap between our greedy model and those using Viterbi decoding is wider than on CoNLL. We believe this is due to the more diverse set of entities in OntoNotes, which also tend to be much longer -the average length of a multi-token named entity segment in CoNLL is about one token shorter than in OntoNotes. These long entities benefit more from explicit structured constraints enforced in Viterbi decoding. Still, our ID-CNN outperforms all other greedy methods, achieving our goal of learning a better token encoder for structured prediction.\nIncorporating greater context significantly boosts the score of our greedy model on OntoNotes, whereas the Bi-LSTM-CRF performs more poorly. In Table 7, we also list the F1 of our ID-CNN model and the Bi-LSTM-CRF model trained on entire document context. For the first time, we see the score decrease when more context is added to the Bi-LSTM-CRF model, though the ID-CNN, whose sentence model a lower score than that of the Bi-LSTM-CRF, sees an increase. We believe the decrease in the Bi-LSTM-CRF model occurs because of the nature of the OntoNotes dataset compared to CoNLL-2003: CoNLL-2003 contains a particularly high proportion of ambiguous entities, 7 perhaps leading to more benefit from document context that helps with disambiguation. In this scenario, adding the wider context may just add noise to the high-scoring Bi-LSTM-CRF model, whereas the less accurate dilated model can still benefit from the refined predictions of the iterated dilated convolutions.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Conclusion", "text": "We present iterated dilated convolutional neural networks, fast token encoders that efficiently aggregate broad context without losing resolution. These provide impressive speed improvements for sequence labeling, particularly when processing entire documents at a time. In the future we hope to extend this work to NLP tasks with richer structured output, such as parsing.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Acknowledgments", "text": "We thank Subhransu Maji and Luke Vilnis for helpful discussions, and Brendan O'Connor, Yoav Goldberg, the UMass NLP reading group and many anonymous reviewers for constructive comments on various drafts of the paper. We are also grateful to Guillaume Lample for sharing his pretrained word embeddings. This work was supported in part by the Center for Intelligent Information Retrieval, in part by DARPA under agreement number FA8750-13-2-0020, in part by Defense Advanced Research Agency (DARPA) contract number HR0011-15-2-0036, in part by the National Science Foundation (NSF) grant number DMR-1534431, and in part by the National Science Foundation (NSF) grant number IIS-1514053. The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright notation thereon. Any opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect those of the sponsor.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "The corpus contains a very high ratio of metonymic references (city names standing for sport teams", "journal": "", "year": "", "authors": "Martın Abadi; Ashish Agarwal; Paul Barham; Eugene Brevdo; Zhifeng Chen; Craig Citro; Greg S Corrado"}, {"title": "Tensorflow: Large-scale machine learning on heterogeneous systems", "journal": "", "year": "2015", "authors": "Andy Davis; Jeffrey Dean; Matthieu Devin"}, {"title": "Collective information extraction with relational markov networks", "journal": "", "year": "2004", "authors": "Razvan Bunescu; Raymond J Mooney"}, {"title": "Semantic image segmentation with deep convolutional nets and fully connected crfs", "journal": "", "year": "2015", "authors": "Liang-Chieh Chen; George Papandreou; Iasonas Kokkinos; Kevin Murphy; Alan L Yuille"}, {"title": "Named entity recognition with bidirectional lstm-cnns", "journal": "", "year": "2016", "authors": "P C Jason; Eric Chiu;  Nichols"}, {"title": "Natural language processing (almost) from scratch", "journal": "Journal of Machine Learning Research", "year": "2011-08", "authors": "Ronan Collobert; Jason Weston; Léon Bottou; Michael Karlen; Koray Kavukcuoglu; Pavel Kuksa"}, {"title": "Search-based structured prediction", "journal": "", "year": "2009", "authors": "Hal Daumé; Iii ; John Langford; Daniel Marcu"}, {"title": "A joint model for entity analysis: Coreference, typing and linking", "journal": "Transactions of the Association for Computational Linguistics", "year": "2014", "authors": "Greg Durrett; Dan Klein"}, {"title": "Incorporating non-local information into information extraction systems by gibbs sampling", "journal": "", "year": "2005", "authors": "Jenny Rose Finkel; Trond Grenager; Christopher Manning"}, {"title": "Deep sparse rectifier neural networks", "journal": "", "year": "2011", "authors": "Xavier Glorot; Antoine Bordes; Yoshua Bengio"}, {"title": "Knowledge matters: Importance of prior information for optimization", "journal": "Journal of Machine Learning Research", "year": "2016", "authors": "Ç Alar Gülçehre; Yoshua Bengio"}, {"title": "Named entity recognition with long short-term memory", "journal": "Association for Computational Linguistics", "year": "2003", "authors": "James Hammerton"}, {"title": "The vanishing gradient problem during learning recurrent neural nets and problem solutions", "journal": "International Journal of Uncertainty", "year": "1998", "authors": "Sepp Hochreiter"}, {"title": "Long short-term memory", "journal": "Neural Computation", "year": "1997", "authors": "Sepp Hochreiter;  Schmidhuber"}, {"title": "Ontonotes: the 90% solution", "journal": "", "year": "2006", "authors": "Eduard Hovy; Mitchell Marcus; Martha Palmer; Lance Ramshaw; Ralph Weischedel"}, {"title": "Bidirectional lstm-crf models for sequence tagging", "journal": "", "year": "2015", "authors": "Zhiheng Huang; Wei Xu; Kai Yu"}, {"title": "Neural machine translation in linear time", "journal": "", "year": "2016", "authors": "Nal Kalchbrenner; Lasse Espeholt; Karen Simonyan; Aaron Van Den Oord; Alex Graves; Koray Kavukcuoglu"}, {"title": "A convolutional neural network for modelling sentences", "journal": "", "year": "2014", "authors": "Nal Kalchbrenner; Edward Grefenstette; Phil Blunsom"}, {"title": "Convolutional neural networks for sentence classification", "journal": "", "year": "2014", "authors": "Yoon Kim"}, {"title": "Conditional random fields: Probabilistic models for segmenting and labeling sequence data", "journal": "", "year": "2001", "authors": "John D Lafferty; Andrew Mccallum; Fernando C N Pereira"}, {"title": "Neural architectures for named entity recognition", "journal": "", "year": "2016", "authors": "Guillaume Lample; Miguel Ballesteros; Sandeep Subramanian; Kazuya Kawakami; Chris Dyer"}, {"title": "Deeplysupervised nets", "journal": "", "year": "2015", "authors": "Chen-Yu Lee; Saining Xie; W Patrick; Zhengyou Gallagher; Zhuowen Zhang;  Tu"}, {"title": "Molding cnns for text: non-linear, non-consecutive convolutions", "journal": "", "year": "2015", "authors": "Tao Lei; Regina Barzilay; Tommi Jaakkola"}, {"title": "Structure compilation: trading structure for features", "journal": "ACM", "year": "2008", "authors": "Percy Liang; Hal Daumé; Iii ; Dan Klein"}, {"title": "Finding Function in Form: Compositional Character Models for Open Vocabulary Word Representation", "journal": "", "year": "2015", "authors": "Wang Ling; Tiago Luís; Luís Marujo; Ramón Fernandez Astudillo; Silvio Amir; Chris Dyer; Alan W Black; Isabel Trancoso"}, {"title": "Stability and generalization in structured prediction", "journal": "Journal of Machine Learning Research", "year": "2016", "authors": "Ben London; Bert Huang; Lise Getoor"}, {"title": "Dropout with expectation-linear regularization", "journal": "", "year": "2017", "authors": "Xuezhe Ma; Yingkai Gaom; Zhiting Hu; Yaoliang Yu; Yuntian Deng; Eduard Hovy"}, {"title": "End-to-end sequence labeling via bi-directional lstm-cnns-crf", "journal": "", "year": "2016", "authors": "Xuezhe Ma; Eduard Hovy"}, {"title": "Wavenet: A generative model for raw audio", "journal": "", "year": "2016", "authors": "Aaron Van Den Oord; Sander Dieleman; Heiga Zen; Karen Simonyan; Oriol Vinyals; Alex Graves; Nal Kalchbrenner; Andrew Senior; Koray Kavukcuoglu"}, {"title": "Lexicon infused phrase embeddings for named entity resolution", "journal": "", "year": "2014", "authors": "Alexandre Passos; Vineet Kumar; Andrew Mccallum"}, {"title": "Towards robust linguistic analysis using ontonotes", "journal": "", "year": "2006", "authors": "Alessandro Sameer Pradhan; Nianwen Moschitti; Hwee Tou Xue; Anders Ng; Olga Bj Orkelund; Yuchen Uryupina; Zhi Zhang;  Zhong"}, {"title": "Conll-2012 shared task: Modeling multilingual unrestricted coreference in ontonotes", "journal": "", "year": "2012", "authors": "Alessandro Sameer Pradhan; Nianwen Moschitti; Olga Xue; Yuchen Uryupina;  Zhang"}, {"title": "Text chunking using transformation-based learning", "journal": "Springer", "year": "1999", "authors": "A Lance; Mitchell P Ramshaw;  Marcus"}, {"title": "Design challenges and misconceptions in named entity recognition", "journal": "Association for Computational Linguistics", "year": "2009", "authors": "Lev Ratinov; Dan Roth"}, {"title": "Fitnets: Hints for thin deep nets", "journal": "", "year": "2014", "authors": "Adriana Romero; Nicolas Ballas; Samira Ebrahimi Kahou; Antoine Chassang; Carlo Gatta; Yoshua Bengio"}, {"title": "Dropout: a simple way to prevent neural networks from overfitting", "journal": "Journal of Machine Learning Research", "year": "2014", "authors": "Nitish Srivastava; Geoffrey E Hinton; Alex Krizhevsky; Ilya Sutskever; Ruslan Salakhutdinov"}, {"title": "Collective segmentation and labeling of distant entities in information extraction", "journal": "", "year": "2004", "authors": "Charles Sutton; Andrew Mccallum"}, {"title": "Going deeper with convolutions", "journal": "", "year": "2015", "authors": "Christian Szegedy; Wei Liu; Yangqing Jia; Pierre Sermanet; Scott Reed; Dragomir Anguelov; Dumitru Erhan; Vincent Vanhoucke; Andrew Rabinovich"}, {"title": "Introduction to the CoNLL-2003 shared task: Language-independent named entity recognition", "journal": "", "year": "2003", "authors": "Erik F Tjong Kim Sang; Fien De Meulder"}, {"title": "Representing text for joint embedding of text and knowledge bases", "journal": "Association for Computational Linguistics", "year": "2015", "authors": "Kristina Toutanova; Danqi Chen; Patrick Pantel; Hoifung Poon; Pallavi Choudhury; Michael Gamon"}, {"title": "Word representations: a simple and general method for semi-supervised learning", "journal": "Association for Computational Linguistics", "year": "2010", "authors": "Joseph Turian; Lev Ratinov; Yoshua Bengio"}, {"title": "Structured training for neural network transition-based parsing", "journal": "", "year": "2015", "authors": "David Weiss; Chris Alberti; Michael Collins; Slav Petrov"}, {"title": "Multi-task cross-lingual sequence tagging from scratch", "journal": "", "year": "2016", "authors": "Zhilin Yang; Ruslan Salakhutdinov; William Cohen"}, {"title": "Multi-scale context aggregation by dilated convolutions", "journal": "", "year": "2016", "authors": "Fisher Yu; Vladlen Koltun"}, {"title": "Character-level convolutional networks for text classification", "journal": "", "year": "2015", "authors": "Xiang Zhang; Junbo Zhao; Yann Lecun"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: A dilated CNN block with maximum dilation width 4 and filter width 3. Neurons contributing to a single highlighted neuron in the last layer are also highlighted.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "", "figure_data": ": F1 score of models observing sentence-level context. No models use character embed-dings or lexicons. Top models are greedy, bottommodels use Viterbi inference ."}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "", "figure_data": ": Relative test-time speed of sentence mod-els, using the fastest batch size for each model. 5Modelw/o DRw/ DRBi-LSTM88.89 ± 0.30 89.34 ± 0.284-layer CNN89.74 ± 0.23 89.97 ± 0.205-layer CNN89.93 ± 0.32 90.23 ± 0.16Bi-LSTM-CRF90.01 ± 0.23 90.43 ± 0.124-layer ID-CNN 89.65 ± 0.30 90.32 ± 0.26Table"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "", "figure_data": ": F1 score of models trained to predictdocument-at-a-time. Our greedy ID-CNN modelperforms as well as the Bi-LSTM-CRF.ModelF1ID-CNN noshare 89.81 ± 0.19ID-CNN 1-loss90.06 ± 0.19ID-CNN90.65 ± 0.15"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "", "figure_data": ": Comparing ID-CNNs with 1) back-propagating loss only from the final layer (1-loss)and 2) untied parameters across blocks (noshare)8) more effectively learns to aggregate this broadcontext than a vanilla cross-entropy loss or deepCNN back-propagated from the final neural net-work layer. Table"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "lists overall F1 scores of our models compared to those in the existing literature. The greedy Bi-LSTM out-performs the lex-", "figure_data": "ModelSpeedBi-LSTM-CRF 1×Bi-LSTM4.60×ID-CNN7.96×"}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "Relative test-time speed of document models (fastest batch size for each model).", "figure_data": "ModelF1SpeedRatinov and Roth (2009) 6 83.45Durrett and Klein (2014) 84.04Chiu and Nichols (2016)86.19 ± 0.25Bi-LSTM-CRF86.99 ± 0.22 1×Bi-LSTM-CRF-Doc86.81 ± 0.18 1.32×Bi-LSTM83.76 ± 0.10 24.44×ID-CNN-CRF (1 block)86.84 ± 0.19 1.83×ID-CNN-Doc (3 blocks)85.76 ± 0.13 21.19×ID-CNN (3 blocks)85.27 ± 0.24 13.21×ID-CNN (1 block)84.28 ± 0.10 26.01×"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "F1 score of sentence and document models on OntoNotes.", "figure_data": ""}], "doi": ""}