{"authors": "Xiang Ren; Nanyun Peng; William Yang Wang", "pub_date": "", "title": "Scalable Construction and Reasoning of Massive Knowledge Bases -Proposal for a Tutorial at NAACL 2018", "abstract": "In today's information-based society, there is abundant knowledge out there carried in the form of natural language texts (e.g., news articles, social media posts, scientific publications), which spans across various domains (e.g., corporate documents, advertisements, legal acts, medical reports), and grows at an astonishing rate. How to turn such massive and unstructured text data into structured, actionable knowledge for computational machines, and furthermore, how to teach machines learn to reason and complete the extracted knowledge is a grand challenge to the research community.", "sections": [{"heading": "", "text": "Traditional IE systems assume abundant human annotations for training high quality machine learning models, which is impractical when trying to deploy IE systems to a broad range of domains, settings and languages.\nIn the first part of the tutorial, we introduce how to extract structured facts (i.e., entities and their relations of different types) from text corpora to construct knowledge bases, with a focus on methods that are minimally-supervised and domain-independent for timely knowledge base construction across various application domains.\nIn the second part, we introduce how to leverage other knowledge, such as the distributional statistics of characters and words, the annotations for other tasks and other domains, and the linguistics and problem structures, to combat the problem of inadequate supervision, and conduct low-resource information extraction.\nIn the third part, we describe recent advances in knowledge base reasoning. We start with the gentle introduction to the literature, focusing on pathbased and embedding based methods. We then describe DeepPath, a recent attempt of using deep reinforcement learning to combine the best of both worlds for knowledge base reasoning.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Introduction", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Motivation.", "text": "The success of data mining and artificial intelligence technology is largely attributed to the efficient and effective analysis of structured data. The construction of a well-structured, machine-actionable knowledge base (KB) from raw (unstructured or loosely-structured) data sources is often the premise of consequent applications. Although the majority of existing data generated in our society is unstructured, big data leads to big opportunities to uncover structures of real-world entities (e.g., person, product), attributes (e.g., age, weight), relations (e.g., employee of, manufacture) from massive text corpora. By integrating these semantic structures, one can construct a powerful KB as a conceptual abstraction of the original corpus. The constructed knowledge base will facilitate browsing information and inferring knowledge that are otherwise widely scattered in the text corpora. Computational machines can effectively perform algorithmic analysis at a large scale over these KBs, and apply the new insights to improve human productivity in various downstream tasks.\nOur Focus.\nIn this tutorial, we focus our discussion on two tightly related problems: automatic construction of knowledge bases from text, and knowledge reasoning for knowledge base completion. While traditional information extraction techniques have heavy reliance on human-annotated data, our tutorial will devote more time on introducing methods that can reduce human efforts in the process, by leveraging external knowledge sources (e.g., distant supervision) and exploiting rich data redundancy in massive text corpora (e.g., weak supervision). We also discuss how data sources from various domains and languages could opens up tremendous opportunities to leverage and transfer existing knowledge about domains, tasks and language, and help knowledge extraction in low-resource settings with minimal supervision. In the reasoning part, we aim to leverage the existing background knowledge and design various algorithms to fill in the missing link between entities in the KB, given the extracted KBs are likely incomplete. More specifically, this part will introduce two lines of research for KB reasoning: path-based and embedding-based methods.\nTopics to be covered in this tutorial. The first 2/3 of this tutorial presents a comprehensive overview of the information extraction techniques developed in recent years for constructing knowledge bases (see also Section 2 for a more detailed outline). We will discuss the following key issues: (1) data-driven approaches for mining quality phrases from massive, unstructured text corpora; (2) entity recognition and typing: preliminaries, challenges, and methodologies; and (3) relation extraction: previous efforts, limitations, recent progress, and a joint entity and relation extraction method using distant supervision; (4) multi-task and multi-domain learning for lowresource information extraction; (5) distill linguistic knowledge into neural models to help low-resource information extraction. The second half of the tutorial presents a comprehensive overview of KB reasoning techniques. For path-based methods, we will first describe the Path-Ranking Algorithm (PRA) (Lao et al., 2011) and briefly describe extensions such as ProPPR . Our tutorial will also cover the recent integration of PRA with recurrent neural networks. For the embedding based method, we will briefly describe RESCAL (Nickel et al., 2011) and TransE (Bordes et al., 2013). Finally, we discuss DeepPath (Xiong et al., 2017), a novel deep reinforcement learning model that combines the embedding and path-based approaches for the learning to reason problem.\nResearch Impact. Our phrase mining tool, SegPhrase (Liu et al., 2015), won the grand prize of Yelp Dataset Challenge 1 and was used by TripAdvisor in productions 2 . Our entity recognition and typing system, ClusType , was shipped as part of the products in Microsoft Bing and U.S. Army Research Lab. We built the first named entity recognizer on Chinese social media Dredze, 2015, 2016) and closed the gap between NER on English and Chinese social media. The same technique was applied to build the first relation extractor for cross-sentence, n-ary relation extraction between drug, gene, and mutation (Peng et al., 2017).\nDuration and Sessions. The duration of the tutorial is flexible: It is expected to be 3 hours, but it can be extended into 6 hours, based on the need of the conference. The outline presented here is for the 3-hour tutorial. For longer duration of the tutorial, we plan to extend entity and relation extraction parts, and add in more case studies and applications.\nRelevance to ACL. Machine \"reading\" and \"reasoning\" of large text corpora have long been the interests to CL and NLP communities, especially when people now are exposed to an explosion of information in the form of free text. Extracting structured information is key to understanding messy and scattered raw data, and effective reasoning tools are critical for the use of KBs in downstream tasks like QA. This tutorial will present an organized picture of recent research on knowledge base construction and reasoning. We will show how exciting and surprising knowledge can be discovered from your own not so well-structured raw corpora, and such incomplete KBs can be further used to derive new insights and more complex knowledge with reasoning techniques.", "n_publication_ref": 7, "n_figure_ref": 0}, {"heading": "Outline", "text": "This tutorial presents a comprehensive overview of techniques for automatic knowledge base construction from text data (especially from a large, domain-specific text corpora), and techniques for reasoning over large-scale knowledge bases. We will discuss the following key issues: ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Previous Editions and Related Tutorials", "text": "Most of the previous tutorials focused exclusively on the knowledge base construction aspect. In the proposed tutorial, we will give a systematic discussion on the problem of knowledge base reasoning, for which extensive studies have been conducted recently but systematic tutorials are lacking. This tutorial also presents recent advances in applying distant and weak supervision to the extraction of structured facts in knowledge base construction, in addition to the traditional supervised techniques and rule-based approaches.\nTarget audience and prerequisites.\nResearchers and practitioners in the field of natural language processing, computational linguistic, text mining, information retrieval, semantic web and machine learning. While the audience with a good background in these areas would benefit most from this tutorial, we believe the material to be presented would give general audience and newcomers an introductory pointer to the current work and important research topics in this field, and inspire them to learn more. Only preliminary knowledge about NLP, algorithms and their applications are needed. We expect there will be around 70 people interested in our tutorial.\nTutorial material and equipment. We will provide attendees a website and upload our tutorial materials (slides, references, softwares). There is no copyright issue. Standard equipment will be enough for our tutorial.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Construction and Querying of Large-scale Knowledge Bases", "journal": "", "year": "", "authors": "X Ren; Y Su; X Yan"}, {"title": "Knowledge Graph Construction From Text", "journal": "", "year": "", "authors": ": J Conference Tutorial; S Pujara; B Singh;  Dalvi"}, {"title": "Constructing Structured Information Networks from Massive Text Corpora", "journal": "", "year": "", "authors": "X Ren; M Jiang; J Shang; J Han"}, {"title": "Scalable Probabilistic Logics\" (IJCAI'16", "journal": "", "year": "", "authors": "W Y Wang; W Cohen"}, {"title": "Statistical Relational Learning for NLP", "journal": "", "year": "", "authors": "W Y Wang; W Cohen"}, {"title": "Constructing and Mining Web-scale Knowledge Graphs", "journal": "", "year": "", "authors": "E Gabrilovichn; N Usunier"}, {"title": "Automatic Entity Recognition and Typing in Massive Text Corpora", "journal": "WWW'16", "year": "", "authors": "X Ren; A El-Kishky; C Wang; J Han"}, {"title": "Automatic Entity Recognition and Typing from Massive Text Corpora: A Phrase and Network Mining Approach", "journal": "", "year": "", "authors": "X Ren; A El-Kishky; C Wang; J Han"}, {"title": "Snowball: Extracting relations from large plain-text collections", "journal": "In ACM conference on Digital libraries", "year": "2000", "authors": "Eugene Agichtein; Luis Gravano"}, {"title": "A review of relation extraction. Literature review for Language and Statistics II", "journal": "", "year": "2007", "authors": "Nguyen Bach; Sameer Badaskar"}, {"title": "Freebase: a collaboratively created graph database for structuring human knowledge", "journal": "", "year": "2008", "authors": "Kurt Bollacker; Colin Evans; Praveen Paritosh; Tim Sturge; Jamie Taylor"}, {"title": "Translating embeddings for modeling multi-relational data", "journal": "", "year": "2013", "authors": "Antoine Bordes; Nicolas Usunier; Alberto Garcia-Duran; Jason Weston; Oksana Yakhnenko"}, {"title": "Coupled semi-supervised learning for information extraction", "journal": "", "year": "2010", "authors": "Andrew Carlson; Justin Betteridge; C Richard;  Wang; Tom M Estevam R Hruschka;  Mitchell"}, {"title": "Web-scale information extraction in knowitall:(preliminary results)", "journal": "ACM", "year": "2004", "authors": "Oren Etzioni; Michael Cafarella; Doug Downey; Stanley Kok; Ana-Maria Popescu; Tal Shaked; Stephen Soderland; S Daniel; Alexander Weld;  Yates"}, {"title": "Entity categorization over large document collections", "journal": "", "year": "2008", "authors": "Venkatesh Ganti; C Arnd; Rares König;  Vernica"}, {"title": "Improved pattern learning for bootstrapped entity extraction", "journal": "", "year": "2014", "authors": "Sonal Gupta; Christopher D Manning"}, {"title": "Seisa: set expansion by iterative similarity aggregation", "journal": "WWW", "year": "2011", "authors": "Yeye He; Dong Xin"}, {"title": "Knowledge-based weak supervision for information extraction of overlapping relations", "journal": "", "year": "2011", "authors": "Raphael Hoffmann; Congle Zhang; Xiao Ling; Luke Zettlemoyer; Daniel S Weld"}, {"title": "Inducing domain-specific semantic class taggers from (almost) nothing", "journal": "", "year": "2010", "authors": "Ruihong Huang; Ellen Riloff"}, {"title": "Simple semi-supervised dependency parsing", "journal": "ACL-HLT", "year": "2008", "authors": "Terry Koo; Xavier Carreras; Michael Collins"}, {"title": "Random walk inference and learning in a large scale knowledge base", "journal": "", "year": "2011", "authors": "Ni Lao; Tom Mitchell; William W Cohen"}, {"title": "Incremental joint extraction of entity mentions and relations", "journal": "", "year": "2014", "authors": "Qi Li; Heng Ji"}, {"title": "Mining evidences for named entity disambiguation", "journal": "ACM", "year": "2013", "authors": "Yang Li; Chi Wang; Fangqiu Han; Jiawei Han; Dan Roth; Xifeng Yan"}, {"title": "Annotating and searching web tables using entities, types and relationships", "journal": "", "year": "2010", "authors": "Girija Limaye; Sunita Sarawagi; Soumen Chakrabarti"}, {"title": "Fine-grained entity recognition", "journal": "", "year": "2012", "authors": "Xiao Ling;  Daniel S Weld"}, {"title": "Mining quality phrases from massive text corpora", "journal": "", "year": "2015", "authors": "Jialu Liu; Jingbo Shang; Chi Wang; Xiang Ren; Jiawei Han"}, {"title": "Non-projective dependency parsing using spanning tree algorithms", "journal": "", "year": "2005", "authors": "Ryan Mcdonald; Fernando Pereira; Kiril Ribarov"}, {"title": "Entity extraction without language-specific resources", "journal": "Association for Computational Linguistics", "year": "2002", "authors": "Paul Mcnamee; James Mayfield"}, {"title": "Distant supervision for relation extraction without labeled data", "journal": "", "year": "2009", "authors": "Mike Mintz; Steven Bills"}, {"title": "A three-way model for collective learning on multi-relational data", "journal": "", "year": "2011", "authors": "Maximilian Nickel; Hans-Peter Volker Tresp;  Kriegel"}, {"title": "Named entity recognition for chinese social media with jointly trained embeddings", "journal": "", "year": "2015", "authors": "Nanyun Peng; Mark Dredze"}, {"title": "Improving named entity recognition for chinese social media via learning segmentation representations", "journal": "", "year": "2016", "authors": "Nanyun Peng; Mark Dredze"}, {"title": "Cross-sentence n-ary relation extraction with graph lstms", "journal": "Transactions of the Association for Computational Linguistics", "year": "2017", "authors": "Nanyun Peng; Hoifung Poon; Chris Quirk; Kristina Toutanova; Wen-Tau Yih"}, {"title": "The use of classifiers in sequential inference", "journal": "", "year": "2001", "authors": "Vasin Punyakanok; Dan Roth"}, {"title": "Design challenges and misconceptions in named entity recognition", "journal": "", "year": "2009", "authors": "Lev Ratinov; Dan Roth"}, {"title": "ClusType: Effective entity recognition and typing by relation phrase-based clustering", "journal": "", "year": "2015", "authors": "Xiang Ren; Ahmed El-Kishky; Chi Wang; Fangbo Tao; Clare R Voss; Jiawei Han"}, {"title": "AFET: Automatic fine-grained entity typing by hierarchical partial-label embedding", "journal": "", "year": "2016", "authors": "Xiang Ren; Wenqi He; Meng Qu; Lifu Huang; Ji Heng; Jiawei Han"}, {"title": "Label noise reduction in entity typing by heterogeneous partial-label embedding", "journal": "", "year": "2016", "authors": "Xiang Ren; Wenqi He; Meng Qu; Clare R Voss; Heng Ji; Jiawei Han"}, {"title": "CoType: Joint extraction of typed entities and relations with knowledge bases", "journal": "", "year": "2017", "authors": "Xiang Ren; Zeqiu Wu; Wenqi He; Meng Qu; Clare R Voss; Heng Ji; F Tarek; Jiawei Abdelzaher;  Han"}, {"title": "Entity linking with a knowledge base: Issues, techniques, and solutions", "journal": "TKDE", "year": "2014", "authors": "Wei Shen; Jianyong Wang; Jiawei Han"}, {"title": "On generating characteristic-rich question sets for qa evaluation", "journal": "", "year": "2016", "authors": "Yu Su; Huan Sun; Brian Sadler; Mudhakar Srivatsa; Izzeddin Gur; Zenghui Yan; Xifeng Yan"}, {"title": "Mining heterogeneous information networks: a structural analysis approach", "journal": "SIGKDD Explorations", "year": "2013", "authors": "Yizhou Sun; Jiawei Han"}, {"title": "Pte: Predictive text embedding through large-scale heterogeneous text networks", "journal": "ACM", "year": "2015", "authors": "Jian Tang; Meng Qu; Qiaozhu Mei"}, {"title": "Word representations: a simple and general method for semi-supervised learning", "journal": "", "year": "2010", "authors": "Joseph Turian; Lev Ratinov; Yoshua Bengio"}, {"title": "Programming with personalized pagerank: a locally groundable first-order probabilistic logic", "journal": "ACM", "year": "2013", "authors": "Yang William; Kathryn Wang; William W Mazaitis;  Cohen"}, {"title": "Probase: A probabilistic taxonomy for text understanding", "journal": "ACM", "year": "2012", "authors": "Wentao Wu; Hongsong Li; Haixun Wang; Kenny Q Zhu"}, {"title": "Deeppath: A reinforcement learning method for knowledge graph reasoning", "journal": "EMNLP", "year": "2017", "authors": "Wenhan Xiong; Thien Hoang; William Yang Wang"}, {"title": "A unified statistical model for the identification of english basenp", "journal": "", "year": "2000", "authors": "Endong Xun; Changning Huang; Ming Zhou"}, {"title": "Infogather: entity augmentation and attribute discovery by holistic matching with web tables", "journal": "", "year": "2012", "authors": "Mohamed Yakout; Kris Ganjam; Kaushik Chakrabarti; Surajit Chaudhuri"}, {"title": "Exploring various knowledge in relation extraction", "journal": "", "year": "2005", "authors": "Guodong Zhou; Jian Su; Jie Zhang; Min Zhang"}], "figures": [{"figure_label": "", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Language, and he has received paper awards and honors from CIKM, ASRU, and EMNLP. Website: http://www. cs.ucsb.edu/~william/.", "figure_data": "A. Pattern-based boostrapping meth-ICASSP, ASRU, SLT, Machine Learning, andC. Sequence labeling models ii. The DeepPath Algorithmods Computer Speech &(b) Entity Recognition and Typing in A iii. Imitation LearningB. Seed examples selectionLarge, Domain-specific Corpus iv. Experimental Results1. Overview (a) Knowledge base: A little history (b) Knowledge base preliminaries (c) Knowledge base construction: overview i. From phrases to entities and relations An 2. Phrase Mining from Massive Text Corpora C. DIPRE system D. KnowItAll system E. Snowball system ii. Distant supervision (DS) methods A. Distant supervision for RE: A typi-cal workflow B. Challenges of DS: noisy candidate labels C. Noise-robust DS models iii. Joint extraction of entities and rela-tions A. Supervised methods: linear pro-gramming and sequence models B. CoType: A distantly-supervised method (a) Preliminaries 5. Transfer Knowledge for Low Resource In-i. Criteria of Quality Phrases formation Extraction ii. The Origin of Phrase Mining A. Automatic Term Recognition B. Supervised Noun Phrase Chunking C. Dependency Parser-based Methods (b) Data-Driven Phrase Mining in A Large Text Corpus i. Unsupervised Frequency-based Meth-ods ii. Weakly Supervised Method: Seg-Phrase iii. Automated Quality Phrase A. No Extra Human Effort B. Support Multiple Languages C. High Performance 3. Automated Entity Recognition and Typing (a) Preliminaries i. Entities that are explicitly typed and (a) Multi-task and multi-domain learning for named entity recognition (b) Cross-lingual entity extraction (c) Distilling linguistics knowledge into rela-tion extraction system 6. Knowledge Base Reasoning: Background and State-of-the-Arts (a) Preliminaries i. KB Reasoning and Information Ex-traction A. Difference with IE ii. Challenges of KB Reasoning A. Noisy Background Knowledge B. Combinatorial explosion and huge search space C. Scalability linked externally with documents. A. Wikilinks and ClueWeb corpora B. Probase: A Probabilistic Taxonomy C. MENED: Mining evidence outside referent knowledge bases ii. Entities that can be extracted within text. iii. Traditional named entity recognition (NER) systems A. Entity extraction as a sequence la-(b) Path-Based Approaches i. The Path-Finding Algorithm ii. ProPPR iii. Combining PRA and Recurrent Neural Networks (c) Embedding-Based Approaches i. RESCAL ii. TransE iii. Other Recent Studiesi. Semi-supervised approaches 7. Research Frontier A. Combining local and global features ii. Weakly-supervised approaches 3 Organizers A. Pattern-based bootstrapping meth-Xiang Ren, Assistant Professor, Department ods of Computer Science, University of Southern B. SEISA: A set expansion method California. His research focuses on creating C. Extracting entities from web tables computational tools for better understanding iii. Distantly-supervised approaches and exploring massive text data. He has pub-A. SemTagger: Seed-based contextual lished over 25 papers in major conferences. classifier for entity typing He received Google PhD Fellowship, KDD B. ClusType: Effective entity recogni-tion by relation phrase-based clus-tering iv. Fine-grained entity typing approaches A. FIGER: Multi-label classification Rising Star by Microsoft, Yahoo!-DAIS Re-search Excellence Award, C. W. Gear Out-standing Graduate Student Award by UIUC and Yelp Dataset Challenge Award. Mr. Ren has rich experiences in delivering tutorials in with automatically annotated data major conferences, including SIGKDD 2015, B. Embedding methods for entity typ-SIGMOD 2016 and WWW 2017. Homepage: ing: AFET and WSABIE http://xren7.web.engr.illinois.edu/. v. Label noise reduction in distant super-Nanyun Peng is a Research Assistant Pro-vision fessor at the Department of Computer Sci-A. Noisy type issue in distant supervi-ence, and a Computer Scientist at the Infor-sion mation Sciences Institute, University of South-B. Simple pruning heuristics C. Partial-label learning methods D. Label noise reduction by heteroge-ern California. She is broadly interested in Natural Language Processing, Machine Learn-ing, and Information Extraction. Her re-neous partial-label embedding 4. Automated Extraction of Structured Entity Relationships (a) Preliminaries of relation extraction (RE) i. Basic concepts: relation instance, re-lation mention ii. Explicit relation vs. implicit relation search focuses on low-resource information ex-traction, creative language generation, and phonology/morphology modeling. Nanyun is the recipient of the Johns Hopkins University 2016 Fred Jelinek Fellowship. She has a back-ground in computational linguistics and eco-nomics and holds BAs in both. Home page: http://www.vnpeng.net. iii. Downstream applications William Wang is an Assistant Professor at A. Knowledge base completion B. Question answering systems (b) Traditional supervised RE systems i. Supervised RE methods A. Supervised models B. Features for relation extraction C. Training data D. Evaluation of RE task ii. Systems from Stanford and IBM the Department of Computer Science, Uni-versity of California, Santa Barbara. He re-ceived his PhD from Carnegie Mellon Uni-versity, where he worked on scalable prob-abilistic reasoning language ProPPR with William Cohen. He focuses on information extraction and he is the faculty author of DeepPath-the first deep reinforcement learn-ing system for multi-hop knowledge reason-ing. He has published more than 40 papersbeling task (d) DeepPath: Reinforcement Learning for(c) Extracting typed relations from A Mas-at leading conferences and journals includingB. Classic coarse types and manually-KB Reasoningsive Corpus ACL, EMNLP, NAACL, COLING, IJCAI,annotated corpora i. Problem Formulationi. Weak supervision methods CIKM, SIGDIAL, IJCNLP, INTERSPEECH,"}], "doi": ""}