{"authors": "", "pub_date": "", "title": "", "abstract": "", "sections": [{"heading": "Preface", "text": "Welcome to the first Workshop on Human-Computer Question Answering (HCQA)! Question answering is a central task in natural language processing (NLP). Unlike other NLP tasks, it also is easy for non-experts to understand when question answering systems perform well (or fail). The goal of this workshop is to bring the community together to discuss the state of the art of question answering and interactively compete with top human trivia masters.\nThis workshop highlights question answering on the real-world task of quiz bowl, a trivia game in which competitors are asked to identify entities such as battles, novels, and scientific terms. In quiz bowl, a moderator reads a paragraph-long question to two teams, and players are permitted to interrupt the moderator (or \"buzz in\") with a guess if they feel confident. This setting is especially interesting because acquiring more features (clues) comes with an added cost (the other team may buzz in before you). While computerized question answering systems have previously had success against humans, this workshop will be the first to pit different systems against each other and then have that winner face off against a top human team.\nQuestion answering is a task interesting to both academia and industry. This workshop brings people from both sides to discuss recent progress in QA. We will have a presentation from the IBM Watson team talking about their new Watson Discovery Advisor and the challenges of QA in the industrial setting. Peter Clark will talk about new types of question answering problems that he and his team are solving at the Allen Institute for AI. We also have Zhengdong Lu, Jason Weston, and Richard Socher talking about recent neural network approaches to QA. This year we have nine papers covering a variety of approaches to QA, including neural networks, crowdsourcing, knowledge graph search, and paraphrasing. Besides common QA tasks such as machine comprehension, (open-domain) factoid QA, we are also excited to see new topics on error analysis of QA systems by crowdsourcing and alignment between text description and paintings for art questions.\nAt the end of the workshop, we will have a dual computer-human tournament to test entrants' question answering systems against each other and against the top human trivia masters. Enjoy the match! Finally, we invite you to enjoy this volume and we are looking forward to seeing you in San Diego! ", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Question-answering in an industrial setting Charley Beller", "journal": "", "year": "", "authors": "Advisor ; Graham Watson Discovery; Allen Katz; Chris Ginsberg; Sean Phipps; Paul Bethard; Elinna Chase; Kristen Shek; . . Summers"}, {"title": "Crowdsourcing for (almost) Real-time Question Answering Denis Savenkov", "journal": "", "year": "", "authors": ""}, {"title": "Attention-Based Convolutional Neural Network for Machine Comprehension Wenpeng Yin, Sebastian Ebert and Hinrich Schütze", "journal": "", "year": "", "authors": ""}, {"title": "Open-domain Factoid Question Answering via Knowledge Graph Search Ahmad Aghaebrahimian", "journal": "", "year": "", "authors": ""}, {"title": "Learning to Query Tables in Natural Language Pengcheng Yin", "journal": "", "year": "", "authors": "Neural Enquirer; ; Zhengdong Lu; Hang Li; . . Kao Ben"}, {"title": "Neural Generative Question Answering Jun Yin, Xin Jiang", "journal": "", "year": "", "authors": "Zhengdong Lu; Lifeng Shang; Hang Li; Xiaoming Li; . . "}, {"title": "Identifying Paintings from Text Descriptions Anupam Guha", "journal": "", "year": "", "authors": "Mohit Iyyer; Jordan Boyd-Graber; . . "}, {"title": "Using Confusion Graphs to Understand Classifier Error Davis", "journal": "", "year": "", "authors": "Jordan Yoshida; . . Boyd-Graber"}, {"title": ":40 Attention-Based Convolutional Neural Network for Machine Comprehension Wenpeng Yin", "journal": "", "year": "", "authors": "Ying Xu; Yusuke Martínez-Gómez; Randy Miyao;  . . . . . . . . . . . . . . . . . . . . ; Graham Goebel; Allen Katz; Chris Ginsberg; Sean Phipps; Paul Bethard;  Chase"}], "figures": [], "doi": ""}